{
  "name": "SmartlookConsentSDK",
  "version": "1.0.1",
  "summary": "This SDK provides a configurable control panel where user selects her privacy options.",
  "description": "This SDK:\n\n- provides a configurable control panel where user selects her privacy options\n- stores the selected user preferences to be used in your app\n- works both with Swift and Objective-C apps\n- all texts are fully localizable\n- privacy policies may be provided by an external web page that is presented w/out leaving the app (see localisation.)\n\nObtaining explicit user consent with gathering analytics data in an app, or with processing user’s personal data is important part of establishing user trust and seamless user experience.\n\nIt is also an obligation of an app developer stated in App Store Guidelines (2.5.14 and 5.1.2), necessary to fulfil in order to get your app approved for distribution. If your app e.g. uses a 3rd party tool for analytics, it is the sole responsibility of you as the app developer, not of the 3rd party tool provider, that the analytics tool does not start registering events in the app without user explicit consent.\n\nAlthough implementing some dialog to obtain user consents and store them for further reference seems pretty straightforward, digging into it reveals (as usual with “simple tasks”) many programming and design details that must be implemented, which are not the core functionality of your app.",
  "homepage": "https://github.com/smartlook/ios-consent-sdk/",
  "screenshots": [
    "https://sdk.smartlook.com/assets/SmartlookConsentSDKDemo2.gif",
    "https://sdk.smartlook.com/assets/ConsentSDK-Screenshot-iPhone.png"
  ],
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "Pavel Kroh": "pavelkroh@smartlook.com"
  },
  "source": {
    "git": "https://github.com/smartlook/ios-consent-sdk.git",
    "tag": "1.0.1"
  },
  "documentation_url": "https://github.com/smartlook/ios-consent-sdk/",
  "platforms": {
    "ios": "10.0"
  },
  "swift_version": "4.2",
  "source_files": "SmartlookConsentSDK/SmartlookConsentSDK/*.{h,m,c,swift}",
  "resource_bundles": {
    "SmartlookConsentSDK": [
      "SmartlookConsentSDK/SmartlookConsentSDK/**/*.{storyboard,xib}"
    ]
  }
}
