{
  "name": "GLGeoRealtime",
  "version": "3.1.1",
  "summary": "A geo collection and tag extraction framework",
  "description": "GLGeoRealtime is a location SDK and focuses on realtime geo data and tags",
  "homepage": "http://developer.glimr.io",
  "license": {
    "type": "Copyright",
    "text": "      GLIMR AB. TERMS OF SERVICE Last Updated: August 31, 2020\n \n      The following Katalysator AB. Terms of Service (“Terms” or \n      “Agreement”) constitutes a legal agreement between you and the entity on whose \n      behalf you are accessing the Service (as defined below) (“Developer”) and Katalysator AB.\n      Developer’s use of the Service is subject to the terms and conditions set forth below, so Developer should take \n      the time to fully understand how these Terms govern Developer’s relationship with \n      Katalysator and Developer’s use of the Service. If you have questions regarding the \n      Terms, please contact Katalysator at team@katalysator.io. \n      DEVELOPER’S RIGHT TO USE THE SERVICE IS EXPRESSLY CONDITIONED ON \n      ACCEPTANCE OF THESE TERMS. BY USING THE SERVICE, YOU ARE AGREEING \n      TO BE BOUND BY THE TERMS ON BEHALF OF DEVELOPER. IF YOU ARE \n      ACCESSING THE SERVICE ON BEHALF OF YOUR EMPLOYER OR ANOTHER \n      ENTITY, YOU REPRESENT AND WARRANT THAT YOU HAVE THE AUTHORITY TO \n      AGREE TO THESE TERMS ON ITS BEHALF. IF DEVELOPER DOES NOT AGREE \n      WITH ANY PROVISION OF THE TERMS, OR YOU DO NOT HAVE AUTHORITY TO \n      BIND DEVELOPER, YOU MAY NOT ACCESS OR USE THE SERVICE IN ANY \n      MANNER FOR ANY PURPOSE.\n\n"
  },
  "authors": {
    "Sven Roeder": "sven@glimr.io"
  },
  "platforms": {
    "ios": "9.0"
  },
  "source": {
    "git": "https://github.com/KatalysatorAB/glimr-ios-lite.git",
    "tag": "3.1.1"
  },
  "exclude_files": "Sample",
  "frameworks": [
    "CoreLocation",
    "CoreTelephony",
    "AdSupport",
    "SystemConfiguration",
    "MobileCoreServices"
  ],
  "preserve_paths": "GLGeoRealtime.xcframework/*",
  "vendored_frameworks": "GLGeoRealtime.xcframework",
  "requires_arc": true,
  "xcconfig": {
    "FRAMEWORK_SEARCH_PATHS": "$(inherited)"
  }
}
