{
  "name": "YbridPlayerSDK",
  "version": "0.13.1",
  "summary": "Audio player SDK for iOS.",
  "description": "Audio player SDK written in Swift supports audio codecs mp3, acc and opus.\nThis XCFramework runs on iOS devices and simulators version 9 to 14.",
  "homepage": "https://github.com/ybrid/player-sdk-swift",
  "license": {
    "type": "MIT",
    "text": "  MIT License\n\n  Copyright (c) 2021 nacamar GmbH - Ybrid®, a Hybrid Dynamic Live Audio Technology\n  \n      Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n  \n      The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n      THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n  \n  \n  3rd party licenses\n  This project uses [ogg-swift](https://github.com/ybrid/ogg-swift) and [opus-swift](https://github.com/ybrid/opus-swift).\n  \n  ogg\n  Project ogg-swift makes use of the sources for ogg from [xiph.org/downloads](https://xiph.org/downloads/). \n  Ogg is licensed under the [New BSD License](https://wiki.xiph.org/XiphWiki:Copyrights).\n  \n      Copyright (c) 2002, Xiph.org Foundation\n  \n      The New BSD License states that:\n  \n      Redistribution and use in source and binary forms [of this work], with or without modification, are permitted provided that the following conditions are met:\n      Redistributions of source code must retain the copyright notice, this list of conditions, and the following disclaimer.\n      Redistributions in binary form must reproduce the copyright notice, this list of conditions, and the following disclaimer in the documentation, and/or other materials provided with the distribution.\n      Neither the name of the Xiph.Org Foundation nor the names of its contributors may be used to endorse or promote products derived from this work without specific prior written permission.\n      THIS WORK IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS WORK, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \n  opus\n  Project opus-swift creates the opus binaries from [opus-codec.org/downloads](https://opus-codec.org/downloads/).\n  Both the reference implementation and the revised implementations on opus-codec.org are available under the three-clause BSD license. This BSD license is compatible with all common open source and commercial software licenses, see [details](https://opus-codec.org/license).\n  \n      Copyright 2001-2011 Xiph.Org, Skype Limited, Octasic, Jean-Marc Valin, Timothy B. Terriberry,\n                          CSIRO, Gregory Maxwell, Mark Borgerding, Erik de Castro Lopo\n  \n      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n      Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n      Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n      Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission.\n      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n  \n      Opus is subject to the royalty-free patent licenses which are specified at:\n  \n      Xiph.Org Foundation:\n      https://datatracker.ietf.org/ipr/1524/\n  \n      Microsoft Corporation:\n      https://datatracker.ietf.org/ipr/1914/\n  \n      Broadcom Corporation:\n      https://datatracker.ietf.org/ipr/1526/  \n  \n"
  },
  "authors": {
    "Florian Nowotny": "Florian.Nowotny@nacamar.de"
  },
  "source": {
    "http": "https://github.com/ybrid/player-sdk-swift/releases/download/0.13.1/YbridPlayerSDK.xcframework.zip"
  },
  "swift_versions": "4.0",
  "platforms": {
    "ios": "9.0",
    "osx": "10.10"
  },
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "frameworks": "YbridPlayerSDK",
  "vendored_frameworks": "YbridPlayerSDK.xcframework",
  "dependencies": {
    "YbridOgg": [
      "0.8.0"
    ],
    "YbridOpus": [
      "0.8.0"
    ]
  },
  "swift_version": "4.0"
}
