{
  "name": "MLImageCache",
  "version": "1.0.3",
  "summary": "Simple yet powerful and fast image cache.",
  "description": "                 # MLImageCache\n                 ## Simple yet powerful asynchronous image cache\n                 \n                 MLImageCache has been written as an alternative to clumsy [SDWebCache](https://github.com/rs/SDWebImage). It is based on NSOperation / NSOperationQueue combo, which gives it additional features and safety. \n                 \n                 The highlights:\n                 \n                 * Two .m files and .h files. Just drag to your project and go. You can also use CocoaPods.\n                 * Asynchronous download and disk read gives it an unmatched speed. It does not interfere with scrolling.\n                 * Uses ARC and is carefully engineered not to induce strong reference cycles. It's memory reliability is thoroughly tested.\n                 * It downloads only one copy of an image no matter how many times has it been requested.\n                 * It can download arbitrary data, not only images.\n                 * It supports prioritization and simultaneous downloads based on NSOperationQueue priority system.\n                 \n                 ## Installation\n                   \n                 Use CocoaPods or copy those 4 files directly into the project. In the latter case you also have to install [ASIHTTPRequest](http://allseeing-i.com/ASIHTTPRequest/). \n                   \n                 If you wonder why do I use this seemingly obsolete library compare its stability and functionality to [AFNetworking](https://github.com/AFNetworking/AFNetworking). It does not change interface every few months and is super-stable and tested. \n                   \n                 ## How to use it?\n                   \n                     #import \"UIImageView+Cache.h\"\n                     ...\n                     [self.imageView setImageWithURL: self.urlToImage ];\n                 And that's it! You can replace SDImageCache instantly. For more advanced features see MLImageCache.h\n                                       \n",
  "homepage": "https://github.com/mll/MLImageCache",
  "license": "MIT",
  "authors": {
    "Marek Lipert": "marek.lipert@gmail.com"
  },
  "platforms": {
    "ios": "5.0"
  },
  "source": {
    "git": "https://github.com/mll/MLImageCache.git",
    "tag": "1.0.3"
  },
  "source_files": "*.{h,m}",
  "requires_arc": true,
  "dependencies": {
    "ASIHTTPRequest": [
      "~> 1.8"
    ]
  }
}
