{
  "name": "CoreParse",
  "version": "1.1",
  "summary": "A shift/reduce parsing framework for Mac OS X and iOS",
  "description": "                      CoreParse\n                      =========\n\n                      CoreParse is a parsing library for Mac OS X and iOS.  It supports a wide range of grammars thanks to its shift/reduce parsing schemes.  Currently CoreParse supports SLR, LR(1) and LALR(1) parsers.\n\n                      For full documentation see http://beelsebob.github.com/CoreParse.\n\n                      Why Should You use CoreParse\n                      ----------------------------\n\n                      You may wonder why and/or when you should use CoreParse.  There are already a number of parsers available in the wild, why should you use this one?\n\n                      * Compared to ParseKit:\n                        * CoreParse supports more languages (LR(1) languages cover all LL(1) languages and more).  In practice, LALR(1) grammars cover most useful languages.\n                        * CoreParse produces faster parsers.\n                        * CoreParse parsers and tokenisers can be archived using NSKeyedArchivers to save regenerating them each time your application runs.\n                        * CoreParse's parsing algorithm is not recursive, meaning it could theoretically deal with much larger hierarchies of language structure without blowing the stack.\n                      * Compared to lex/yacc or flex/bison:\n                        * While I have no explicitly benchmarked, I would expect parsers produced by lex/yacc or flex/bison to be faster than CoreParse ones.\n                        * CoreParse does not _require_ you to compile your parser before you start (though it is recommended).\n                        * CoreParse provides allows you to specify grammars right in your Objective-C source, rather than needing another language, which intermixes C/Obj-C.\n                        * CoreParse does not use global state, multiple parser instances can be run in parallel (or the same parser instance can parse multiple token streams in parallel).\n",
  "homepage": "https://github.com/beelsebob/CoreParse",
  "authors": "Tom Davie",
  "license": "MIT",
  "source": {
    "git": "https://github.com/beelsebob/CoreParse.git",
    "tag": "1.1"
  },
  "source_files": [
    "CoreParse",
    "CoreParse/**/*.{h,m}"
  ],
  "exclude_files": "CoreParse/CPSenTestKitAssertions.h",
  "requires_arc": false
}
