{
  "name": "EndpassSDK",
  "version": "1.0.0",
  "summary": "Endpass helps you securely verify your identity with third parties, while protecting you from fraud.",
  "description": "Tired of trying to find your identity documents? It’s even more annoying to re-upload them every time you want to create a new account that requires you to upload a passport or other ID documents.\n\nWe created Endpass because we wanted to make it less painful for legitimate customers, like you, to verify identities, especially when meeting KYC (Know Your Customer) and AML (Anti-Money Laundering) requirements. \n\nUPLOAD DOCUMENTS FOR VERIFICATION. THEN REUSE THEM.\nWith Endpass, you only have to upload your identity documents for verification ONCE. After a document is approved, you can reuse it for automatic verification, as long as the document isn't expired.\n\nHere are some of the types of documents we can verify: \n-driver licenses\n-state and national identity cards \n-passports\n-valid \"Proof of Address\" documents, such as utility bills. \n\nHOW IT WORKS:\nUpload an image of your ID documents from your photo library or take a new photo with your camera, and our AI will automatically analyze them for authenticity.\n\nDocument verification takes just a few seconds, as long as your image isn’t dark, blurry, or chopped off. But in some unique cases, additional review is required to successfully authenticate your information.\n\nAll your information is encrypted in the cloud, and accessible from any device. We offer multiple methods of 2 Factor Authentication to protect your privacy with the highest level of security. \n\nThank you for helping us in our fight against fraud and cybercrime!",
  "homepage": "https://endpass.com",
  "license": {
    "type": "MIT",
    "text": "                   Copyright (c) 2020 Endpass, Inc\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
  },
  "authors": {
    "Endpass Inc": "support@endpass.com"
  },
  "platforms": {
    "ios": "12.0"
  },
  "ios": {
    "vendored_frameworks": "EndpassSDK.framework"
  },
  "source": {
    "http": "https://github.com/endpass/endpass-ios-sdk-public/raw/master/EndpassSDK.zip"
  }
}
