{
  "name": "SidewalkSDK",
  "version": "1.0.0",
  "summary": "Sidewalk Mobile SDK is for mobile developers who want to build customized Sidewalk applications.",
  "description": "Sidewalk Mobile SDK provides a one-stop shop for everything related to Sidewalk on mobiles. It has its own Bluetooth and network stack, and is able to communicate to both the edge device (over BLE) and the Sidewalk cloud. Currently, the Sidewalk Mobile SDK exports the underlying Alexa Mobile Accessory (AMA) BLE stack, and allows applications to scan for AMA beaconing devices and then provision these devices over AMA to use the Sidewalk network. It handles the interaction between the Sidewalk cloud and edge device, exchanging keys and registering the edge device, so that the edge device can connect to the Sidewalk network via Sidewalk gateways. Authentication is provided via integration with Login with Amazon (LWA).\n\nSidewalk Mobile SDK is designed to assist developers in integrating common Sidewalk user controls into developers’ own mobile applications for controls such as the endpoint registration and de-registration. Sidewalk Mobile SDK is able to communicate to both the endpoint (over BLE) and the Sidewalk cloud.\n\nSidewalk Mobile SDK applications are required to integrate with Login with Amazon (LWA) SDK to collect a user Auth Token for issuing Sidewalk controls. The iOS Mobile SDK also requires OpenSSL.",
  "homepage": "https://www.amazon.com/sidewalk",
  "authors": "Amazon.com, Inc.",
  "source": {
    "http": "https://d3u6y4521ejid.cloudfront.net/Sidewalk_iOS_SDK_1.0.0_framework.zip"
  },
  "platforms": {
    "ios": "12.1"
  },
  "vendored_frameworks": [
    "Sidewalk_iOS_SDK/Frameworks/SidewalkSDK.xcframework"
  ],
  "license": {
    "type": "PMLA",
    "text": "<<-LICENSE\nCopyright 2023 Amazon.com, Inc., Ring, LLC and/or their affiliates, referred to herein collectively as \"Amazon\". All\nRights Reserved.\n\nThese materials are licensed to you as \"Program Materials\" under the Program Materials License Agreement (the\n\"Agreement\") in connection with the Amazon Sidewalk Program and related services. The Agreement is available at\ndeveloper.amazon.com. See the Agreement for the specific terms and conditions of the Agreement. Capitalized terms not\ndefined in this file have the meanings given to them in the Agreement.\n\nIn addition to the terms and conditions of the Agreement, the following terms and conditions (\"Additional Terms\" and\ncollectively with the Agreement, the \"Terms\") apply to these materials. In the event of a conflict between the terms and\nconditions of the Agreement and these Additional Terms, these Additional Terms will apply.\n\nYou may only use the Program Materials to (a) evaluate, develop, test, and troubleshoot the operation and compatibility\nof the Program Materials with Your Products; and (b) integrate the Program Materials into Your Products that access the\nSidewalk Service. If any of the Program Materials incorporated in Your Product were provided to you in source code form,\nsuch Program Materials (and modifications thereof) may be distributed solely in binary form as incorporated in Your\nProducts. You may not distribute any of Your Products that incorporate or were developed using the Program Materials\nunless you submit Your Product to us for approval and we specifically approve the distribution in writing.\n\nNotwithstanding the foregoing, if you are a system-on-chip manufacturer, you may distribute the Program Materials,\nincluding any source code (subject to the limitations herein) made available by Amazon, to device manufacturers for the\npurpose of such device manufacturers integrating the Program Materials in their digital and physical products that\naccess the Sidewalk Service; provided that you also make available this LICENSE.TXT file to such device manufacturer\ntogether with the Program Materials. For the purpose of the Terms, such Program Materials will be deemed to have been\nmade available to the device manufacturers from Amazon.\n\nWITH THE EXCEPTION OF FILES IDENTIFIED AS A \"MODIFIABLE FILE\" WITHIN THE FILE HEADER, YOU MAY NOT MODIFY ANY SOURCE CODE\nIN ANY FILE IN THIS PACKAGE. Your modifications to the Program Materials are “Modified Materials”. You may reproduce\nand distribute copies of the Modified Materials thereof in any medium, with or without modifications, and in source or\nobject form, provided that you meet the following conditions:\n\n* You must give any other recipients of the Modified Materials a copy of this License; and\n\n* You must cause any modified files to carry prominent notices stating that you changed the files; and\n\n* You must retain, in the source form of any Modified Materials that you distribute, all copyright, patent,\ntrademark, and attribution notices from the source form of the Program Materials, excluding those notices that do not\npertain to any part of the Modified Materials; and\n\n* If the Program Materials include a \"NOTICE\" text file as part of its distribution, then any Modified Materials\nthat you distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding\nthose notices that do not pertain to any part of the Modified Materials, in at least one of the following places: within\na NOTICE text file distributed as part of the Modified Materials; within the source form or documentation, if provided\nalong with the Modified Materials; or, within a display generated by the Modified Materials, if and wherever such\nthird-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not\nmodify the License. You may add your own attribution notices within Modified Materials that you distribute, alongside or\nas an addendum to the NOTICE text from the Program Materials, provided that such additional attribution notices cannot\nbe construed as modifying this Agreement.\n\nYou may add your own copyright statement to your modifications and may provide additional or different license terms and\nconditions for use, reproduction, or distribution of your modifications, or for any such Modified Materials as a whole,\nprovided your use, reproduction, and distribution of the Program Materials otherwise complies with the conditions stated\nin this Agreement.\n\nEXTERNAL DEPENDENCIES\n\n=====================\n\nThese materials may include and/or be dependent upon certain third-party libraries or other software packages (\"External\nDependencies\").  If you do not agree with every term in the license file associated with the External Dependencies, you\nshould not use these materials.\n\nTHIS INFORMATION IS PROVIDED FOR CONVENIENCE ONLY. AMAZON DOES NOT PROMISE THAT THE EXTERNAL DEPENDENCIES AND THEIR\nAPPLICABLE TERMS ARE COMPLETE, ACCURATE, OR UP-TO-DATE, AND AMAZON WILL HAVE NO LIABILITY FOR ANY OMISSIONS OR\nINACCURACIES. YOU SHOULD CONSULT THE DOWNLOAD SITES FOR THE EXTERNAL DEPENDENCIES FOR THE MOST COMPLETE AND UP-TO-DATE\nLICENSING INFORMATION.\n\nYOUR USE OF THE EXTERNAL DEPENDENCIES IS AT YOUR SOLE RISK. IN NO EVENT WILL AMAZON BE LIABLE FOR ANY DAMAGES, INCLUDING\nWITHOUT LIMITATION ANY DIRECT, INDIRECT, CONSEQUENTIAL, SPECIAL, INCIDENTAL, OR PUNITIVE DAMAGES (INCLUDING FOR ANY LOSS\nOF GOODWILL, BUSINESS INTERRUPTION, LOST PROFITS OR DATA, OR COMPUTER FAILURE OR MALFUNCTION) ARISING FROM OR RELATING\nTO THE EXTERNAL DEPENDENCIES, HOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, EVEN IF AMAZON HAS BEEN ADVISED\nOF THE POSSIBILITY OF SUCH DAMAGES. THESE LIMITATIONS AND DISCLAIMERS APPLY EXCEPT TO THE EXTENT PROHIBITED BY\nAPPLICABLE LAW.\n\nIf you do not agree to the Terms, you may not use any file in this package.\n\n    LICENSE"
  }
}
