{
  "name": "AcessibilityFaceMouse",
  "version": "0.0.3",
  "summary": "Pega a movimentação da face do usuário e cria um cursor virtual no dispositivo. (Somente iphones X ou superior)",
  "description": "A AcessibilityFaceMouse é um pod com intuito de possibilitar que pessoas com movimentação debilitada dos membros superiores, possam interagir com aplicativos sem a utilização de algum acessório. \n  Ele pega a movimentação da face do usuário e cria uma representação desses movimentos em forma de cursor na tela. Ao passar por cima de alguma view, como um botão, ele pode usar gestos para ativar aquela ação.\n    Temos quatro tipos de gestos: Piscar olho direito; piscar olho esquerdo; mostrar a língua ou com um comando de voz. Esse comando de voz pode receber quatro ações, a primeira é de toque em algo, segundo de voltar\n    na navegação com navigationcontroller, o de próximo e de anterior, para usar em views que tem scroll, como celular e collectionsviews. Para demais ações, deve-se integrar componentes que possam facilitar na hora da utilização\n    da aplicação.\n    A ação com voz ainda está em fase de testes. O mais recomendado é o da língua, pois tiveram os melhores resultados, diminuindo assim o esforço repetitivo.\nPara utilizar basta mudar a herança de uma classe que herda da viewcontroller  pela AccessibilityFaceAnchorViewController e iniciar os recursos necessarios. \nPara uma melhor utilização do usuário existe a classe AcessibilityGetSensitivityViewController, que tem função de capturar as limitações da face do usuário e assim se adequando ao seu ritmo.",
  "homepage": "https://github.com/JBatista1/AcessibilityFaceMouse",
  "license": "Amigo, Faça o que você quiser com intuito de ajudar as pessoas. Só lembra de me mencionar no copyright",
  "authors": {
    "João Batista Romão": "j.batista.damasceno@icloud.com"
  },
  "platforms": {
    "ios": "13.0"
  },
  "source": {
    "git": "https://github.com/JBatista1/AcessibilityFaceMouse.git",
    "tag": "0.0.3"
  },
  "source_files": [
    "AcessibilityFaceMouse/**/*.{h,m,.swift}",
    "AcessibilityFaceMouse"
  ]
}
