{
  "name": "KDIntroView",
  "version": "1.1.1",
  "summary": "KDIntroView is a framework to create dynamic introduction views for App. You can create all sorts of cool animations.",
  "description": "Step One\n\nCreate all the views you need as xibs. Link each xib file with a class that inherits KDIntroView. Override moveEverythingAccordingToIndex(index: CGFloat).\n\nDesign your interface as you wish. This framework works for both code generated UI and autolayout.\n\nMake sure each view has a clear background color if you wish to perform color change.\n\nStep Two\n\nCreate a ViewController that inherits KDIntroViewController. (don't forget to import KDIntroView)\n\nIn viewWillAppear, call setup, and pass in an array that contains the name of all the xibs you created. Arrange them in the order you with them to appear. Override moveEverythingAccordingToIndex(index: CGFloat).\n\nNow, you can see your views, but they are static.\n\nStep Three\n\nImplement the moveEverythingAccordingToIndex(index: CGFloat) in each view. The index: CGFloat variable is the offset of the scroller. In the first and the last view, index: CGFloat range from 0 ~ frame.width. In all the other views, index: CGFloat range from 0 ~ 2 * frame.width.\n\nWe have build-in functions, but you can easily customize your animation with CGAffineTransformation. There are more example in the demo project.\n\nAlso implement the moveEverythingAccordingToIndex(index: CGFloat) in viewcontroller to perform color animation and touchable elements. All the touchable elements must be added in the view controller and call view.bringSubviewToFront() after setup to make them reachable.\n\nYou can literally create any kind of animation! Play around with it, and free your imagination!\n                       * Markdown format.\n                       * Don't worry about the indent, we strip it!\n",
  "homepage": "https://github.com/likedan/KDIntroView",
  "license": "MIT",
  "authors": {
    "likedan": "likedan5@icloud.com"
  },
  "source": {
    "git": "https://github.com/likedan/KDIntroView.git",
    "tag": "1.1.1"
  },
  "social_media_url": "http://takefiveinteractive.com",
  "platforms": {
    "ios": "8.0"
  },
  "requires_arc": true,
  "source_files": "Pod/Classes/*.swift",
  "resource_bundles": {
    "KDIntroView": [
      "Pod/Assets/*.png"
    ]
  }
}
