{
  "name": "nashidVerifySDK",
  "version": "2.6.4-rc-ebb9c74",
  "summary": "Nashid Verify SDK",
  "description": "The iOS SDK of Nashid Verify KYC tool",
  "homepage": "https://www.nashid.io",
  "authors": "Nashid Enterprises (dev@nashid.io)",
  "platforms": {
    "ios": "15.0"
  },
  "swift_versions": "5.0",
  "source": {
    "http": "https://sdks.nashid.io/2.6.4-rc-ebb9c74/NewVerifySDK.xcframework.zip"
  },
  "requires_arc": true,
  "static_framework": true,
  "vendored_frameworks": "NewVerifySDK.xcframework",
  "dependencies": {
    "Alamofire": [
      "5.10.2"
    ],
    "lottie-ios": [
      "4.5.0"
    ],
    "SDWebImage": [
      "5.20.0"
    ],
    "OpenSSL-Universal": [
      "1.1.2301"
    ],
    "SwiftyTesseract": [
      "3.1.3"
    ],
    "FirebaseAnalytics": [
      ">= 11.0",
      "< 12.0"
    ]
  },
  "pod_target_xcconfig": {
    "ARCHS[sdk=iphoneos*]": "arm64",
    "ARCHS[sdk=iphonesimulator*]": "x86_64",
    "VALID_ARCHS": "x86_64 arm64"
  },
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "license": {
    "type": "proprietary",
    "text": "\n    Copyright (c) 2024  Nashid Enterprises LL\n\n    This License Agreement (\"Agreement\") governs the use of the Nashid Verify \n    SDK (\"Software\"), developed by Nashid Enterprises LLC (\"Licensor\"). The \n    Software includes all associated updates, modifications, and documentation \n    provided by the Licensor.\n    This Agreement outlines the terms under which any individual or entity \n    (\"Licensee\") may use, integrate, and distribute the Software. The Software is \n    designed to enable identity verification services and is intended for \n    integration into the Licensee's own applications, subject to the restrictions \n    and obligations outlined herein.\n\n    1 Interpretations\n\n      1.1 Definitions\n      In this Agreement, unless the context otherwise requires:\n        - \"Agreement\" refers to this Nashid Verify SDK License Agreement.\n        - \"Licensor\" refers to Nashid Enterprises LLC, the entity providing the \n        Software under this Agreement.\n        - \"Licensee\" refers to any individual or entity that downloads, uses, or \n        integrates the Software under the terms of this Agreement.\n        - \"Software\" refers to the Nashid Verify SDK, including any updates, \n        modifications, and related documentation provided by the Licensor.\n        - \"Services\" refers to the identity verification services provided by the \n        Software as part of its functionality.\n        - \"Confidential Information\" refers to any non-public, proprietary \n        information disclosed by the Licensor to the Licensee during the term \n        of this Agreement.\n        - \"Intellectual Property Rights\" refers to all rights, titles, and interests in \n        and to the Software, including but not limited to patents, trademarks, \n        copyrights, trade secrets, and other proprietary rights.\n        - \"Term\" refers to the duration of this Agreement as defined in the Term \n        and Termination section.\n        - \"Territory\" refers to the geographic area in which the Licensee is \n        permitted to use the Software as specified by the Licensor.\n\n      1.2 Interpretation Rules\n        - Words denoting the singular include the plural and vice versa.\n        - References to any statute, regulation, or other law include all \n        amendments, re-enactments, and modifications thereto.\n        - Section headings are inserted for convenience only and do not affect \n        the interpretation of this Agreement.\n        - The terms \"including,\" \"include,\" or \"in particular\" shall be construed as\n        illustrative and not limiting the scope of the preceding words.\n\n    2 License Grant and Use\n\n      2.1 License Grant\n      Subject to the terms and conditions of this Agreement, Nashid Enterprises \n      LLC (\"Licensor\") hereby grants the Licensee a non-exclusive, non-\n      transferable right and license, without the right to grant sublicenses, to use \n      the Nashid Verify SDK (\"Software\") and any accompanying documentation \n      during the term of this Agreement, solely for the Licensee's internal business\n      operations.\n\n      2.2 Prohibited Uses\n      The Licensee shall not access, store, distribute, or transmit any material \n      using the Software that:\n        (a) Is unlawful, harmful, threatening, defamatory, obscene, infringing, \n        harassing, or racially or ethnically offensive;\n        (b) Facilitates illegal activity;\n        (c) Promotes unlawful violence;\n        (d) Is discriminatory based on race, gender, color, religious belief, sexual \n        orientation, disability; or\n        (e) Is otherwise illegal or causes damage or injury to any person or \n        property.\n      The Licensor reserves the right to disable the Licensee's access to any \n      material that breaches these provisions.\n\n      2.3 License Restrictions\n      The Licensee shall not:\n        (a) Copy, modify, duplicate, create derivative works from, frame, mirror, \n        republish, download, display, transmit, or distribute any portion of the \n        Software and/or Documentation in any form or media;\n        (b) Decompile, reverse engineer, or otherwise attempt to derive the \n        source code of the Software;\n        (c) Access the Software and Documentation to build a product or service \n        which competes with the Software and/or Documentation;\n        (d) Use the Software and/or Documentation to provide services to third \n        parties;\n        (e) License, sell, rent, lease, transfer, assign, distribute, display, disclose, \n        or otherwise commercially exploit the Software and/or Documentation; \n        or\n        (f) Introduce any viruses, malware, or vulnerabilities into the Licensor's \n        network and information systems.\n\n      2.4 Unauthorized Access\n      The Licensee shall use all reasonable endeavors to prevent any unauthorized\n      access to, or use of, the Software and/or Documentation and shall promptly \n      notify the Licensor in writing of any such unauthorized access or use.\n\n      2.5Ancillary Licenses\n      The Licensee's rights to utilize the Software for Android, iOS, and web \n      platforms are granted solely to the Licensee and shall not extend to any \n      subsidiary or holding company of the Licensee.\n\n    3 Services\n\n      3.1 Service Provision\n      Nashid Enterprises LLC (\"Licensor\") shall provide access to the Nashid Verify \n      SDK (\"Software\") and make available any related documentation to the \n      Licensee, subject to the terms of this Agreement.\n\n      3.2 Availability\n      The Licensor shall use commercially reasonable efforts to ensure the \n      Software is available 24 hours a day, seven days a week, except during:\n        (a) Planned maintenance, typically carried out between 6:00 PM and 12:00\n        AM Oman time.\n        (b) Unscheduled maintenance outside of regular business hours, with \n        reasonable efforts made to provide the Licensee with at least 72 hours'\n        notice.\n\n      3.3 Support Services\n      The Licensor may provide standard support services at no additional cost, in \n      accordance with the Licensor's support policy. The Licensor reserves the right\n      to amend this policy as needed. Enhanced support services may be available\n      for purchase at current rates.\n\n      3.4 Hardware Requirements\n      The Licensee acknowledges that certain hardware may be required for \n      optimal use of the Software. The Licensor will provide recommendations for \n      suitable hardware specifications.\n      3.5Software Functionality\n      The Software enables the Licensee to perform various identity verification \n      tasks, including but not limited to:\n        - Identity document scanning\n        - Identity document NFC reading\n        - Human liveness verification\n        - Human facial matching\n\n    4 Data Protection\n\n      4.1 Privacy Commitment\n      Nashid Enterprises LLC (\"Licensor\") is committed to preserving privacy and \n      data protection in accordance with the Personal Data Protection Law (PDPL) \n      of Oman. All functions of the Nashid Verify SDK (\"Software\") are designed \n      with these principles in mind.\n\n      4.2 Data Transmission\n      No personal data will be transmitted to third-party networks through the \n      Software without obtaining explicit consent from the data owner. This \n      ensures compliance with data privacy regulations and protects the rights of \n      individuals whose data is processed using the Software.\n\n    5 Third Party Providers\n\n      5.1 Third-Party Interactions\n      The Licensee acknowledges that the Nashid Verify SDK (\"Software\") may \n      enable or assist in accessing content, services, and products from third-party\n      websites. Any interaction with third-party websites, including the purchase of\n      products or services, is done solely at the Licensee's own risk.\n      Nashid Enterprises LLC (\"Licensor\") makes no representation, warranty, or \n      commitment regarding the content, use, or transactions conducted with any \n      third-party websites. Any contracts or transactions entered into are solely \n      between the Licensee and the relevant third party.\n\n      5.2 No Endorsement\n      The Licensor does not endorse or approve any third-party websites or the \n      content made available through them. The Licensee is encouraged to review \n      the terms and conditions and privacy policies of any third-party websites \n      before engaging with them.\n\n    6 Licensor's Obligations\n\n      6.1 Performance Standards\n      Nashid Enterprises LLC (\"Licensor\") undertakes that the Nashid Verify SDK \n      (\"Software\") will perform substantially in accordance with the accompanying \n      documentation, with reasonable skill and care.\n\n      6.2 Limitations of the Undertaking\n      The obligation described in clause 5.1 does not apply in cases where non-\n      conformance is caused by:\n        (a) Use of the Software contrary to the Licensor's instructions.\n        (b) Modifications or alterations of the Software by any party other than the\n        Licensor or its authorized agents.\n      In the event of non-conformance, the Licensor will use reasonable efforts to \n      correct the issue or provide an alternative means of accomplishing the \n      intended functionality. This constitutes the Licensee's sole remedy for any \n      breach of the undertaking in clause 5.1.\n\n      6.3 Disclaimers\n      The Licensor does not warrant that:\n        (a) The Licensee's use of the Software will be uninterrupted or error-free.\n        (b) The Software, documentation, or information obtained through the \n        Software will meet the Licensee’s requirements.\n        (c) The Software will be free from vulnerabilities or viruses.\n\n      6.4 Independent Development\n      This Agreement does not prevent the Licensor from entering into similar \n      agreements with third parties or from independently developing, using, \n      selling, or licensing documentation, products, and services similar to those \n      provided under this Agreement.\n\n      6.5Legal Compliance\n      The Licensor warrants that it has and will maintain all necessary licenses, \n      consents, and permissions required for the performance of its obligations \n      under this Agreement.\n\n    7 Licensee's Obligations\n\n      7.1 General Obligations\n      The Licensee shall:\n        (a) Provide the Licensor with:\n          (i) All necessary cooperation in relation to this Agreement; \n          and\n          (ii) All necessary access to information required by the \n          Licensor to provide support or updates for the Software, \n          including but not limited to security access information and\n          configuration settings.\n        (b) Comply with all applicable laws and regulations regarding its activities \n        under this Agreement.\n        (c) Ensure that any authorized users use the Software and Documentation \n        in accordance with the terms of this Agreement, and the Licensee shall\n        be responsible for any breach of this Agreement by its authorized \n        users.\n        (d) Obtain and maintain all necessary licenses, consents, and permissions \n        necessary for the use of the Software and to enable the Licensor to \n        perform its obligations under this Agreement.\n        (e) Ensure that its network and systems comply with the relevant \n        specifications provided by the Licensor.\n        (f) Be solely responsible for procuring and maintaining network \n        connections and telecommunications links from its systems to the \n        Software, and for all problems, conditions, delays, delivery failures, and\n        all other loss or damage arising from or related to the Licensee's \n        network connections or telecommunications links or caused by the \n        internet.\n\n      7.2 Data Responsibility\n      The Licensee shall retain all rights, title, and interest in and to all data it \n      provides for use with the Software (\"Licensee Data\") that is not personal \n      data. The Licensee is solely responsible for the legality, reliability, integrity, \n      accuracy, and quality of all such Licensee Data.\n\n    8 Charges and Payment\n\n      8.1 Payment Obligation\n      The Licensee shall pay fees for the use of the Nashid Verify SDK (\"Software\") \n      as stipulated in a separate agreement or contract between the Licensor and \n      the Licensee. The specific payment terms, amounts, and schedules are \n      outlined in that agreement.\n\n      8.2 Payment Terms\n        (a) All payments shall be made in accordance with the terms agreed \n        upon in the separate contract.\n        (b) If payment is not received within the time frame specified in the \n        contract, the Licensor reserves the right to disable the Licensee’s \n        access to the Software until full payment is received.\n        (c) Late payments may incur interest or penalties as specified in the \n        separate agreement.\n\n      8.3 Additional Costs\n      Any additional costs, such as taxes or transaction fees, shall be the \n      responsibility of the Licensee and will be billed according to the terms of the \n      separate agreement.\n\n      8.4 Fee Adjustments\n      The Licensor reserves the right to adjust the fees at the beginning of each \n      renewal period, subject to the terms specified in the separate agreement.\n\n    9 Proprietary Rights\n\n      9.1 Intellectual Property Ownership\n      The Licensee acknowledges and agrees that Nashid Enterprises LLC \n      (\"Licensor\") and/or its licensors own all intellectual property rights in the \n      Nashid Verify SDK (\"Software\") and associated documentation. This \n      Agreement does not grant the Licensee any rights to, under, or in any \n      patents, copyrights, database rights, trade secrets, trade names, trademarks\n      (whether registered or unregistered), or any other rights or licenses in \n      respect of the Software or documentation, except as expressly stated in this \n      Agreement.\n\n      9.2 Licensor's Rights\n      The Licensor confirms that it has all the necessary rights in relation to the \n      Software and documentation to grant the rights it purports to grant under \n      this Agreement.\n\n    10 Confidentiality\n\n      10.1 Definition of Confidential Information\n      Confidential Information refers to all confidential information (however \n      recorded or preserved) disclosed by one party (\"Disclosing Party\") to the \n      other party (\"Receiving Party\") in connection with the Software, including but\n      not limited to:\n        (a) The terms of this Agreement or any related agreements.\n        (b) Any information that would be considered confidential by a \n        reasonable business person relating to the Disclosing Party’s \n        business, assets, affairs, customers, clients, suppliers, plans, \n        intentions, or market opportunities.\n        (c) Information relating to the operations, processes, product \n        information, know-how, designs, trade secrets, or software of the\n        Disclosing Party.\n\n      10.2 Obligations of Confidentiality\n      Each party shall keep the other party's Confidential Information secret and \n      confidential and shall not:\n        (a) Use such Confidential Information except for the purpose of \n        exercising or performing its rights and obligations under this \n        Agreement.\n        (b) Disclose such Confidential Information in whole or in part to \n        any third party, except as expressly permitted by this section.\n\n      10.3 Permitted Disclosures\n      A party may disclose the other party's Confidential Information to its \n      employees, contractors, and advisers who need to know such information for\n      the purposes of this Agreement, provided that such representatives comply \n      with the confidentiality obligations set out in this Agreement.\n\n      10.4 Legal Disclosure\n      Confidential Information may be disclosed if required by law, governmental \n      or regulatory authority, or by a court or other authority of competent \n      jurisdiction, provided that the Receiving Party gives the Disclosing Party as \n      much notice of such disclosure as possible.\n\n      10.5 Return or Destruction of Confidential Information\n      Upon termination or expiry of this Agreement, each party shall destroy or \n      return all documents and materials containing the other party's Confidential \n      Information and certify in writing that it has complied with these \n      requirements. However, a party may retain documents and materials as \n      required by law or any applicable regulatory authority.\n\n      10.6 Continuation of Obligations\n      The obligations of confidentiality shall continue after the termination or \n      expiry of this Agreement.\n\n    11 Indemnity\n\n      11.1 Licensee Indemnity\n      The Licensee shall defend, indemnify, and hold harmless Nashid Enterprises \n      LLC (\"Licensor\") against any claims, actions, proceedings, losses, damages, \n      expenses, and costs (including without limitation court costs and reasonable \n      legal fees) arising out of or in connection with the Licensee's use of the \n      Nashid Verify SDK (\"Software\") and/or documentation.\n\n      11.2 Licensor Indemnity\n      The Licensor shall defend the Licensee against any claim that the Licensee’s \n      use of the Software in accordance with this Agreement infringes any Omani \n      patent, copyright, trademark, database right, or right of confidentiality, and \n      shall indemnify the Licensee for any amounts awarded in settlement, \n      provided that:\n        (a) The Licensor is given prompt written notice of any \n        claim.\n        (b) The Licensee provides reasonable cooperation to the \n        Licensor in the defense and settlement of such a claim.\n        (c) The Licensor is given sole authority to defend or settle \n        the claim.\n\n      11.3 Remedies\n      In the defense or settlement of any claim, the Licensor may:\n        (a) Procure the right for the Licensee to continue using the Software.\n        (b) Replace or modify the Software so that it becomes non-infringing.\n        (c) Terminate this Agreement on 2 Business Days' written notice without \n        additional liability if the above remedies are not reasonably available.\n\n      11.4 Limitations\n      The Licensor shall not be liable for infringements arising from:\n        (a) Modifications of the Software by the Licensee.\n        (b) Use of the Software contrary to Licensor instructions.\n        (c) Continued use of the Software after notice of the alleged infringement.\n\n    12. Limitation of Liability\n      12.1 No Liability for Results\n      Except as expressly provided in this Agreement:\n        (a) The Licensee assumes sole responsibility for results obtained from the \n        use of the Software and for conclusions drawn from such use.\n        (b) The Licensor excludes all implied warranties, representations, \n        conditions, and terms to the fullest extent permitted by law.\n        (c) The Software is provided on an \"as is\" basis.\n\n      12.2 Exclusions\n      Nothing in this Agreement excludes the liability of the Licensor for:\n        (a) Death or personal injury caused by the Licensor's negligence.\n        (b) Fraud or fraudulent misrepresentation.\n\n      12.3 Limitations\n      Subject to Sections 12.1 and 12.2:\n        (a) The Licensor shall not be liable for any loss of profits, business, data, or\n        information, or for any indirect, special, or consequential loss.\n        (b) The Licensor's total liability arising in connection with this Agreement \n        shall be limited to OMR 2,000.\n\n    13. Term and Termination\n\n      13.1 Term\n      This Agreement commences on the Effective Date and continues for an \n      Initial Term of 24 months. It automatically renews for successive periods \n      unless terminated with 30 days' notice before the end of the current term.\n\n      13.2 Termination for Cause\n      Either party may terminate this Agreement with immediate effect if the \n      other party:\n        (a) Fails to pay any amount due and remains in default for 45 days after \n        notice.\n        (b) Commits a material breach of this Agreement and fails to remedy it \n        within 30 days.\n        (c) Repeatedly breaches the Agreement.\n        (d) Becomes insolvent or enters into administration, among other similar \n        events.\n\n      13.3 Effects of Termination\n      On termination:\n        (a) All licenses granted under this Agreement shall immediately terminate.\n        (b) Each party shall return or destroy all Confidential Information of the \n        other party.\n        (c) The Licensor may destroy or return any Licensee data in its possession \n        unless requested otherwise within 10 days of termination.\n\n      13.4 Termination for Convenience\n      Either party may terminate this Agreement for convenience with 60 days’ \n      notice, with penalties applicable for early termination.\n\n    14.  Force Majeure\n\n    Neither party shall be liable for delays or failures in performance due to \n    events beyond its reasonable control. If such delay continues for three \n    months, the unaffected party may terminate this Agreement with 60 days'\n    notice.\n\n    15.  Conflict\n\n    If there is any inconsistency between the provisions in the main body of \n    this Agreement and any Schedules, the provisions in the main body shall \n    prevail.\n\n    16. Variation\n\n    No variation or amendment of this Agreement shall be effective unless in \n    writing and signed by both parties.\n\n    17.  Waiver\n\n    A waiver of any right or remedy under this Agreement is only effective if \n    given in writing and does not constitute a waiver of any subsequent right \n    or remedy.\n\n    18.  Rights and Remedies\n\n    Except as expressly provided in this Agreement, the rights and remedies \n    provided are in addition to any rights or remedies provided by law.\n\n    19.  Severance\n\n    If any provision of this Agreement is found to be invalid, illegal, or \n    unenforceable, it shall be deemed deleted, and the validity of the \n    remaining provisions shall not be affected.\n\n    20.  Entire Agreement\n\n    This Agreement constitutes the entire agreement between the parties and\n    supersedes all prior agreements and understandings.\n\n    21.  Assignment\n\n    The Licensee shall not assign or transfer its rights or obligations under \n    this Agreement without the prior written consent of the Licensor.\n\n    22.  No Partnership or Agency\n\n    Nothing in this Agreement creates a partnership or agency relationship \n    between the parties.\n\n    23.  Third-Party Rights\n\n    A person who is not a party to this Agreement shall have no rights to \n    enforce any of its provisions.\n\n    24.  Counterparts\n\n    This Agreement may be executed in counterparts, each of which shall be \n    deemed an original.\n\n    25.  Notices\n\n    Notices required under this Agreement shall be in writing and delivered \n    personally, by registered post, commercial courier, or email.\n\n    26.  Governing Law and Jurisdiction\n\n    This Agreement shall be governed by the laws of the Sultanate of Oman, \n    and the courts of Oman shall have exclusive jurisdiction to settle any \n    disputes.\n\n"
  },
  "swift_version": "5.0"
}
