{
  "name": "MoEngageCards",
  "version": "5.01.9",
  "homepage": "https://www.moengage.com",
  "documentation_url": "https://developers.moengage.com",
  "changelog": "https://developers.moengage.com/hc/en-us/articles/4404198236564-Changelog",
  "license": {
    "type": "Commercial",
    "text": "Copyright (c) 2026 MoEngage, Inc.\r\nAll rights reserved. \r\nUse of source code or binaries contained within MoEngage's SDKs is permitted only to enable use of the MoEngage platform by customers of MoEngage. The Licensee may not: \r\n- permit any third party to use the Software; \r\n- modify or translate the Software except as otherwise permitted; \r\n- reverse engineer, decompile, or disassemble the Software; \r\n- copy the Software, except as expressly provided above; or \r\n- remove or obscure any proprietary rights notices or labels on the Software. \r\n- Licensee may not transfer the Software or any rights under this Agreement without the Licensor's prior written consent. \r\n- MoEngage owns the Software and all intellectual property rights embodied therein, including copyrights and valuable trade secrets embodied in the Software. The Licensee shall not alter or remove this copyright notice. \r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF THE USER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
  },
  "authors": {
    "MobileDev": "mobiledevs@moengage.com"
  },
  "social_media_url": "https://twitter.com/moengage",
  "source": {
    "http": "https://github.com/moengage/apple-sdk/releases/download/10.10.0/MoEngageCards.xcframework.zip",
    "sha256": "84cf27a3f2298b4a7b33f868f2681e159571cfb76cf015906cf64544c782cb9e"
  },
  "platforms": {
    "ios": "13.0",
    "tvos": "13.0"
  },
  "requires_arc": true,
  "summary": "MoEngageCards Campaigns for iOS",
  "description": "Create targeted or automated App Inbox/NewsFeed messages that can be grouped into various categories, and target your users with different updates or offers that can stay in the Inbox/Feed over a designated period of time.",
  "vendored_frameworks": "MoEngageCards.xcframework",
  "frameworks": [
    "Foundation",
    "UIKit",
    "ImageIO"
  ],
  "dependencies": {
    "MoEngageCore": [

    ]
  }
}
