{
  "name": "Localytics-iOS-Client",
  "version": "2.21.1",
  "summary": "Localytics iOS SDK.",
  "description": "  Localytics is built for mobile & tablet apps. Integration is easy, takes just 10 minutes and requires only a few lines of code. A quick integration allows you to track all standard metrics such as platform, device type, sessions and unique users. Event and screen tracking are used to analyze conversion funnels, screen flows, feature usage, content access, advertising performance, etc. Full support for iOS, Android, BlackBerry, Windows Phone and HTML5 apps.\n\n  Localytics is designed to measure apps, providing the greatest accuracy and lightest footprint. Apps are different than websites, offering richer experiences and a deeper integration with the device. Apps function offline, survive intermittent network connectivity, support multitasking and access location services, storage, accelerometers, network details and more. Localytics collects and combines rich data to help you build more successful applications.\n",
  "homepage": "http://www.localytics.com/docs/",
  "license": {
    "type": "Copyright",
    "text": "      Copyright (c) 2013, Char Software, Inc. d/b/a Localytics\n      All rights reserved.\n\n      Redistribution and use in source and binary forms, with or without\n      modification, are permitted provided that the following conditions are met:\n          * Redistributions of source code must retain the above copyright\n            notice, this list of conditions and the following disclaimer.\n          * Neither the name of Char Software, Inc., Localytics nor the names of its \n            contributors may be used to endorse or promote products derived from this\n            software without specific prior written permission.\n\n      THIS SOFTWARE IS PROVIDED BY CHAR SOFTWARE, INC. D/B/A LOCALYTICS ''AS IS'' AND \n      ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n      WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE \n      DISCLAIMED. IN NO EVENT SHALL CHAR SOFTWARE, INC. D/B/A LOCALYTICS BE LIABLE \n      FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL \n      DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR \n      SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER \n      CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, \n      OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE \n      OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
  },
  "authors": "Char Software, Inc. d/b/a Localytics",
  "source": {
    "http": "http://downloads.localytics.com/SDKs/iOS/archive/Localytics-iOS-Client-2.21.1.source.zip"
  },
  "platforms": {
    "ios": "4.0"
  },
  "source_files": "**/*.{h,m}",
  "requires_arc": false,
  "compiler_flags": "-fno-objc-arc",
  "weak_frameworks": "AdSupport",
  "frameworks": "SystemConfiguration",
  "libraries": [
    "z",
    "sqlite3"
  ]
}
