{
  "name": "Realm",
  "version": "0.21.0",
  "summary": "Realm is a fantastic object framework for iOS.",
  "description": "                          Realm is an object framework for iOS. It aims to provide an easier way to handle data in your apps, whether you need in-memory objects, full database persistence, or a simple network cache.\n                          Realm’s basic structures look like Objects & Arrays for your language, but provide additional features such as: querying, relationships & graphs, thread safety,easy in/out JSON Mapping & more.\n                          A C++ core underneath provides a memory-efficient implementation of these features, with RLMObjects usually consuming less RAM than native Objects. The core also provides an optional persistence layer that can automatically save & retrieve your objects from disk with very high performance.\n",
  "homepage": "http://realm.io",
  "source": {
    "http": "http://static.realm.io/downloads/ios/realm-ios-0.21.0.zip"
  },
  "authors": {
    "Realm": "help@realm.io"
  },
  "platforms": {
    "ios": "7.0"
  },
  "libraries": "stdc++.6",
  "requires_arc": true,
  "social_media_url": "https://twitter.com/realm",
  "documentation_url": "http://realm.io/",
  "public_header_files": "Realm.framework/Headers/*.h",
  "vendored_frameworks": "Realm.framework",
  "license": {
    "type": "Copyright",
    "text": "                                        TIGHTDB CONFIDENTIAL\n                                        __________________\n                        \n                                        [2011] - [2014] TightDB Inc\n                                        All Rights Reserved.\n                        \n                                        NOTICE:  All information contained herein is, and remains\n                                        the property of TightDB Incorporated and its suppliers,\n                                        if any.  The intellectual and technical concepts contained\n                                        herein are proprietary to TightDB Incorporated\n                                        and its suppliers and may be covered by U.S. and Foreign Patents,\n                                        patents in process, and are protected by trade secret or copyright law.\n                                        Dissemination of this information or reproduction of this material\n                                        is strictly forbidden unless prior written permission is obtained\n                                        from TightDB Incorporated.\n"
  }
}
