{
  "name": "Checkout3DS",
  "version": "3.2.7",
  "summary": "Checkout 3DS SDK",
  "description": "The Checkout.com 3D Secure (3DS) mobile SDK allows you to provide a native 3DS2 experience in your mobile app, with visual styling that you can control.\n\nThe SDK handles the device data collection, communication with the card issuer, and presentation of 3D Secure challenges to the customer when required.",
  "homepage": "https://checkout.github.io/checkout-mobile-docs/checkout-3ds-sdk-ios/index.html",
  "swift_versions": "5.0",
  "license": "Copyright (c) 2021 Checkout.com\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to use the Software solely for the purposes of integrating the operation of the Software with the operation of other software or systems used by the person to whom the Software is furnished.\n\nExcept as expressly provided in the foregoing paragraph, the person to whom the Software is furnished has no right (and shall not permit any third party) to copy, distribute, re-distribute, sub-license, adapt, reverse engineer, decompile, disassemble, modify or make error corrections to the Software in whole or in part.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
  "authors": {
    "Checkout.com Integration": "integration@checkout.com"
  },
  "platforms": {
    "ios": "13.0"
  },
  "source": {
    "git": "https://github.com/checkout/checkout-3ds-sdk-ios.git",
    "tag": "3.2.7"
  },
  "vendored_frameworks": "Checkout3DS.xcframework",
  "dependencies": {
    "CheckoutEventLoggerKit": [
      "1.2.4"
    ],
    "JOSESwift": [
      "2.2.1"
    ],
    "Checkout3DS-Security": [
      "3.2.7"
    ]
  },
  "user_target_xcconfig": {
    "BUILD_LIBRARY_FOR_DISTRIBUTION": "YES",
    "VALID_ARCHS": "arm64",
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "i386 x86_64"
  },
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "i386 x86_64",
    "VALID_ARCHS": "arm64"
  },
  "swift_version": "5.0"
}
