{
  "name": "LPMessagingSDK",
  "version": "6.26.0-beta.1",
  "summary": "LivePerson Mobile library for iOS",
  "homepage": "https://github.com/LP-Messaging/iOS-Messaging-SDK",
  "authors": {
    "LPMObile": "mobile@liveperson.com"
  },
  "platforms": {
    "ios": "13"
  },
  "source": {
    "git": "https://github.com/LivePersonInc/iOSFrameworks.git",
    "tag": "6.26.0-beta.1"
  },
  "preserve_paths": [
    "LPMessagingSDK.xcframework",
    "LPMessagingSDK-dSYMs/LPMessagingSDK.framework.ios-arm64.dSYM",
    "LPMessagingSDK-dSYMs/LPMessagingSDK.framework.ios-x86_64-simulator.dSYM"
  ],
  "ios": {
    "vendored_frameworks": "LPMessagingSDK.xcframework"
  },
  "swift_versions": "5.10",
  "license": {
    "type": "Commercial",
    "text": "LIVEPERSON DEVELOPER LICENSE FOR SDK\nBy installing, accessing, downloading, or otherwise using the LP Messaging software development kit (“SDK”) and any related software code provided by LivePerson on Github’s website, you and your company, in consideration of the mutual agreements contained herein and intending to be legally bound hereby accept the terms of this developer license agreement (“License Agreement”) and agree to be bound the License Agreement.\nLicense. LivePerson grants you and your company a limited, revocable, non-exclusive, non-transferable, non-sublicensable license to access and use the SDK solely for testing, development and non-production use only. You may not sell, sublicense, rent, loan or lease any portion of the SDK to any third party and you may not reverse engineer, decompile or disassemble any portion of the SDK. Prior to your and your company’s use of the SDK for commercial purposes, including in a production environment, you and your company must notify LivePerson and mutually agree in writing on the applicable pricing and license terms for such usage.\nTerm. This License Agreement is effective until terminated. LivePerson has the right to terminate this agreement immediately if you fail to comply with any term herein. Upon any such termination, you and your company must remove all full and partial copies of the SDK from your computer, network, and servers and discontinue use of the SDK.\nProprietary Rights. LivePerson retains all proprietary rights in and to the SDK, including know how, technologies, and trade secrets, and all derivative works, and enhancements and modifications to the foregoing. Except as stated in the above license, this License Agreement does not grant you and/or your company any rights to patents, copyrights, trade secrets, trademarks, or other rights with respect to the SDK.\nDisclaimer of Warranty. With respect to your and your company’s testing, development, and non-production use of the SDK, LivePerson provides the SDK “as is.” To the maximum extent permissible under applicable law, LivePerson expressly disclaims all representations and warranties, whether express or implied warranties, concerning or related to the SDK, including but not limited to the implied warranties of non-infringement and/or fitness for a particular purpose. LivePerson does not warrant, guarantee, or make any representations regarding the use, the results of the use or the benefits, of the SDK. Your commercial and production use of the SDK will be governed the mutually agreed upon commercial agreement in writing with LivePerson\n"
  },
  "swift_version": "5.10"
}
