{
  "name": "TMLKit",
  "version": "2.0.0",
  "summary": "Translation Markup Language for Objective C.",
  "homepage": "https://github.com/translationexchange/tml-objc",
  "license": "MIT",
  "authors": {
    "Michael Berkovich": "michael@translationexchnage.com"
  },
  "source": {
    "git": "https://github.com/translationexchange/tml-objc.git",
    "tag": "2.0.0"
  },
  "social_media_url": "https://twitter.com/translationx",
  "platforms": {
    "ios": "8.0"
  },
  "requires_arc": true,
  "resources": "Assets/**/*",
  "prefix_header_file": "TMLKit/TMLKit/TMLKit-Prefix.pch",
  "source_files": [
    "Classes/**/*.{h,m}",
    "TMLKit/TMLKit/**/*.{h,m}"
  ],
  "dependencies": {
    "MPColorTools": [
      ">= 1.6"
    ],
    "MBProgressHUD": [

    ],
    "SSZipArchive": [

    ],
    "NVHTarGzip": [

    ],
    "SAMKeychain": [

    ]
  },
  "description": "Tml for Objective C is the most advanced translation solution for iOS applications.\n\nIt reduces the number of steps required for translating an app to the absolute minimum. All you need to do is to include the Tml header file in your app, initialize the SDK and use the various translation macros to internationalize your content.\n\nThe SDK comes with its own language selector, where users can switch languages. Or you can use the language set by the OS.\n\nIt also comes with In-App Translator - where you can ask your users to help translate your app right from within your app.\n\nTml SDK integrates with TranslationExchange.com service, where you can manage the entire translation process - add new languages, invite translators, manage phrases, and much more.\n\nOnce the translations are done, they will be automatically downloaded and installed by the SDK in your app. Everything is done real-time - you DO NOT need to submit a new application to the App Store. You can simply enable a new language on TranslationExchange and it will immediately be available in your application.\n\nYou can learn more about the SDK by visiting the project's GitHub page:\n    \n    https://github.com/translationexchange/tml-objc\n\nor running sample applications:\n\nDemo app that comes with the SDK:\n\n    https://github.com/translationexchange/tml-objc/tree/master/Project\n\n“Wammer” application that shows how the SDK can be integrated into a messaging app:\n\n    https://github.com/translationexchange/tml-objc-samples-wammer"
}
