{
  "name": "BrainBlocksKit",
  "version": "2.0",
  "summary": "A Payment Framework for Nano.",
  "description": "The BrainBlocksKit is a complete payment framework that can be used in any iOS app to accept Nano.",
  "homepage": "https://github.com/brainblocks/brainblocks-ios-sdk",
  "license": {
    "type": "BrainBlocks License, Version 1.0",
    "text": "      Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\n      The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software, along with credit to the BrainBlocks company and platform.\n      The software may be used free of charge in commercial applications, providing it is used in conjunction with the BrainBlocks payments platform and BrainBlocks back-end servers.\n      The software shall not be copied, forked, or modified in any way to be used with payments platforms other than BrainBlocks.\n      The software may be copied, forked, or modified to make improvements, bug fixes, patches, security fixes, etc. providing the software continues to use BrainBlocks as its sole payments platform, and no other, and changes of general utility are offered in good faith back into the main repository in reasonable time in the form of a pull request, which may be accepted or rejected by the BrainBlocks team.\n      Any changes or pull requests made into the main repository shall be the sole property of BrainBlocks, including any and all copyrights and intellectual property rights, with credit to the original author.\n      THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
  },
  "authors": "BrainBlocks",
  "platforms": {
    "ios": "12.0"
  },
  "source": {
    "git": "https://github.com/brainblocks/brainblocks-ios-sdk.git",
    "tag": "v2.0"
  },
  "source_files": [
    "BrainBlocksKit",
    "BrainBlocksKit/**/*.{h,m,swift}"
  ],
  "resource_bundles": {
    "BrainBlocksKit": [
      "BrainBlocksKit/*.{storyboard,xib,png,svg}"
    ]
  },
  "dependencies": {
    "Alamofire": [
      "~> 5.0.0-rc.3"
    ],
    "SwiftyJSON": [
      "~> 4.0"
    ]
  },
  "pod_target_xcconfig": {
    "SWIFT_VERSION": "5"
  },
  "swift_versions": "5",
  "swift_version": "5"
}
