{
  "name": "CordovaPlugin-camera",
  "version": "3.0.0",
  "summary": "Cordova Camera Plugin",
  "description": "                   This plugin provides an API for taking pictures and for choosing images from the system's image library.\n                   \n                   The camera.getPicture function opens the device's default camera application that allows users to snap pictures. This behavior occurs by default, when Camera.sourceType equals Camera.PictureSourceType.CAMERA. Once the user snaps the photo, the camera application closes and the application is restored.\n                   \n                   If Camera.sourceType is Camera.PictureSourceType.PHOTOLIBRARY or Camera.PictureSourceType.SAVEDPHOTOALBUM, then a dialog displays that allows users to select an existing image. The camera.getPicture function returns a CameraPopoverHandle object, which can be used to reposition the image selection dialog, for example, when the device orientation changes.\n                   \n                   The return value is sent to the cameraSuccess callback function, in one of the following formats, depending on the specified cameraOptions:\n                   \n                   A String containing the base64-encoded photo image.\n                   \n                   A String representing the image file location on local storage (default).\n                   \n                   You can do whatever you want with the encoded image or URI, for example:\n                       \n                       Render the image in an <img> tag, as in the example below\n                       \n                       Save the data locally (LocalStorage, Lawnchair, etc.)\n                       \n                       Post the data to a remote server\n                       \n                       NOTE: Photo resolution on newer devices is quite good. Photos selected from the device's gallery are not downscaled to a lower quality, even if a quality parameter is specified. To avoid common memory problems, set Camera.destinationType to FILE_URI rather than DATA_URL.\n",
  "homepage": "https://github.com/apache/cordova-plugin-camera",
  "license": {
    "type": "Apache License, Version 2.0",
    "text": "      Licensed under the Apache License, Version 2.0 (the \"License\");\n      you may not use this file except in compliance with the License.\n      You may obtain a copy of the License at\n      \n      http://www.apache.org/licenses/LICENSE-2.0\n      \n      Unless required by applicable law or agreed to in writing, software\n      distributed under the License is distributed on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n      See the License for the specific language governing permissions and\n      limitations under the License.\n"
  },
  "authors": {
    "The Apache Software Foundation": ""
  },
  "platforms": {
    "ios": "6.0"
  },
  "source": {
    "git": "https://github.com/apache/cordova-plugin-camera.git",
    "tag": "3.0.0"
  },
  "source_files": "src/ios/*.{h,m}",
  "preserve_paths": [
    "*.md",
    "docs/**/*.md",
    "www/*.js",
    "www/ios/*.js"
  ],
  "frameworks": [
    "CoreLocation",
    "CoreGraphics",
    "AssetsLibrary",
    "MobileCoreServices"
  ],
  "weak_frameworks": "ImageIO",
  "requires_arc": true,
  "dependencies": {
    "Cordova": [
      ">= 3.0.0"
    ]
  }
}
