{
  "name": "ZoomVideoSDK",
  "version": "2.3.10",
  "summary": "Zoom Video SDK for iOS",
  "platforms": {
    "ios": "12.0"
  },
  "description": "The Video SDKs are app development kits provided to enrich apps with video collaboration features to connect customers and communities. Use these SDKs to build apps with highly customized user interfaces along with access to raw video and audio data.\n\nVideo SDKs are designed to be:\n\n* Easy to use: Import libraries, call required functions, and all video conferencing will be handled for you.\n* Lightweight: Video SDKs are streamlined toolkits with an enormous reduction in size compared to Meeting SDKs with all the power of Zoom's video and audio solutions.\n* Highly customizable: Raw video and audio data is available to you, allowing your chosen renderer to customize the video experience.\n\nVideo sessions created by the Video SDKs are launched instantly, bringing a delightful video communication experience to your users with high-quality video and audio.\n\nDirect access to raw video and audio data allows improved interaction between users and the app video stream. Imagine a gaming video streaming app with direct interaction between the player and viewers based on in-game events or prompts from the community. Or, imagine an AR streaming platform with direct viewer access to the on-screen video.\n\nAs with our Meeting SDKs, Video SDKs allow screen-sharing from devices, in-session chat messages, and high-quality video and audio streams similar to Zoom's core capabilities.\n\nThe Video SDKs enable the following functionality in your app:\n\n* Launch a video communication session instantly\n* Share screen directly from your device\n* Send instant chat messages during the session\n* Capture and review raw data locally\n* Test different rendering schema and enjoy high-quality video and audio streams\n* Broadcast the video session to third-party live streaming providers\n\nTo know more, see: https://developers.zoom.us/docs/video-sdk/",
  "homepage": "https://developers.zoom.us/docs/video-sdk/",
  "documentation_url": "https://developers.zoom.us/docs/video-sdk/",
  "license": {
    "type": "Zoom Video SDK Terms of Service",
    "text": "  \n  Use of this SDK is subject to our [License and Terms of Use](https://explore.zoom.us/docs/en-us/video-sdk-terms.html);\n\n"
  },
  "authors": "Zoom Video Communications, Inc.",
  "static_framework": true,
  "requires_arc": true,
  "source": {
    "http": "https://github.com/zoom/zoom-video-sdk-iOS/releases/download/v2.3.10/zoom-video-sdk-iOS.zip",
    "type": "zip"
  },
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "subspecs": [
    {
      "name": "ZoomVideoSDK",
      "vendored_frameworks": "zoom-video-sdk-iOS/ZoomVideoSDK.xcframework"
    },
    {
      "name": "ZoomVideoSDKScreenShare",
      "vendored_frameworks": "zoom-video-sdk-iOS/ZoomVideoSDKScreenShare.xcframework"
    },
    {
      "name": "zoomcml",
      "vendored_frameworks": "zoom-video-sdk-iOS/zoomcml.xcframework"
    },
    {
      "name": "CptShare",
      "vendored_frameworks": "zoom-video-sdk-iOS/CptShare.xcframework"
    },
    {
      "name": "zm_annoter_dynamic",
      "vendored_frameworks": "zoom-video-sdk-iOS/zm_annoter_dynamic.xcframework"
    }
  ]
}
