{
  "name": "CoreLib",
  "version": "1.4.1",
  "summary": "CoreLib is a collection of reusable sources to make various aspects of developing Mac and iOS applications easier, faster & safer.",
  "description": "CoreLib is a collection of reusable Objective-C source code to make various aspects of developing Mac and iOS applications easier, faster & safer.\n\nCoreLib has these features:\n\n* categories on base Cocoa like NSArray, NSData, NSObject, NSString, etc for new functionality or syntactic sugar (AppKit+CoreCode, Foundation+CoreCode)\n\n* for iOS) subclasses for UIActionSheet, UIAlertView, etc to provide a more convenient block based interface or new view controllers (iOS/JM*)\n\n* for Mac) convenience classes for e-mail sending, getting host information, managing login items, showing styled font lists, etc (Mac/JM*)\n\n* categories on all Foundation&AppKit classes to provide properties instead of getters/setters. this is provided in the 10.10 SDK too, but we have it for pre Xcode 6 (AppKit+Properties, Foundation+Properties)\n\n* support for object subscripting with old SDKs where Apple doesn't support it (Foundation+Indexing)\n\n* support for generating warnings on invocation of methods/classes that are not available on your deployment target (CoreLib_Availability)\n\n* support for pseudo static typing in collection classes (for invoking properties on objects from collections without casting) and much more convenience stuff (CoreLib)\n",
  "homepage": "https://github.com/core-code/CoreLib",
  "license": {
    "type": "MIT",
    "file": "LICENSE.txt"
  },
  "authors": {
    "CoreCode": "feedback@corecode.at"
  },
  "platforms": {
    "ios": "5.0",
    "osx": "10.6"
  },
  "source": {
    "git": "https://github.com/core-code/CoreLib.git",
    "tag": "1.4.1"
  },
  "ios": {
    "source_files": [
      "CoreLib",
      "iOS"
    ]
  },
  "osx": {
    "source_files": [
      "CoreLib",
      "Mac"
    ]
  },
  "requires_arc": true,
  "prefix_header_contents": "#import \"CoreLib.h\""
}
