{
  "name": "MotionJpegImageView",
  "version": "0.0.1",
  "summary": "MotionJpegImageView lets you display MJPEG streams on iOS. Typically 7 to 8 times faster than using UIView.",
  "description": "                      MotionJpegImageView creates a connection to the stream\n                      and receives JPEG frames one at a time over the network.\n                      It turns out this approach is typically seven or eight\n                      times faster than using UIWebView to render MJPEG\n                      streams.\n\n                      Just provide a URL for the video stream and you're good.\n                      Internally, MotionJpegImageView achieves better\n                      performance by avoiding overheads of parsing and\n                      rendering each frame as if it were a web page which\n                      UIView does.\n\n                      Internally, MotionJpegImageView creates a connection to\n                      the stream and receives frames one at a time over the\n                      network. As it receives each frame, it hydrates the\n                      stream data into a UIImage object, and then sets its\n                      inherited image property. Thus the only bottlenecks\n                      to getting high framerates are:\n\n                      1. The speed of your network connection\n                      2. The frame rate of the IP camera\n                      3. The phone’s ability to process inbound packets and\n                      rehydrate UIImage files from raw JPEG data.\n",
  "homepage": "http://thinkflood.com/support/redeye/software/open-source-software/motion-jpeg-image-view-ios/",
  "license": {
    "type": "MIT",
    "text": "              Created by Matthew Eagar on 10/3/11.\n              Copyright 2011 ThinkFlood Inc. All rights reserved.\n\n              Permission is hereby granted, free of charge, to any person obtaining a copy\n              of this software and associated documentation files (the \"Software\"), to deal\n              in the Software without restriction, including without limitation the rights\n              to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n              copies of the Software, and to permit persons to whom the Software is furnished\n              to do so, subject to the following conditions:\n\n              The above copyright notice and this permission notice shall be included in all\n              copies or substantial portions of the Software.\n\n              THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n              IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n              FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n              AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n              LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n              OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n              SOFTWARE.\n"
  },
  "authors": {
    "Matthew Eagar": "matthew_eagar@intuit.com"
  },
  "source": {
    "git": "https://github.com/mateagar/Motion-JPEG-Image-View-for-iOS.git",
    "commit": "36ab2cd0d524aa62656113e624b07b697a1c7864"
  },
  "source_files": "MotionJpegImageView/MotionJpegImageView.{h,mm}",
  "frameworks": "UIKit",
  "requires_arc": false,
  "platforms": {
    "ios": null
  }
}
