{
  "name": "ARCHelper",
  "version": "0.0.1",
  "summary": "Set of macros for writing library code that can be used with both ARC and non-ARC environments.",
  "description": "                    ARC Helper consists of a set of macros that are designed to be used in place of the standard Objective-C memory management functions and macros.\n                    These macros will generate code appropriate to the build target.\n\n                    ARC Helper is modular:\n                      - For projects that are designed to work only with ARC enabled, you can use just the second and/or 3rd modules on their own (the part from \"Weak reference support\" down) and omit the first block.\n                      - For projects that are iOS only, you don't need the 3rd module (the part from \"Weak delegate support\" down), which deals with weak references to classes such as NSWindowController on Mac OS that do not support weak references under Mac OS 10.7.\n",
  "homepage": "https://gist.github.com/1563325",
  "license": {
    "type": "zlib 0.7",
    "text": "        ARC Helper\n\n        Version 2.1, June 24th, 2012\n\n        Copyright (C) 2012 Charcoal Design\n\n        This software is provided 'as-is', without any express or implied\n        warranty. In no event will the authors be held liable for any damages\n        arising from the use of this software.\n\n        Permission is granted to anyone to use this software for any purpose,\n        including commercial applications, and to alter it and redistribute it\n        freely, subject to the following restrictions:\n\n        The origin of this software must not be misrepresented; you must not\n        claim that you wrote the original software. If you use this software\n        in a product, an acknowledgment in the product documentation would be\n        appreciated but is not required.\n\n        Altered source versions must be plainly marked as such, and must not be\n        misrepresented as being the original software.\n\n        This notice may not be removed or altered from any source distribution.\n"
  },
  "authors": {
    "Nick Lockwood": "http://charcoaldesign.co.uk"
  },
  "source": {
    "git": "https://gist.github.com/1563325.git",
    "commit": "a344e8dcda7739a9ad6b5ca768b68cbfd8e0d721"
  },
  "source_files": "ARCHelper.h",
  "requires_arc": false
}
