{
  "name": "YAML-Framework",
  "version": "0.0.1",
  "summary": "Proper YAML support for Objective-C. Based on recommended LibYAML.",
  "description": "YAML.framework provides support for YAML (de)serialisation similarly to standard NSPropertyListSerialization. Based on C LibYAML library by Kirill Simonov.",
  "homepage": "https://github.com/mirek/YAML.framework",
  "license": {
    "type": "MIT",
    "text": "        Copyright (c) 2010 Mirek Rusin (YAML.framework)\n                      2006 Kirill Simonov (LibYAML)\n\n        Permission is hereby granted, free of charge, to any person obtaining a copy of\n        this software and associated documentation files (the \"Software\"), to deal in\n        the Software without restriction, including without limitation the rights to\n        use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies\n        of the Software, and to permit persons to whom the Software is furnished to do\n        so, subject to the following conditions:\n\n        The above copyright notice and this permission notice shall be included in all\n        copies or substantial portions of the Software.\n\n        THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n        IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n        FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n        AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n        LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n        SOFTWARE.\n"
  },
  "authors": {
    "Mirek Rusin": "mirek@me.com",
    "Kirill Simonov": "kiril"
  },
  "source": {
    "git": "https://github.com/mirek/YAML.framework.git",
    "commit": "11c3fb2776eea7da29029f7aa77bcb616a630557"
  },
  "source_files": [
    "YAMLSerialization.{h,m}",
    "yaml-0.1.4/config.h"
  ],
  "public_header_files": "YAMLSerialization.h",
  "requires_arc": false,
  "dependencies": {
    "LibYAML": [
      "~> 0.1.4"
    ]
  }
}
