{
  "name": "MapLibre",
  "version": "5.12.0",
  "license": {
    "type": "2-clause BSD",
    "text": "  BSD 2-Clause License\n\n  Copyright (c) 2021 MapLibre contributors\n  \n  Copyright (c) 2018-2021 MapTiler.com\n  \n  Copyright (c) 2014-2020 Mapbox\n  \n  Redistribution and use in source and binary forms, with or without\n  modification, are permitted provided that the following conditions are\n  met:\n  \n  * Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n  * Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in\n    the documentation and/or other materials provided with the\n    distribution.\n  \n  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\n  IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\n  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR\n  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\n  PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n  PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n  SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.  \n"
  },
  "homepage": "https://github.com/maplibre/",
  "authors": {
    "MapLibre": ""
  },
  "summary": "Open source vector map solution for iOS with full styling capabilities.",
  "platforms": {
    "ios": "9.0"
  },
  "source": {
    "http": "https://github.com/maplibre/maplibre-native/releases/download/ios-v5.12.0/Mapbox-5.12.0.zip",
    "flatten": false
  },
  "ios": {
    "vendored_frameworks": "**/Mapbox.xcframework"
  },
  "dependencies": {
    "MapboxMobileEvents": [
      "0.10.11"
    ]
  }
}
