{
  "name": "VoxeetUXKit",
  "version": "1.7.0-beta.3",
  "summary": "The Voxeet UXKit is a quick way of adding premium audio, video chats, and other supported options.",
  "authors": "Voxeet",
  "homepage": "https://dolby.io",
  "platforms": {
    "ios": "11.0"
  },
  "source": {
    "git": "https://github.com/voxeet/voxeet-uxkit-ios.git",
    "tag": "1.7.0-beta.3"
  },
  "swift_versions": "5.5.2",
  "frameworks": "UIKit",
  "source_files": "VoxeetUXKit/**/*.{h,m,swift}",
  "resources": "VoxeetUXKit/**/*.{mp3,storyboard,xcassets,lproj}",
  "dependencies": {
    "VoxeetSDK": [
      "~> 3.0"
    ],
    "Kingfisher": [

    ]
  },
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64",
    "ENABLE_BITCODE": "NO"
  },
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "license": {
    "type": "Dolby Software License Agreement",
    "text": "    **BEFORE DOWNLOADING THE SOFTWARE, PLEASE CAREFULLY READ THE FOLLOWING AGREEMENT. DO NOT DOWNLOAD, INSTALL, ACTIVATE OR USE THIS SOFTWARE IF YOU HAVE NOT\n    ENTERED INTO A COMMERCIAL AGREEMENT WITH DOLBY. BY DOWNLOADING, INSTALLING, ACTIVATING OR USING THE SOFTWARE, YOU ARE AGREEING TO BE BOUND BY THE TERMS\n    OF THIS AGREEMENT. IF PRIOR TO DOWNLOADING, INSTALLING, ACTIVATING OR USING THE SOFTWARE, YOU DECIDE YOU ARE UNWILLING TO AGREE TO THE TERMS OF THIS\n    AGREEMENT, YOU HAVE NO RIGHT TO USE THE SDK.**\n    \n    This Dolby Software License Agreement (“Agreement”) is a legal agreement between you individually if you are agreeing to it in your own capacity, or if \n    you are authorized to acquire the Software on behalf of your company or organization, between the entity for whose benefit you act (“Licensee”) and\n    **Dolby Laboratories Licensing Corporation** , a New York corporation, **Dolby International AB** , a Swedish company residing in The Netherlands\n    (collectively, “**Licensor**”). This Agreement is governed by the terms in the commercial agreement separately entered into by Licensee and Licensor (the\n    “Commercial Agreement”), the terms of which are incorporated herein by reference. Defined terms in this Agreement and not otherwise defined herein, have\n    the meanings given to them in the Commercial Agreement.\n    \n    1. License: Subject to the terms and conditions of this Agreement, Licensor hereby grants Licensee a revocable, royalty-free, nonexclusive,\n        nontransferable, nonassignable license (subject to Licensee’s continued compliance with this Agreement) to install and use a reasonable number of\n        copies of the Software to be used solely in the manner described in the documentation contained in the Software and as further authorized in the\n        Commercial Agreement. Licensee may not copy the Software or any portion thereof except as expressly permitted herein. For the purposes of this\n        provision \"copy\" shall not include copying of statements and instructions of the Software or any portion thereof that naturally occurs during normal\n        program execution when used in accordance with and for the purposes described in the documentation or in the course of making unmodified copies of\n        the Software or documentation as part of the regular back-up of the Software in accordance with standard industry business practices.\n    2. EULA: If applicable, Licensee shall incorporate the End User License Agreement referenced in the Commercial Agreement.\n    3. License Restriction: Licensee shall have no right to copy, modify or create derivative works of the Software, except as expressly permitted herein, or\n        to reverse assemble, reverse engineer, decompile or otherwise attempt to derive source code from the Software.\n    4. Rights in Software: This Agreement is not a sale and does not transfer to Licensee any title or ownership interest in or to the Software or any\n        patent, copyright, trade secret, trade name, trademark or other proprietary or intellectual property rights related to the Software. Except for the\n        rights expressly granted herein, Licensor retains all of its right, title and interest in and to the Software. Licensee shall not remove, alter, or\n        obscure any proprietary notices contained on or within the Software and shall reproduce such notices on any back-up copy of the Software.\n    5. Open Source Software: “Open Source Software” means any software or other material included in the Software which is (1) subject to a license (a)\n        listed at [http://opensource.org/licenses/](http://opensource.org/licenses/) as of the effective date, (b) that meet the criteria listed at\n        [http://opensource.org/docs/definition.php](http://opensource.org/docs/definition.php) as of the effective date, or (c) that is licensed under a free\n        software, open source software, or similar licensing model; and (2) which if distributed by Licensee would (a) impose any obligations on Licensee to\n        provide reports or royalties, or to disclose any information to a third party, or (b) impose any requirements that any patents related to the\n        Software must be licensed to, or may be asserted against, recipients of the Software. A list of such Open Source Software, as amended from time to\n        time, is provided in the documentation contained in the Software. Open Source Software also includes libraries from the FFmpeg project under the\n        LGPLv2.1. The Open Source Software is not subject to the terms and conditions of this Agreement. Instead, each item of Open Source Software is\n        licensed under the terms of the end user license that accompanies such Open Source Software. Nothing in this Agreement limits Licensee’s rights\n        under, or grants Licensee rights that supersede, the terms and conditions of any applicable end user license for the Open Source Software.\n    6. Feedback: Licensee hereby grants to Licensor a non-exclusive, royalty-free, worldwide, perpetual, irrevocable, non-terminable, transferable,\n        assignable and sublicensable license to reproduce, distribute, publicly perform and display, make, have made, sell, import, modify and make\n        derivative works based on, and otherwise use and exploit any and all suggestions, comments, ideas, and all other types of information relating to the\n        Software which is communicated directly or indirectly by Licensee to Licensor.\n    8. No Warranty by Licensor: LICENSOR IS PROVIDING THE SOFTWARE AND OPEN SOURCE SOFTWARE TO LICENSEE “AS IS” AND WITHOUT WARRANTY OF ANY KIND WHATSOEVER,\n        EXPRESS OR IMPLIED. ALL IMPLIED WARRANTIES OF NONINFRINGEMENT, MERCHANTABILITY AND/OR FITNESS FOR A PARTICULAR PURPOSE ARE HEREBY DISCLAIMED BY\n        LICENSOR AND EXCLUDED. LICENSOR DOES NOT WARRANT THAT SOFTWARE AND OPEN SOURCE SOFTWARE OR THE FUNCTIONS CONTAINED THEREIN WILL MEET LICENSEE’S\n        REQUIREMENTS, THAT THE OPERATION OF THE SOFTWARE AND OPEN SOURCE SOFTWARE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE SOFTWARE AND\n        OPEN SOURCE SOFTWARE WILL BE CORRECTED. LICENSEE IS SOLELY RESPONSIBLE FOR THE USE AND DISTRIBUTION OF OPEN SOURCE SOFTWARE AND ASSUMES ALL RISKS\n        ASSOCIATED WITH ITS USE, INCLUDING WITH RESPECT TO THE FFMPEG OPEN SOURCE SOFTWARE LICENSE.\n    9. Indemnification: Licensee shall indemnify, defend and hold harmless Licensor, its affiliates, their respective successors and their respective\n        officers, directors, employees, agents, and representatives for any claim, liability, loss or damage arising out of: (a) Licensee’s breach of any\n        term of this Agreement; and (b) any claim of allegedly unauthorized use or violation of any third-party patent, copyright, trade secret, or other\n        intellectual property.\n    10. Term: This Agreement shall be effective upon Licensee’s agreement to be bound by the terms of this Agreement and shall end upon termination of this\n        Agreement in accordance with the provisions set out herein. Unless otherwise authorized by Licensor, Licensee must destroy all copies and component\n        parts of the Software licensed under this Agreement within one (2) weeks of the termination of this Agreement, and Licensee may be required to\n        provide proof of such destruction to Licensor. Upon the termination of this Agreement the license shall immediately terminate and Licensee shall\n        promptly stop all use of the Software.\n    11. Termination: Licensor reserves the right to terminate this Agreement on thirty (30) days' notice to Licensee for any reason whatsoever.\n    12. This Agreement shall not create or be construed as creating a joint venture, co-ownership, partnership, or agency relationship between Licensee and\n        Licensor. Neither Party will have authority to or will hold itself out as having any authority to incur, assume, or create, orally or in writing, any\n        liability, obligation or undertaking of any kind in the name of, or on behalf of, or in any way binding upon, the other.\n"
  },
  "swift_version": "5.5.2"
}
