{
  "name": "DBAccess",
  "version": "1.6.7",
  "summary": "[DBAccess] is a fully featured and FREE to use ORM for iOS.",
  "description": "                       [DBAccess] is a fully featured and FREE to use ORM for iOS.\n\nReplace CoreData whilst keeping your existing managed objects, but dump the predicates and long-winded syntax.\n\nInstead use a simple and clean object syntax, with fast and concise inline queries.\n\nDBAccess even has a conversion method to migrate your existing CoreData tables across.\n\nRegularly updated and in constant use within many public applications it thrives on feedback from other developers and is supported by the authors via StackOverflow or directly via email.\n\nIt’s mantra is simple, to be fast, simple to implement and the first choice for any developer.\n\nFEATURES\n\nTables are automatically modelled from your classes for the simplest of upgrade paths, you add a property, it adds the column.  Completely thread-safe in every scenario. Simple, powerful and flexible event model allows you to bind UI updates with anything that is happening to the database and best of all, is the use of standard SQLite syntax for the query conditions. Plus far too much to fit on this page.\n\nWHY SHOULD I USE [DBAccess] ?\n\nAn ORM should not be a chore to work with, or require you to change your way of working to compensate for its shortcomings.   With [DBAccess] you simply add it to your project and start using it straight away.\n\nThe developer has full control over how the ORM operates, deciding where it puts its files, how queries are performed and on which thread.  Objects can be managed or unmanaged, whilst being members of domains which may share changes or be isolated from them.\n\nIf memory is a concern, you can mix and match lightweight objects to preserve system resources when you are expecting large result sets, or retrieve only the properties you need with the remainder being lazily loaded when accessed.\n\nHEADLINE FEATURES\n\nAutomatic modelling and upgrading from your class structures.\nAmazingly simple FLUENT interface for dealing with the ORM\nKILLER event model, for individual objects or tables.  Makes coding apps a breeze\nInline or Async queries\nTransaction support\nManaged and unmanaged objects supported to be used however you want\nRelationships mirror your class structures automatically, and all relationships are automatically indexed\nProperty level encryption so databases remain human readable whilst securing individual columns.\n",
  "homepage": "http://db-access.org",
  "license": "MIT",
  "authors": {
    "${USER_NAME}": "${USER_EMAIL}"
  },
  "source": {
    "git": "https://github.com/editfmah/DBAccess.git",
    "tag": "1.6.7"
  },
  "platforms": {
    "ios": "6.0"
  },
  "requires_arc": true,
  "preserve_paths": "DBAccess.framework",
  "public_header_files": "DBAccess.framework/**/*.h",
  "vendored_frameworks": "DBAccess.framework",
  "frameworks": [
    "Foundation",
    "DBAccess"
  ],
  "xcconfig": {
    "FRAMEWORK_SEARCH_PATHS": "$(SRCROOT)/DBAccess/"
  }
}
