{
  "name": "VCLReachability",
  "version": "1.0.1",
  "summary": "VCLReachability is a network reachability library for iOS. It is designed to help you interface with network activity.",
  "description": "                       ## VCLReachability\n\n                        Purpose\n                        --------------\n\n                        VCLReachability is a reachability library for iOS. It is designed to help you interface with network activity events by allowing all object to pub and subscribe with reachability events. Based on Apples Reachability project.\n\n\n                        Supported iOS SDK Versions\n                        -----------------------------\n\n                        * Supported build target - iOS 7.0\n\n\n                        ARC Compatibility\n                        ------------------\n\n                        VCLReachability works both with ARC.\n\n\n                        Usage\n                        -----------------\n\n                        For application demo see ViewController and AppDelegate.\n\n                        Build and run the sample using Xcode. When running the iPhone Simulator, you can exercise the application by disconnecting the Ethernet cable, turning off AirPort, or by joining an ad-hoc local Wi-Fi network.\n\n                        See the example project and test for examples on how to use.\n\n                        IMPORTANT: VCLReachability must use DNS to resolve the host name before it can determine the VCLReachability of that host, and this may take time on certain network connections.  Because of this, the API will return NotReachable until name resolution has completed.  This delay may be visible in the interface on some networks.\n\n                        The VCLReachability sample demonstrates the asynchronous use of the SCNetworkReachability API. You can use the API synchronously, but do not issue a synchronous check by hostName on the main thread. If the device cannot reach a DNS server or is on a slow network, a synchronous call to the SCNetworkReachabilityGetFlags function can block for up to 30 seconds trying to resolve the hostName. If this happens on the main thread, the application watchdog will kill the application after 20 seconds of inactivity.\n\n                        SCNetworkReachability API's do not currently provide a means to detect support for GameKit peer-to-peer networking over Bluetooth.\n\n\n                        Methods\n                        ----------------\n\n                        See VCLReachabilitySubscriber protocol.\n\n                        For quick use import `NSObject+VCLReachabilitySubscriber.h`\n\n\n                        Release Notes\n                        ------------------\n\n                        Version 1.0.0\n\n                        - Initial release\n",
  "homepage": "https://github.com/VerticodeLabs/VCLReachability",
  "license": "MIT",
  "authors": {
    "adrianmaurer": "adrian@verticodelabs.com"
  },
  "source": {
    "git": "https://github.com/VerticodeLabs/VCLReachability.git",
    "tag": "1.0.1"
  },
  "social_media_url": "https://twitter.com/verticodelabs",
  "platforms": {
    "ios": "7.0"
  },
  "requires_arc": true,
  "source_files": "Classes/**/*.{h,m}",
  "ios": {
    "exclude_files": "Classes/osx"
  },
  "osx": {
    "exclude_files": "Classes/ios"
  }
}
