{
  "name": "ADNKit",
  "version": "1.1.1",
  "summary": "Objective-C framework for building App.net applications on iOS and OS X.",
  "description": "                    ADNKit is an Objective-C framework for building App.net iOS and OS X applications. The guiding design principles are:\n                    - Simple and powerful API\n                    - As much heavylifting as possible is done for you (aka, tons of convenience methods)\n                    10- 0% App.net API and features support\n                    - No external dependencies other than AFNetworking.\n",
  "homepage": "https://github.com/joeldev/ADNKit",
  "license": {
    "type": "BSD",
    "text": "          Copyright (c) 2013, Joel Levin. All rights reserved.\n\n          Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n          Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n          Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n          Neither the name of ADNKit nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n          THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
  },
  "authors": {
    "Joel Levin": "joellevin.email@gmail.com"
  },
  "source": {
    "git": "https://github.com/joeldev/ADNKit.git",
    "tag": "1.1.1"
  },
  "platforms": {
    "ios": "5.0",
    "osx": "10.7"
  },
  "ios": {
    "frameworks": [
      "CoreLocation",
      "SystemConfiguration",
      "MobileCoreServices",
      "UIKit"
    ],
    "source_files": "ADNKit/*.{h,m}"
  },
  "osx": {
    "frameworks": [
      "CoreLocation",
      "SystemConfiguration"
    ],
    "source_files": "ADNKit/*.{h,m}",
    "exclude_files": "**/*{ANKOAuthViewController,ANKTextFieldCell,ANKUsernamePasswordAuthViewController}*"
  },
  "prefix_header_contents": "#ifdef __OBJC__\n\t#import <Foundation/Foundation.h>\n\n\t#if __IPHONE_OS_VERSION_MIN_REQUIRED\n\t\t#import <MobileCoreServices/MobileCoreServices.h>\n\t#endif\n\n\t#import <SystemConfiguration/SystemConfiguration.h>\n\t#import \"AFNetworking.h\"\n\t#import \"ANKResource.h\"\n\t#import \"ANKAnnotationReplacement.h\"\n\t#import \"ANKClient.h\"\n\t#import \"ANKClient+ANKHandlerBlocks.h\"\n\t#import \"NSArray+ANKAdditions.h\"\n\t#import \"NSDictionary+ANKAdditions.h\"\n#endif\n\n",
  "public_header_files": [
    "ADNKit/*.h",
    "*.h"
  ],
  "requires_arc": true,
  "dependencies": {
    "AFNetworking": [
      "~> 1.2.0"
    ]
  }
}
