{
  "name": "CrashlyticsFramework",
  "version": "2.2.0",
  "summary": "The most powerful, yet lightest weight crash reporting solution for iOS and Android developers. | Crashlytics",
  "homepage": "http://crashlytics.com",
  "license": {
    "type": "Copyright",
    "file": "http://try.crashlytics.com/terms/terms-of-use.pdf",
    "text": "      CRASHLYTICS, INC. TERMS OF SERVICE Last Updated: January 28, 2013 \n \n      The following Crashlytics, Inc. Terms of Service (“Terms” or \n      “Agreement”) constitutes a legal agreement between you and the entity on whose \n      behalf you are accessing the Service (as defined below) (“Developer”) and Crashlytics, \n      Inc., a wholly owned subsidiary of Twitter, Inc. (“Crashlytics”). Developer’s use of the \n      Service is subject to the terms and conditions set forth below, so Developer should take \n      the time to fully understand how these Terms govern Developer’s relationship with \n      Crashlytics and Developer’s use of the Service. If you have questions regarding the \n      Terms, please contact Crashlytics at support@crashlytics.com. \n      DEVELOPER’S RIGHT TO USE THE SERVICE IS EXPRESSLY CONDITIONED ON \n      ACCEPTANCE OF THESE TERMS. BY USING THE SERVICE, YOU ARE AGREEING \n      TO BE BOUND BY THE TERMS ON BEHALF OF DEVELOPER. IF YOU ARE \n      ACCESSING THE SERVICE ON BEHALF OF YOUR EMPLOYER OR ANOTHER \n      ENTITY, YOU REPRESENT AND WARRANT THAT YOU HAVE THE AUTHORITY TO \n      AGREE TO THESE TERMS ON ITS BEHALF. IF DEVELOPER DOES NOT AGREE \n      WITH ANY PROVISION OF THE TERMS, OR YOU DO NOT HAVE AUTHORITY TO \n      BIND DEVELOPER, YOU MAY NOT ACCESS OR USE THE SERVICE IN ANY \n      MANNER FOR ANY PURPOSE.\n\n"
  },
  "authors": "Crashlytics",
  "source": {
    "git": "https://github.com/bpoplauschi/CrashlyticsFramework.git",
    "tag": "2.2.0"
  },
  "platforms": {
    "ios": "5.0"
  },
  "source_files": "Crashlytics.framework/Versions/A/Headers/*.h",
  "requires_arc": true,
  "ios": {
    "vendored_frameworks": "Crashlytics.framework"
  },
  "xcconfig": {
    "FRAMEWORK_SEARCH_PATHS": "$(inherited)"
  },
  "preserve_paths": "Crashlytics.framework",
  "deprecated_in_favor_of": "Crashlytics"
}
