{
  "name": "VKID",
  "version": "2.7.1",
  "summary": "iOS library for VK ID authorization",
  "homepage": "https://id.vk.ru/business",
  "authors": {
    "VK ID": "devsupport@corp.vk.ru"
  },
  "license": {
    "type": "Copyright (c) 2023 - present, LLC “V Kontakte”",
    "text": "1. Permission is hereby granted to any person obtaining a copy of this Software to\nuse the Software without charge.\n\n2. Restrictions\nYou may not modify, merge, publish, distribute, sublicense, and/or sell copies,\ncreate derivative works based upon the Software or any part thereof.\n\n3. Termination\nThis License is effective until terminated. LLC “V Kontakte” may terminate this\nLicense at any time without any negative consequences to our rights.\nYou may terminate this License at any time by deleting the Software and all copies\nthereof. Upon termination of this license for any reason, you shall continue to be\nbound by the provisions of Section 2 above.\nTermination will be without prejudice to any rights LLC “V Kontakte” may have as\na result of this agreement.\n\n4. Disclaimer of warranty and liability\nTHE SOFTWARE IS MADE AVAILABLE ON THE “AS IS” BASIS. LLC “V KONTAKTE” DISCLAIMS\nALL WARRANTIES THAT THE SOFTWARE MAY BE SUITABLE OR UNSUITABLE FOR ANY SPECIFIC\nPURPOSES OF USE. LLC “V KONTAKTE” CAN NOT GUARANTEE AND DOES NOT PROMISE ANY\nSPECIFIC RESULTS OF USE OF THE SOFTWARE.\nUNDER NO CIRCUMSTANCES LLC “V KONTAKTE” BEAR LIABILITY TO THE LICENSEE OR ANY\nTHIRD PARTIES FOR ANY DAMAGE IN CONNECTION WITH USE OF THE SOFTWARE.\n"
  },
  "platforms": {
    "ios": "12.0"
  },
  "swift_versions": "5.9",
  "source": {
    "git": "https://github.com/VKCOM/vkid-ios-sdk.git",
    "tag": "2.7.1"
  },
  "cocoapods_version": ">= 1.11.2",
  "source_files": "VKID/Sources/**/*.swift",
  "static_framework": true,
  "dependencies": {
    "VKIDCore": [
      "2.7.1"
    ],
    "VKCaptchaSDK": [
      "0.1.1"
    ]
  },
  "resource_bundles": {
    "VKID-Resources": [
      "VKID/Sources/Resources/*.{xcassets,lproj,txt,xcprivacy,xcstrings}"
    ]
  },
  "pod_target_xcconfig": {
    "SWIFT_PACKAGE_NAME": "VKID",
    "SWIFT_ACTIVE_COMPILATION_CONDITIONS": "VKID_COCOAPODS"
  },
  "swift_version": "5.9"
}
