{
  "name": "AcessibilityFaceCursor",
  "version": "0.0.6",
  "summary": "Take the movement of the user\\`s face and create a virtual cursor on the device. (IPhones X or higher only)",
  "swift_versions": "5.0",
  "description": "The AccessibilityFaceMouse is a pod in order to enable people with impaired movement of the upper limbs, to interact with applications without the use of any accessory.\n  It takes the movement of the user's face and creates a representation of these movements in the form of a cursor on the screen. When going over any view, like a button, he can use gestures to activate that action.\n    We have four types of gestures: Blink right eye; blinking left eye; show the language or with a voice command. This voice command can receive four actions, the first is to touch something, second to return\n    in navigation with navigationcontroller, the next and the previous, to use in views that have scroll, such as cell phone and collectionsviews. For other actions, you must integrate components that can facilitate the time of use\n    of the application.\n    The voice action is still in the testing phase. The most recommended is that of the tongue, as they had the best results, thus reducing repetitive effort.\nTo use it, just change the inheritance of a class that inherits from the viewcontroller by AccessibilityFaceAnchorViewController and start the necessary resources.\nFor a better use of the user, there is the AccessibilityGetSensitivityViewController class, which has the function of capturing the limitations of the user's face and thus adapting to his rhythm.",
  "homepage": "https://github.com/JBatista1/AcessibilityFaceCursor",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "João Batista": "j.batista.damasceno@icloud.com"
  },
  "source": {
    "git": "https://github.com/JBatista1/AcessibilityFaceCursor.git",
    "tag": "0.0.6"
  },
  "platforms": {
    "ios": "13.0"
  },
  "source_files": "AcessibilityFaceCursor/**/*.{h,m,swift}",
  "resource_bundles": {
    "AcessibilityFaceCursor": [
      "AcessibilityFaceCursor/*.xcassets"
    ]
  },
  "swift_version": "5.0"
}
