{
  "name": "Address-Autofill-iOS",
  "version": "1.0.1",
  "summary": "Official Address Autofill SDK for iOS to access Pataa API.",
  "description": "The Address Autofill SDK for iOS framework provides Pataa Autofill API\nto easily get Pataa accociated users address details.",
  "homepage": "https://docs.pataa.com/",
  "license": {
    "type": "Pataa Navigations Platform License",
    "text": "    Pataa Navigations Private Limited, and affiliates. All rights reserved.\n    You are hereby granted a non-exclusive, worldwide, royalty-free license to use, copy, modify and\n    distribute this software in source code or binary form for use in connection with the web\n    services and APIs provided by Pataa. The modifications, use, copy and distribution shall be in\n    connection with/for improvement of Pataa and affiliated products only.\n    As with any software that integrates with Pataa platform, your use to this software is subject to\n    the Pataa Navigations Private Limited’s Terms of Use, Privacy Policy, and License agreements.\n    ________________________ This software notice shall be included in all copies or substantial\n    portions of the software.\n    THIS SOFTWARE IS PROVIDED &quot;AS IS&quot;, WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n    NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\n    HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\n    WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n    OTHER DEALINGS IN THE SOFTWARE.\n\n"
  },
  "authors": "Pataa Navigations",
  "platforms": {
    "ios": "10.0"
  },
  "source": {
    "http": "https://github.com/pataa-com/Address-Autofill-iOS/releases/download/v1.0.1/PataaAutoFillSDK.xcframework.zip",
    "sha1": "3095632e8e6b52c0166db09e3e286eb737c68da2"
  },
  "ios": {
    "vendored_frameworks": "PataaAutoFillSDK.xcframework"
  }
}
