{
  "name": "HeliumKit",
  "version": "0.1.0",
  "summary": "HeliumKit is a lightweight framework that sits between your web services and the business logic of your app.",
  "description": "                        It provides basic mapping to automate conversion from DTO coming from your web services into object models of your business domain. We decided to streamline the process by adopting some libraries and frameworks:\n\n                        - PromiseKit to manage all the async code\n                        - FMDB to store data in SQLite\n                        - Mantle to convert models to and from JSON representation\n                        - MTLFMDBAdapter to convert models into SQL statements to feed to FMDB\n\n                        The main focus is to keep this framework as lightweight as possible and at the same time make it flexible enough for you to craft the perfect solution to your data transfer and storage layer. Many ideas come from RestKit as I've been using that framework for commercial apps before. But I've never been fond of Core Data as the storage architecture. I'm way too used to good old SQL statements and I can't live with the threading issues that you have to fight against when using Core Data. Core Data is great, but it's not for me.\n\n                        HeliumKit can simply keep your data in in-memory models or it can write them to SQLite as needed. That's completely configurable. I tried to keep in mind the convention over configuration paradigm as I hate boilerplate code.\n",
  "homepage": "https://github.com/tanis2000/HeliumKit",
  "license": "MIT",
  "authors": {
    "Valerio Santinelli": "santinelli@altralogica.it"
  },
  "source": {
    "git": "https://github.com/tanis2000/HeliumKit.git",
    "tag": "0.1.0"
  },
  "social_media_url": "https://twitter.com/santinellival",
  "platforms": {
    "ios": "7.0"
  },
  "requires_arc": true,
  "source_files": "Pod/Classes/**/*.{h,m}",
  "dependencies": {
    "AFNetworking": [
      "~> 2.3"
    ],
    "Mantle": [
      "~> 1.5"
    ],
    "FMDB": [
      "~> 2.3"
    ],
    "MTLFMDBAdapter": [
      "~> 0.1"
    ],
    "PromiseKit": [
      "~> 0.9"
    ]
  }
}
