{
  "name": "MentionKit",
  "version": "0.1.2",
  "summary": "MentionKit: A versatile and user-friendly iOS pod library for seamless user mentions",
  "dependencies": {
    "SDWebImage": [

    ]
  },
  "description": "MentionKit is a powerful and flexible pod library designed to simplify the process of implementing user mentions in iOS applications. With MentionKit, developers can effortlessly enable their users to mention other users by name, complete with customizable user avatars fetched from image URLs.\n\nThis library provides a robust and interactive mention selection menu that dynamically tracks the cursor's location in the text input, making it easy for users to select and tag other individuals. Additionally, MentionKit allows users to control the height of the mention menu, ensuring a seamless user experience for any text input view.\n\nKey Features:\n- Easily integrate user mentions in your iOS app.\n- Automatic fetching of user avatars from image URLs Using SDWebImage.\n- Interactive mention selection menu with cursor tracking.\n- Customizable height to suit different text input views.\n- Flexibility to trigger mentions programmatically for custom user list views.\n- Support for clickable user mentions to enhance user engagement.\n\nMentionKit empowers iOS developers to implement an intuitive and engaging user mention system, enhancing social interactions within their applications. Whether you're building a messaging app, a social network, or any other platform that involves user interactions, MentionKit is the perfect companion to take your app's user experience to the next level.\n\nGive your users the ability to seamlessly mention their friends, colleagues, or connections with MentionKit, and make user interactions more dynamic and enjoyable than ever before.",
  "homepage": "https://github.com/rachadaccoumeh/MentionKit",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "rachadaccoumeh": "rachacaccoumeh@gmail.com"
  },
  "source": {
    "git": "https://github.com/rachadaccoumeh/MentionKit.git",
    "tag": "0.1.2"
  },
  "platforms": {
    "ios": "10.0"
  },
  "source_files": "MentionKit/Classes/**/*"
}
