{
  "name": "AudioPlayerKit",
  "version": "0.1.4",
  "summary": "Audio player support most audio type with many feature.",
  "description": "AudioPlayerKit - Your Ultimate Audio Player Library\n\nAudioPlayerKit is your go-to solution for all your audio playback needs in iOS applications. This versatile and user-friendly library seamlessly integrates into both Objective-C and Swift projects. It's the modern alternative to the outdated APAudioPlayer, offering a wide array of enhanced features.\n\nKey Features:\n\nPlayback Control: AudioPlayerKit simplifies audio playback with easy-to-use controls like Play, Pause, and Stop. You can effortlessly manage audio files in various formats, including *.m4a, *.mp3, *.mp2, *.mp1, *.wave, *.ogg, *.wav, *.aiff, *.opus, *.flac, *.wv, and more. The library is designed to be extendable, supporting additional audio formats.\n\nReal-time Spectrum Analysis: Gain insights into your audio content with real-time spectrum analysis. AudioPlayerKit provides you with a spectrum data array for a more immersive audio experience.\n\nAdjustable Playback Speed: Customize the audio playback speed to your liking. Speed up or slow down audio content to fit various use cases, such as language learning or audio transcription.\n\nDelegate Support: AudioPlayerKit uses a robust delegate system, allowing you to receive updates on various player events, such as changes in player status, playback completion, interruptions, and more. The available delegate methods include:\n\nplayerDidChangePlayingStatus: Get notified when the player's playing status changes.\nplayerDidFinishPlaying: Receive an event when audio playback is complete.\nplayerEndInterruption: Handle interruptions gracefully and resume playback.\nplayerDidFinishPlaying: Stay informed when the player finishes playing.\nBuilt on BASS from un4seen: AudioPlayerKit leverages the powerful BASS library from un4seen, known for its high-performance audio capabilities. This solid foundation ensures reliable and efficient audio playback.\n\nEasy Integration: AudioPlayerKit seamlessly integrates into your Swift or Objective-C iOS projects, offering a simple and intuitive interface for audio control and analysis.\n\nGitHub Repository:\nAudioPlayerKit is an open-source project available on GitHub. You can find the repository here. We welcome contributions and assistance from the community to make AudioPlayerKit even better!\n\nAudioPlayerKit brings a wealth of powerful features to your iOS audio applications, ensuring a top-notch user experience and a multitude of options for audio manipulation and analysis. This library is your go-to choice for all your audio-related tasks, making it easy to integrate and utilize audio playback capabilities in your projects.",
  "homepage": "https://github.com/rachadaccoumeh/AudioPlayerKit",
  "screenshots": [
    "https://raw.githubusercontent.com/rachadaccoumeh/AudioPlayerKit/master/Screenshots/screenshot1.png",
    "https://raw.githubusercontent.com/rachadaccoumeh/AudioPlayerKit/master/Screenshots/screenshot2.gif"
  ],
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "Rachad Accoumeh": "rachadaccoumeh@gmail.com"
  },
  "source": {
    "git": "https://github.com/rachadaccoumeh/AudioPlayerKit.git",
    "tag": "0.1.4"
  },
  "social_media_url": "https://linkedin.com/in/rachad-accoumeh",
  "platforms": {
    "ios": "13.0"
  },
  "swift_versions": "5.0",
  "resources": [
    "AudioPlayerKit/Classes/BASS/**/*.txt",
    "AudioPlayerKit/Classes/BASS/**/*.chm"
  ],
  "ios": {
    "vendored_frameworks": [
      "AudioPlayerKit/Classes/BASS/bass.xcframework",
      "AudioPlayerKit/Classes/BASS/bass_fx.xcframework",
      "AudioPlayerKit/Classes/BASS/bassopus.xcframework",
      "AudioPlayerKit/Classes/BASS/bassflac.xcframework"
    ]
  },
  "requires_arc": true,
  "frameworks": [
    "AVFoundation",
    "bass",
    "bass_fx",
    "bassopus",
    "bassflac"
  ],
  "source_files": "AudioPlayerKit/Classes/**/*.{h,m,swift}",
  "preserve_paths": "AudioPlayerKit/Classes/**/*.h",
  "public_header_files": "AudioPlayerKit/Classes/**/*.h",
  "swift_version": "5.0"
}
