{
  "name": "Review-Request",
  "version": "1.0.0",
  "summary": "Remind users to rate your iOS app on the AppStore",
  "description": "                   #Review Request\nThis project can be added to your application to help remind users to rate your iOS app.  \n\n###Why would you want to ask users for a rating?\nIt is rare for users to rate an app.  If they are very upset, they are more likely to make the effort to find an app in the App Store and post a negative review.  But what about users who like an app?  How many apps have you reviewed?  It probably isn't that many even if you are happy with many of the apps that you are using.  So what happens to users who are perfectly happy with an app and continue to use it?  They probably never provide a review.\n\nIn order for a user to actually post a review, they have to be very motivated to do so or it has to be EXTREMELY easy.  If they aren't motivated, they won't bother.  *Review Request* is designed to make it extremely easy to review an app.  Once your user has a chance to use your newest version they are asked to post a review.  How long before prompting is up to _you_ the developer.\n\nRemember this won't make your app any better.  It will just make it easier for people to review.  If your app is bad, expect more negative feedback.  If you app is good, hopefully you will see more positive feedback.\n\n###Adding the code to your project\nEither add `ReviewRequest.xcproj` to your project or directly add `ReviewRequest.m` and `ReviewRequest.h`.\n\nAll user visible text is exposed as properties so it can be customized for your application and fit in to your localization story.  All properties are documented in the header file.\n\n###Configuring your app\nTo ask for a rating, just add the following code to your startup path.  Don't worry about spamming the user.  You can configure the number of launches before requesting a review as well as the minimum amount of time between first launch and the request.  This will only prompt once per version.  (See the documentation in the header.)  The defaults require that the user launch your app at least 12 times and that at least 23 hours have passed since the first launch.\n\n    NSURL *url = [NSURL URLWithString:@\"insert your URL here\"];\n    ReviewRequest *reviewRequest = [[ReviewRequest alloc] initWithItunesUrl:url];\n    [reviewRequest askForReviewIfNeeded];\n\n###Getting your app's App Store URL\nYou can get the URL for your app by following these steps:\n  - Open iTunes an select the iTunes store\n  - Enter your app's name in the search box.  Press enter.\n  - Control click on your app and select \"Copy iTunes Store URL\" from the context menu.\n\nThat will look something like the following:\n`http://itunes.apple.com/us/app/google+/id12345?mt=8`\n\nThis will launch the App Store and open the page about your app.  However, you can even do better.  If you use the following format, the user will be taken directly ratings for your app.  However, make sure you change the 12345 for your app's ID.  You will find the ID in the URL that you copied from iTunes.\n`itms-apps://ax.itunes.apple.com/WebObjects/MZStore.woa/wa/viewContentsUserReviews?type=Purple+Software&id=12345`\n\n*You must test this on a device and not on the simulator, the App Store is not installed on the simulator.*\n\n#####Review Request is based on the work of Games From Within.  (http://gamesfromwithin.com/increase-your-app-ratings-on-the-app-store)  Forked from Google Code (https://code.google.com/p/review-request/)\n",
  "homepage": "https://github.com/hughvidos/review-request",
  "license": {
    "type": "MIT",
    "file": "LICENSE.txt"
  },
  "authors": {
    "hughvidos": "hugh@vidos.com"
  },
  "platforms": {
    "ios": "5.0"
  },
  "source": {
    "git": "https://github.com/hughvidos/review-request.git",
    "tag": "1.0.0"
  },
  "source_files": [
    "",
    "*.{h,m}"
  ],
  "exclude_files": "Classes/Exclude",
  "requires_arc": false
}
