{
  "name": "KatalysatorSDK",
  "version": "1.8.4",
  "summary": "A proprietary iOS ibeacon and advertisement framework",
  "description": "Android or iPhone whatever platform you prefer we got you covered. Just plug our SDK into your existing app and instantly start enjoying all the benefits of hyperlocal targeting and contextual messaging. No coding needed on your part just install the SDK and manage and control all settings through our CMS. We cache content for users with reduced network access and encrypt beacon data to ensure that your customers are receiving an exceptional experience. Windows phone SDK is coming up later this spring.",
  "homepage": "http://katalysatorab.github.io/",
  "license": {
    "type": "Copyright",
    "text": "      KATALYSATOR AB. TERMS OF SERVICE Last Updated: May 19, 2014 \n \n      The following Katalysator AB. Terms of Service (“Terms” or \n      “Agreement”) constitutes a legal agreement between you and the entity on whose \n      behalf you are accessing the Service (as defined below) (“Developer”) and Katalysator AB.\n      Developer’s use of the Service is subject to the terms and conditions set forth below, so Developer should take \n      the time to fully understand how these Terms govern Developer’s relationship with \n      Katalysator and Developer’s use of the Service. If you have questions regarding the \n      Terms, please contact Katalysator at team@katalysator.io. \n      DEVELOPER’S RIGHT TO USE THE SERVICE IS EXPRESSLY CONDITIONED ON \n      ACCEPTANCE OF THESE TERMS. BY USING THE SERVICE, YOU ARE AGREEING \n      TO BE BOUND BY THE TERMS ON BEHALF OF DEVELOPER. IF YOU ARE \n      ACCESSING THE SERVICE ON BEHALF OF YOUR EMPLOYER OR ANOTHER \n      ENTITY, YOU REPRESENT AND WARRANT THAT YOU HAVE THE AUTHORITY TO \n      AGREE TO THESE TERMS ON ITS BEHALF. IF DEVELOPER DOES NOT AGREE \n      WITH ANY PROVISION OF THE TERMS, OR YOU DO NOT HAVE AUTHORITY TO \n      BIND DEVELOPER, YOU MAY NOT ACCESS OR USE THE SERVICE IN ANY \n      MANNER FOR ANY PURPOSE.\n\n"
  },
  "authors": {
    "Sven Roeder": "sven@glimr.io"
  },
  "platforms": {
    "ios": "6.0"
  },
  "source": {
    "git": "https://github.com/KatalysatorAB/BeaconSDK-iOS.git",
    "tag": "1.8.4"
  },
  "source_files": "KatalysatorSDK.framework/Versions/A/Headers/*.h",
  "exclude_files": "Sample",
  "public_header_files": "KatalysatorSDK.framework/Versions/A/Headers/*",
  "preserve_paths": "KatalysatorSDK.framework/*",
  "frameworks": [
    "CoreLocation",
    "CoreTelephony",
    "AdSupport",
    "MediaPlayer",
    "SystemConfiguration",
    "MobileCoreServices",
    "CoreBluetooth"
  ],
  "ios": {
    "vendored_frameworks": "KatalysatorSDK.framework"
  },
  "requires_arc": true,
  "xcconfig": {
    "FRAMEWORK_SEARCH_PATHS": "$(inherited)"
  }
}
