{
  "name": "SMPageControl",
  "version": "1.2",
  "summary": "UIPageControl’s fancy one-upping cousin.",
  "description": "    Designers love to make beautifully custom page controls that fit in with all the wood,\n    gradients, and inner shadows they've worked so hard perfecting.\n\n    Who can blame them?! SMPageControl makes it dead simple to give them what they want. Even\n    better, SMPageControl is a drop in replacement for UIPageControl. It mirrors all the functions\n    of UIPageControl, with literally no changes beyond the class name.\n",
  "homepage": "https://github.com/Spaceman-Labs/SMPageControl",
  "license": {
    "type": "MIT",
    "text": "      Copyright (C) 2012 by Spaceman Labs\n\n      Permission is hereby granted, free of charge, to any person obtaining a copy of this software\n      and associated documentation files (the \"Software\"), to deal in the Software without\n      restriction, including without limitation the rights to use, copy, modify, merge, publish,\n      distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the\n      Software is furnished to do so, subject to the following conditions:\n\n      The above copyright notice and this permission notice shall be included in all copies or\n      substantial portions of the Software.\n\n      THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING\n      BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n      NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,\n      DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n      OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
  },
  "authors": {
    "Jerry Jones": "jerry@spacemanlabs.com"
  },
  "source": {
    "git": "https://github.com/Spaceman-Labs/SMPageControl.git",
    "tag": "1.2"
  },
  "platforms": {
    "ios": "5.0"
  },
  "source_files": "SMPageControl.{h,m}",
  "requires_arc": true
}
