{
  "name": "KinveyKit",
  "version": "1.27.1",
  "summary": "Kinvey iOS SDK",
  "description": "Kinvey provides a robust backend for your mobile apps by providing features that enable you to build amazing apps without worrying about your backend. Currently Kinvey provides the following services:\n\n* __appdata__ — A query-able key/value (and more) data storage platform for your app\n* __Resources__ — A storage system for your media content (images, videos, files, etc.) that provides out of the box Content Distribution Network (CDN) capabilities.\n* __Users__ — Keep track of users of your application and control access to data on a user-by-user basis\n* __Push Notifications__ — Our partnership with Urban Airship gives you awesome push features without the headache of managing them yourself.\n* __Location-Aware Queries__ — Query your data for entities that are near other entities.\n\nFor more details on how to use these features read the [Kinvey Service Overview](http://docs.kinvey.com/service-overview.html).\n",
  "homepage": "http://devcenter.kinvey.com/ios/guides/getting-started",
  "license": {
    "type": "Copyright",
    "text": " Copyright (c) 2014, Kinvey, Inc. All rights reserved.\n \n This software is licensed to you under the Kinvey terms of service located at\n http://www.kinvey.com/terms-of-use. By downloading, accessing and/or using this\n software, you hereby accept such terms of service  (and any agreement referenced\n therein) and agree that you have read, understand and agree to be bound by such\n terms of service and are of legal age to agree to such terms with Kinvey.\n \n This software contains valuable confidential and proprietary information of\n KINVEY, INC and is subject to applicable licensing agreements.\n Unauthorized reproduction, transmission or distribution of this file and its\n contents is a violation of applicable laws.\n"
  },
  "authors": "Kinvey, Inc.",
  "social_media_url": "http://twitter.com/Kinvey",
  "source": {
    "http": "http://download.kinvey.com/iOS/KinveyKit-1.27.1.zip"
  },
  "platforms": {
    "ios": "6.0"
  },
  "source_files": "KinveyKit-1.27.1/KinveyKit.framework/Versions/A/Headers/*.h",
  "preserve_paths": "KinveyKit-1.27.1/*.framework",
  "vendored_frameworks": "KinveyKit-1.27.1/*.framework",
  "frameworks": [
    "Accounts",
    "CoreGraphics",
    "CoreLocation",
    "MobileCoreServices",
    "Security",
    "Social",
    "SystemConfiguration"
  ],
  "libraries": "sqlite3",
  "xcconfig": {
    "OTHER_LDFLAGS": "-lObjC",
    "FRAMEWORK_SEARCH_PATHS": "\"$(PODS_ROOT)/KinveyKit\""
  },
  "requires_arc": true
}
