{
  "name": "ABMediaView",
  "version": "0.4.2",
  "summary": "UIImageView subclass which can display, lazy-load, and cache images, videos, GIFs and audio easily, with fullscreen and minimized mode",
  "description": "ABMediaView can display images, videos, as well as now GIFs and Audio! It subclasses UIImageView, and has functionality to lazy-load images from the web. In addition, it can also display videos, downloaded via URL from disk or web. Videos contain a player with a timeline and scrubbing. GIFs can also be displayed in an ABMediaView, via lazy-loading from the web, or set via NSData. The GIF that is downloaded is saved as a UIImage object for easy storage. Audio can also be displayed in the player by simply providing a url from the web or on disk. A major added functionality is that this mediaView has a queue and can present mediaViews in fullscreen mode. There is functionality which allows the view to be minimized by swiping, where it sits in the bottom right corner as a thumbnail. Videos can continue playing and be heard from this position. Afterwards, the user can choose to swipe the view away to dismiss. Alternatively, one can set the mediaView to dismiss immediately when swiping down instead of minimizing. In addition, automated caching is available. There are various different functionality that can be toggled on and off to customize the view to one's choosing.",
  "homepage": "https://github.com/andrewboryk/ABMediaView",
  "screenshots": [
    "https://raw.githubusercontent.com/AndrewBoryk/ABMediaView/dev/ABMediaViewDemoScreenshot.gif",
    "https://raw.githubusercontent.com/AndrewBoryk/ABMediaView/dev/ABMediaViewScrubScreenshot.gif",
    "https://raw.githubusercontent.com/AndrewBoryk/ABMediaView/master/ABMediaViewVideoPreviewUsingGIFScreenshot.gif"
  ],
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "Andrew Boryk": "andrewcboryk@gmail.com"
  },
  "source": {
    "git": "https://github.com/andrewboryk/ABMediaView.git",
    "tag": "0.4.2"
  },
  "social_media_url": "https://twitter.com/TrepIsLife",
  "platforms": {
    "ios": "8.0"
  },
  "source_files": "ABMediaView/Classes/**/*"
}
