{
  "name": "OpenWrapSDK",
  "version": "4.9.0",
  "summary": "The OpenWrapSDK iOS SDK makes it easy to incorporate ads into iOS applications & monetize your applications with ease",
  "homepage": "https://help.pubmatic.com/openwrap/docs/home-openwrap-sdk-for-ios",
  "license": {
    "type": "Pubmatic Inc. license",
    "text": "    \n    /*\n     * PubMatic Inc. (\"PubMatic\") CONFIDENTIAL\n     * Unpublished Copyright (c) 2006-2025 PubMatic, All Rights Reserved.\n     *\n     * NOTICE:  All information contained herein is, and remains the property of\n     * PubMatic. The intellectual and technical concepts contained herein are\n     * proprietary to PubMatic and may be covered by U.S. and Foreign Patents,\n     * patents in process, and are protected by trade secret or copyright law.\n     * Dissemination of this information or reproduction of this material is\n     * strictly forbidden unless prior written permission is obtained from PubMatic.\n     * Access to the source code contained herein is hereby forbidden to anyone\n     * except current PubMatic employees, managers or contractors who have executed\n     * Confidentiality and Non-disclosure agreements explicitly covering such access\n     * or to such other persons whom are directly authorized by PubMatic to access\n     * the source code and are subject to confidentiality and nondisclosure\n     * obligations with respect to the source code.\n     *\n     * The copyright notice above does not evidence any actual or intended\n     * publication or disclosure  of  this source code, which includes information\n     * that is confidential and/or proprietary, and is a trade secret, of  PubMatic.\n     * ANY REPRODUCTION, MODIFICATION, DISTRIBUTION, PUBLIC  PERFORMANCE, OR PUBLIC\n     * DISPLAY OF OR THROUGH USE  OF THIS  SOURCE CODE  WITHOUT  THE EXPRESS WRITTEN\n     * CONSENT OF PUBMATIC IS STRICTLY PROHIBITED, AND IN VIOLATION OF APPLICABLE\n     * LAWS AND INTERNATIONAL TREATIES.  THE RECEIPT OR POSSESSION OF  THIS SOURCE\n     * CODE AND/OR RELATED INFORMATION DOES NOT CONVEY OR IMPLY ANY RIGHTS TO\n     * REPRODUCE, DISCLOSE OR DISTRIBUTE ITS CONTENTS, OR TO MANUFACTURE, USE, OR\n     * SELL ANYTHING THAT IT  MAY DESCRIBE, IN WHOLE OR IN PART.\n     */     \n"
  },
  "authors": {
    "PubMatic": "pm-library@pubmatic.com"
  },
  "source": {
    "http": "https://repo.pubmatic.com/artifactory/public-repos/ios/openwrap-sdk/4.9.0/openwrap-sdk-4.9.0.zip"
  },
  "platforms": {
    "ios": "12.0"
  },
  "frameworks": [
    "Foundation",
    "UIKit",
    "MessageUI",
    "CoreLocation",
    "EventKitUI",
    "EventKit",
    "AdSupport",
    "SystemConfiguration",
    "CoreGraphics",
    "CoreTelephony",
    "WebKit"
  ],
  "user_target_xcconfig": {
    "OTHER_LDFLAGS": "-l\"c++\""
  },
  "vendored_frameworks": [
    "OpenWrapSDK/OpenWrapSDK.xcframework",
    "OpenWrapSDK/OMSDK_Pubmatic.xcframework"
  ],
  "preserve_paths": "OpenWrapSDK/dSYMScript"
}
