{
  "name": "MiSnapUX",
  "version": "5.3.5",
  "summary": "MiSnapUX.",
  "description": "MiSnapUX is an add-on module to the MiSnap SDK.",
  "homepage": "https://github.com/Mitek-Systems/MiSnap-iOS",
  "license": {
    "type": "Copyright",
    "text": "By you accessing this SDK and/or any related documentation, sample apps and libraries (collectively, the “SDK”) you acknowledge that either (i) you currently are a party to a  contract/license with Mitek Systems, Inc. (“Mitek”) which governs access to and use of the SDK (in which case, the terms and conditions of that contract govern your use of the SDK) or (ii) you agree to the following terms and conditions:\n\nYou will use the SDK solely to evaluate the SDK for the purpose of internal development of software and applications to the extent necessary for such applications to transfer data to Mitek.  You have no right to receive any underlying software or a copy of the object code or source code to the SDK.   You will not make copies of the SDK. You will not make the SDK available to any third party.   Mitek shall own all modifications, revisions, or derivative works of the code contained in its SDK.\n\nYour right to use the SDK is conditional upon the following. You may not: (i) sell, rent, lease or otherwise distribute or share the SDK; (ii) disassemble, decompile, reverse engineer the SDK or output from the foregoing or otherwise attempt to derive the source code (or the underlying ideas, algorithms, structure or organization); (iii) provide access to the SDK to any third party; (iv) create any derivative works based upon the SDK;  (v) access the SDK in order to build a competitive solution or gather competitive intelligence or to assist someone else to build a competitive solution or gather competitive intelligence; (vi) use the SDK in a way that violates any applicable law; (vii) interfere with or disrupt the integrity or performance of the SDK, or (viii) attempt to gain unauthorized access to Mitek’s related systems or networks.\n\nMitek is giving permission to you to use the SDK solely in accordance with these terms and conditions.  The SDK is not being sold. Mitek and/or its licensors retain the exclusive ownership of all rights, title and interest, including all intellectual property rights, in and to the SDK(s) and associated documentation, including but not limited (i) any components, corrections, updates, upgrades, methodologies, derivative works and associated documentation thereof and (ii) all trademarks, trade names, trade secrets and other proprietary information of Mitek related thereto. Mitek also owns all suggestions, ideas, enhancement requests, or feedback related to the SDK.\n\nAll rights not expressly granted to you are reserved by Mitek and its licensors, and you shall have no rights which arise by implication or estoppel.\n"
  },
  "authors": {
    "Mitek Engineering": "support@miteksystems.com"
  },
  "platforms": {
    "ios": "11.0"
  },
  "source": {
    "http": "https://github.com/Mitek-Systems/MiSnap-iOS/releases/download/5.3.5/MiSnapUX-5.3.5.zip"
  },
  "vendored_frameworks": "MiSnapUX/MiSnapUX.xcframework",
  "dependencies": {
    "MiSnapAssetManager": [
      "5.3.5"
    ]
  }
}
