{
  "name": "TPLMaps",
  "version": "4.1.8",
  "summary": "TPL Maps, a product of TPL Trakker Ltd. is Pakistan’s first indigenous digital mapping solution.",
  "description": "TPL Maps, a product of TPL Trakker Ltd. is Pakistan’s first indigenous digital mapping solution. TPL Maps has been created using state of the art technology that will not only provide real time intelligent routing but also give users access to live traffic updates, turn-by-turn navigation and smart search options. TPL Maps will help users reach their desired destination by utilizing the smart search option that has over 1.35 million Points of Interests (POIs) to choose from across Pakistan. TPL Maps has been created locally and covers over 500 cities and 800,000 distinct housing addresses spread over a road network of 280,000 km. In addition TPL Maps also includes 2D models of over 55,000 POIs which will further assist users identify and reach their desired location in the shortest time period possible. TPL Maps provides voice guided turn-by-turn navigation while taking into considerations the live traffic information in the system as well as road priority levels and other variables to provide the optimum route according to the requirements of each individual user.",
  "homepage": "https://github.com/anumshk27/TPLMaps",
  "screenshots": [
    "https://api.tplmaps.com/apiportal/assets/images/logo-af7d4a2a6d.svg"
  ],
  "license": {
    "type": "MIT",
    "text": "                \n                   MIT License\n\nCopyright (c) 2017 TPLMaps\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
  },
  "authors": {
    "TPLMaps": "tplmaps.dev@gmail.com"
  },
  "platforms": {
    "ios": "12.0"
  },
  "source": {
    "git": "https://github.com/anumshk27/TPLMaps.git",
    "tag": "4.1.8"
  },
  "ios": {
    "vendored_frameworks": "TPLMaps/TPLMaps.xcframework",
    "frameworks": [
      "UIKit",
      "CoreLocation",
      "SystemConfiguration",
      "CFNetwork",
      "CoreGraphics",
      "QuartzCore",
      "GLKit",
      "OpenGLES",
      "JavaScriptCore"
    ]
  },
  "resources": "TPLMaps/TPLMaps.bundle",
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "requires_arc": true
}
