{
  "name": "NabtoEdgeClientApiFW",
  "platforms": {
    "ios": "12.0"
  },
  "version": "5.13.0-rc1",
  "summary": "Nabto Edge Client API (Plain C, framework version)",
  "description": "This pod installs the iOS version of the cross-platform ANSI C based Nabto Edge Client API library. Also see the NabtoEdgeClientSwift pod for a high level wrapper in Swift of the low level C API.\n\nThe Nabto Edge communication platform enables you to establish direct connections from a client to even the most resource constrained devices, regardless of the firewall configuration of each peer - a P2P middleware that supports IoT well.\n\nThe platform has been designed from the ground and up with strong security as a focal point. All in all, it enables vendors to create simple, high performant and secure solutions for their Internet connected products with very little effort.\n\nThe Nabto Edge platform supersedes the Nabto Micro platform with many new features and capabilities. Read more about Nabto Edge on https://docs.nabto.com",
  "homepage": "https://docs.nabto.com",
  "license": {
    "type": "Commercial",
    "text": "Copyright (c) 2023 Nabto <apps@nabto.com>\n\nYou can use the Nabto Edge Client API (Plain C) framework royalty free in your\nown applications. The license does not grant permission to re-distribute\nlibraries unless embedded in an application. This license does not grant\npermission to reverse engineer or modify the libraries.\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\nCOPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\nIN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\nCONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n"
  },
  "authors": {
    "Nabto": "apps@nabto.com"
  },
  "source": {
    "http": "https://github.com/nabto/nabto-client-sdk-releases/raw/main/lib/ios-xcframework/NabtoEdgeClientApiFW.xcframework.zip"
  },
  "readme": "https://downloads.nabto.com/assets/edge/ios/nabto-client-plainc/pod-README.md",
  "changelog": "https://github.com/nabto/nabto-client-sdk-releases/blob/main/CHANGELOG.md",
  "vendored_frameworks": "NabtoEdgeClientApiFW.xcframework",
  "ios": {
    "preserve_paths": "NabtoEdgeClientApiFW.xcframework",
    "libraries": [
      "c++",
      "stdc++"
    ]
  }
}
