{
  "name": "PayPalCommerce",
  "version": "2.0.0-beta",
  "summary": "PayPal Commerce SDK",
  "homepage": "https://commerce.paypal.com/",
  "description": "This library will allow you to embed PayPal Commerce within your own iOS app.",
  "license": {
    "type": "Commercial",
    "text": "                    Copyright (c) 2009-2016 Braintree, a division of PayPal, Inc.\n\n                    Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\n                    The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n                    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n                    --\n\n                    PaymentKit from Stripe\n\n                    The MIT License\n\n                    Copyright (c) 2013- Stripe, Inc. (https://stripe.com)\n\n                    Permission is hereby granted, free of charge, to any person obtaining a copy\n                    of this software and associated documentation files (the \"Software\"), to deal\n                    in the Software without restriction, including without limitation the rights\n                    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n                    copies of the Software, and to permit persons to whom the Software is\n                    furnished to do so, subject to the following conditions:\n\n                    The above copyright notice and this permission notice shall be included in\n                    all copies or substantial portions of the Software.\n\n                    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n                    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n                    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n                    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n                    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n                    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n                    THE SOFTWARE.\n\n                    --\n\n                    CHTCollectionViewWaterfallLayout\n                    Copyright (c) 2012 Nelson Tai <chiahsien@gmail.com>\n\n                    Permission is hereby granted, free of charge, to any person obtaining a copy\n                    of this software and associated documentation files (the \"Software\"), to deal\n                    in the Software without restriction, including without limitation the rights\n                    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n                    copies of the Software, and to permit persons to whom the Software is furnished\n                    to do so, subject to the following conditions:\n\n                    The above copyright notice and this permission notice shall be included in all\n                    copies or substantial portions of the Software.\n\n                    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n                    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n                    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n                    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n                    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n                    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n                    THE SOFTWARE.\n\n\n                    --\n\n                    BCCKeychain\n                    Created by Buzz Andersen on 10/20/08.\n                    Based partly on code by Jonathan Wight, Jon Crosby, and Mike Malone.\n                    Copyright 2013 Brooklyn Computer Club. All rights reserved.\n\n                    Permission is hereby granted, free of charge, to any person\n                    obtaining a copy of this software and associated documentation\n                    files (the \"Software\"), to deal in the Software without\n                    restriction, including without limitation the rights to use,\n                    copy, modify, merge, publish, distribute, sublicense, and/or sell\n                    copies of the Software, and to permit persons to whom the\n                    Software is furnished to do so, subject to the following\n                    conditions:\n\n                    The above copyright notice and this permission notice shall be\n                    included in all copies or substantial portions of the Software.\n\n                    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n                    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES\n                    OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n                    NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\n                    HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\n                    WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n                    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n                    OTHER DEALINGS IN THE SOFTWARE.\n\n\n"
  },
  "authors": {
    "PayPal, Inc": "commerce-sdk@getbraintree.com"
  },
  "platforms": {
    "ios": "8.0"
  },
  "requires_arc": true,
  "source": {
    "git": "https://github.com/braintree/paypal-commerce-ios.git",
    "tag": "2.0.0-beta"
  },
  "source_files": "PayPalCommerce/*.h",
  "public_header_files": "PayPalCommerce/*.h",
  "preserve_paths": "PayPalCommerce/*.a",
  "xcconfig": {
    "OTHER_LDFLAGS": "-all_load",
    "LIBRARY_SEARCH_PATHS": "$(PODS_ROOT)/PayPalCommerce/PayPalCommerce"
  },
  "libraries": "PayPalCommerce",
  "resource_bundles": {
    "PayPalCommerceResources": "PayPalCommerce/PayPalCommerceResources/*"
  },
  "weak_frameworks": [
    "PassKit",
    "WebKit"
  ],
  "dependencies": {
    "Mantle": [
      "~> 1.5"
    ],
    "AFNetworking": [
      "~> 2.6"
    ],
    "FBSDKLoginKit": [
      "~> 4.6"
    ],
    "CGLMail": [
      "~> 0.1.0"
    ],
    "GoogleAnalytics": [
      "~> 3.1"
    ],
    "ECSlidingViewController": [
      "~> 2.0"
    ],
    "libPhoneNumber-iOS": [
      "~> 0.8"
    ],
    "LogglyLogger-CocoaLumberjack": [
      "~> 2.0"
    ],
    "Braintree/Core": [
      "~> 4.0"
    ],
    "Braintree/Card": [
      "~> 4.0"
    ],
    "Braintree/PayPalOneTouch": [
      "~> 4.0"
    ],
    "CardIO": [
      "~> 5.0"
    ]
  }
}
