{
  "name": "AhoyNave",
  "version": "1.1.6",
  "summary": "The AhoyNave iOS SDK is built to provide seamless integration of Navigation along with Map functionalities into your app",
  "description": "The features of AhoyNave are\nDisplay a Map with zoom and pan functionality\nAdd markers to the map\nAdd a polyline\nAdd a polygon\nLoad custom themes(Day/Night) etc\nNavigate from source to destination\nRestricting the route",
  "homepage": "https://ams.ahoy.technology",
  "license": {
    "type": "Proprietary",
    "text": "   PROPRIETARY SOFTWARE AND LICENSE. The AHOYNave SDK is the valuable, confidential, and proprietary property of Ahoy. Ahoy shall retain exclusive title to this property, and all modifications, implementations, derivative works, upgrades, productization and subsequent releases, both during the term and after the termination of this Agreement. To the extent that SUBSCRIBER in any way contributes to the further development of the AHOYNave Software, SUBSCRIBER hereby irrevocably assigns and/or agrees to assign all rights in any such contributions or further developments to COMPANY. Without limitation, SUBSCRIBER acknowledges and agrees that all patent rights, copyrights and trade secret rights in and to the AHOYNave Software shall remain the exclusive property of COMPANY at all times, EXCEPT AS OTHERWISE PROVIDED IN THIS AGREEMENT, SUBSCRIBER SHALL NOT, IN WHOLE OR IN PART, AT ANY TIME DURING THE TERM OF OR AFTER THE TERMINATION OF THIS AGREEMENT: (i) SELL, ASSIGN, LEASE, DISTRIBUTE, OR OTHER WISE TRANSFER THE AHOYNave SOFTWARE TO ANY THIRD PARTY; (ii) COPY OR REPRODUCE THE AHOYNave SOFTWARE IN ANY MANNER; (iii) DISCLOSE THE AHOYNave SOFTWARE TO ANY PARTY, EXCEPT TO SUBSCRIBER'S EMPLOYEES AND CONTRACTORS WHO REQUIRE ACCESS TO THE AHOYNave SOFTWARE FOR THE PURPOSES OF THIS AGREEMENT; (iv) ALLOW ANY CONTRACTOR TO ACCESS THE AHOYNave SOFTWARE OTHER THAN WITHIN SUBSCRIBER'S LOCATION; (v) MODIFY, DISASSEMBLE, DECOMPILE, REVERSE ENGINEER OR ATTEMPT TO DISCOVER THE SOURCE CODE OR UNDERLYING ALGORITHMS OR TECHNOLOGY OF THE SOFTWARE OR TRANSLATE THE AHOYNave SOFTWARE; (vi) USE THE SOFTWARE IN ANY SERVICE BUREAU OR TIMESHARE CAPACITY; OR (vii) ALLOW ANY PERSON OR ENTITY TO COMMIT ANY OF THE ACTIONS DESCRIBED IN (i) THROUGH (vi)\n"
  },
  "authors": {
    "Syed Ismail Ahamed": "s.ismail@theahoyapp.com"
  },
  "platforms": {
    "ios": "13.0"
  },
  "ios": {
    "vendored_frameworks": "AhoyNave.framework"
  },
  "source": {
    "http": "https://iossdk.blob.core.windows.net/iossdk/AhoyNave.framework.zip"
  },
  "swift_versions": "5.0",
  "exclude_files": "Classes/Exclude",
  "dependencies": {
    "AhoyHereSDK": [

    ]
  },
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "swift_version": "5.0"
}
