{
  "name": "ATOM-Standalone",
  "version": "3.6.0",
  "summary": "This is the iOS SDK of ATOM. You can read more about it at https://verve.com.",
  "description": "The ATOM Iibrary is to be designed with privacy in mind, to explore ways to support interest-based advertising, \nwith improved transparency, stronger privacy assurances and a different approach for sensitive categories. \nThe library will infer a handful of recognizable cohorts based on the activity to help app serve relevant ads.",
  "homepage": "https://github.com/pubnative/ATOM",
  "documentation_url": "https://developers.verve.com/v3.0/docs/hybid",
  "license": {
    "type": "Custom",
    "text": "ATOM License Terms (\"License Terms\")\n\nThese License Terms apply to the Software (as defined below) provided by Verve Group Europe GmbH,\nKarl-Liebknecht-Str. 32, 10178 Berlin (\"VGE\"). By downloading or using the Software, you (\"You\" or\n\"Licensee\") agree to be bound by these License Terms. Any use of the Software, other than as\nauthorised under these Licence Terms, is prohibited.\n\nPreamble\n\n(A) VGE offers certain sell-side monetisation solutions and tools for publishers of mobile\n    applications, which includes proprietary machine learning technology for ID-less\n    addressability (\"Services\") and designed for execution on Android or Apple iOS operating\n    systems owned or operated by Licensee (\"Digital Properties\").\n\n(B) The Software (as defined below) supports and can be exclusively used as part of the Services.\n\n(C) The Services will be rendered under a separate commercial agreement (\"Commercial\n    Agreement\").\n\n1. Scope\n\n1.1 Software. These License Terms apply to the ATOM software for Android or iOS available\n    under the URL https://github.com/pubnative/ATOM or any other URL designated by VGE\n    from version 3.6.0 onward or any such other successor version of ATOM, including any and\n    all programs, repositories, libraries, code, or other software components, whether in source\n    code or machine-readable code, including its documentation as applicable, that are part of,\n    referenced, or otherwise connected by VGE to the ATOM (the \"Software\"). These License\n    Terms apply to the Software regardless of the way in which it was obtained, whether by\n    download, hard copy, e-mail, or any other form of transmission.\n\n1.2 Exclusions. These License Terms do not apply to the HyBid SDK (current versions available\n    under the URL https://github.com/pubnative/pubnative-hybid-android-sdk and\n    https://github.com/pubnative/pubnative-hybid-ios-sdk) and its functionalities, and any other\n    software or software component that is distributed under separate license terms.\n\n2. License\n\n2.1 Commercial License. Subject to Your compliance with these License Terms and the\n    conclusion of a Commercial Agreement, VGE hereby grants You, for the term of the\n    Commercial Agreement, the non-exclusive, non-transferable, revocable, worldwide right to\n    (i) use and copy the Software, (ii) to, distribute and publish the Software solely in conjunction\n    with and as part of the Digital Properties (the \"License\"), Territorial limitations contained in\n    the Commercial Agreement will also apply to the License.\n\n2.2 Sub-License. The license provided under clause 2.1 is sub-licensable only to Your affiliates\n    and only to the extent that such affiliates are party to or may benefit from the Services under\n    a Commercial Agreement. Any such sub-license ceases if the License provided in these\n    License Terms ceases. The sub-license further ceases in case the entity is no longer Your\n    affiliate. You are fully liable for any acts or omissions by any affiliates to which you provide a\n    sub-license as if they are your own. You must inform VGE immediately upon request of any\n    sub-licenses.\n\n2.3 No-Stand-Alone-Use. Unless explicitly permitted by VGE (e.g. in a Commercial Agreement),\n    the Software may only be used by You as part of the HyBid-SDK. For the avoidance of doubt,\n    the License allows You to merge the Software as part of the HyBid-SDK with the Digital\n    Properties.\n\n2.4 Modifications.\n    You have the right to modify the Software to the extent strictly required for the maintenance\n    or the reinstatement of the agreed functionality of the Software.\n\n2.5 Decompilation. You have the right to decompile the Software as permitted by mandatory law.\n\n2.6 Backup. You may create a backup copy of the Software for security purposes, provided You\n    affix a clear copyright notice as well as these License Terms to it. Any backup copy must be\n    deleted without undue delay after termination or expiry of the Commercial Agreement for\n    whatever reason or the revocation of the license by VGE.\n\n2.7 Termination. For the avoidance of doubt, VGE may at any time terminate the licenses granted\n    to Licensee either by individual communication (text form sufficient) or by providing a\n    publicly visible notice on the repository at which the Software is made available. In such a\n    case VGE shall grant Licensee a reasonable period (regularly 3 days) to remove the Software\n    from the Digital Properties. The License also ceases in case the Commercial Agreement is\n    terminated.\n\n3. Intellectual Property Rights. VGE and/or its licensors own all rights, title and interest in the\n    Software. The Software is protected by copyright, patent or ancillary copyright for the benefit\n    of VGE and/or its licensors. The Software is inter alia further protected by US Patent No. US\n    12105846 Any use of the Software other than permitted by these License Terms requires\n    prior written approval of VGE. VGE explicitly retains all other rights, in particular such to\n    trademarks, name or patents associated with VGE or the Software.\n\n4. Audit. VGE may, at its request and subject to a reasonable advance notice, verify Your\n    compliance with these License Terms. You will provide all relevant information,\n    documentation and records as may be reasonably required for VGE or any third-party auditor\n    appointed by VGE to verify Your compliance with these License Terms. VGE may carry out the\n    audit on the Your premises during Your regular business hours or have it carried out by third\n    parties bound to secrecy. VGE shall ensure that Your business operations are disrupted as\n    little as possible by its on-site activities. If the inspection reveals that the Software is being\n    used in any non-contractual manner, the costs of the inspection shall be borne by the\n    Licensee; otherwise, the costs shall be borne by VGE. All other rights reserved.\n\n5. Warranty and Liability\n\n    Except as stated otherwise in the Commercial Agreement, VGE's liability and warranty in\n    regard to the Software is limited or excluded as follows:\n\n5.1 Warranty. The Software is provided \"as is\" and \"as available\", without any warranties or\n    assurances of any kind, whether express, implied, or statutory, including but not limited to\n    warranties of merchantability, fitness for a particular purpose, title, non-infringement, or\n    accuracy. VGE expressly disclaims any warranties that the Software will meet the Licensee's\n    requirements, be uninterrupted, timely, secure, or error-free. VGE does not guarantee any\n    specific results from the use of the Software. The Licensee acknowledges that the Software\n    may not be suitable for their intended purposes and assumes all risks associated with its use.\n\n5.2 Liability and Indemnity.\n    (a) VGE is liable without limitation in cases of wilful misconduct or gross negligence, in\n        case a guarantee has been given by VGE, in cases of damage to life, body or health.\n        Unless Licensor has caused violations of key contractual obligations by gross\n        negligence or wilful misconduct, VGE’s liability is limited to the amount of typical and\n        foreseeable damages. Key contractual obligation means any obligation whose\n        fulfilment generally enables the proper execution of the contract, and on the orderly\n        discharge of which the contracting partner may regularly rely. Any further liability of\n        Licensor shall be excluded. Licensor’s liability in accordance with the German\n        Product Liability Act remains unaffected.\n    (b) The Parties agree that the damage regularly anticipated for an infringement of key\n        contractual obligations by VGE does not exceed EUR 10.000,00.\n    (c) Licensee shall indemnify and hold harmless VGE from any claims or damages based\n        on Licensee's use of the Software in violation of these License Terms.\n\n6. Final Provisions\n\n6.1 Governing Law and venue. These License Terms are governed exclusively by the laws of the\n    Federal Republic of Germany under exclusion of its conflict of law provisions and the UNCISG.\n    Place of jurisdiction for all disputes arising out of or in connection with these License Terms\n    shall be Hamburg, Germany.\n\n6.2 No side agreements. There are no verbal collateral agreements. Amendments or additions\n    to this contract must be made in writing, and this requirement cannot be waived orally.\n\n6.3 Severability. If individual provisions of this contract should be or become invalid, this shall\n    not affect the validity of the remaining provisions. The invalid provision shall be replaced by\n    what the parties would have reasonably agreed in accordance with the originally intended\n    purpose from an economic point of view. The same shall apply in the event of a loophole in\n    the contract.\n\n6.4 No assignment. Claims of Licensee against VGE under these License Terms may not be\n    assigned, pledged or encumbered with the rights of a third party unless VGE expressly agrees\n    to this.\n    \n"
  },
  "requires_arc": true,
  "authors": {
    "Orkhan Alizada": "orkhan.alizada@verve.com",
    "Juha Korhonen": "juha.korhonen@verve.com"
  },
  "platforms": {
    "ios": "12.0"
  },
  "source": {
    "http": "https://github.com/pubnative/atom/releases/download/3.6.0/ATOM.xcframework.zip"
  },
  "vendored_frameworks": "ATOM.xcframework"
}
