{
  "name": "HyBid",
  "version": "3.7.0-beta4",
  "summary": "This is the iOS SDK of HyBid. You can read more about it at https://pubnative.net.",
  "description": "HyBid leverages first-look prebid technology to maximize yield for the publishers across\ntheir current monetization suit. Access to the unique demand across different formats allows\npublishers to immediately benefit with additional revenues on top of their current yield. Prebid technology\nallows getting a competitive bid before executing your regular waterfall logic, and then\nparticipate in the relevant auctions in the cascade.",
  "homepage": "https://github.com/pubnative/pubnative-hybid-ios-sdk",
  "documentation_url": "https://developers.verve.com/v3.0/docs/hybid",
  "license": {
    "type": "Custom",
    "text": "    HyBid SDK License Terms (\"License Terms\")\n\nThese License Terms apply to the Software (as defined below) provided by Verve Group Europe\nGmbH, Karl-Liebknecht-Str. 32, 10178 Berlin (\"VGE\"). By downloading or using the Software, you\n(\"You\" or \"Licensee\") agree to be bound by these License Terms. Any use of the Software, other\nthan as authorised under these Licence Terms, is prohibited.\n\nPreamble\n\n(A) VGE offers certain sell-side monetisation solutions and tools for publishers of mobile\n    applications (\"Services\") and designed for execution on Android or Apple iOS operating\n    systems owned or operated by Licensee (\"Digital Properties\").\n\n(B) The Software (as defined below) is a prerequisite for making use of the Services.\n\n(C) The Services will be rendered under a separate commercial agreement (\"Commercial\n    Agreement\").\n\n1. Scope\n\n1.1 Software. These License Terms apply to the HyBid SDK software for Android or iOS\n    available under the URL https://github.com/pubnative/pubnative-hybid-android-sdk,\n    https://github.com/pubnative/pubnative-hybid-ios-sdk or any other URL designated by\n    VGE from version 3.6.0 onward or any such other successor version of the HyBid SDK,\n    including any and all programs, repositories, libraries, code, or other software\n    components, whether in source code or machine-readable code, including its\n    documentation as applicable, that are part of, referenced, or otherwise connected by VGE\n    to the HyBid SDK (the \"Software\"). These License Terms apply to the Software regardless\n    of the way in which it was obtained, whether by download, hard copy, e-mail, or any other\n    form of transmission.\n\n1.2 Exclusions. These License Terms do not apply to the ATOM software (current version\n    available under the URL https://github.com/pubnative/ATOM) and its functionalities, and\n    any other software or software component that is distributed under separate license\n    terms.\n\n2. License\n\n2.1 Commercial License. Subject to Your compliance with these License Terms and the\n    conclusion of a Commercial Agreement, VGE hereby grants You, for the term of the\n    Commercial Agreement, the non-exclusive, non-transferable, revocable, worldwide right\n    to (i) use and copy the Software, (ii) to merge, distribute and publish the Software solely\n    in conjunction with and as part of the Digital Properties (the \"License\"), Territorial\n    limitations contained in the Commercial Agreement will also apply to the License.\n\n2.2 Evaluation. Prior to conclusion of a Commercial Agreement, VGE hereby grants You the\n    right to download, copy and analyse the source code of the Software as may be made\n    available by VGE to (i) ascertain whether the Software is fit for Your purpose and (ii)\n    validate its functionality, and for no other purpose. You shall have no right to edit, modify,\n    amend, manipulate, create derivative works, commercially use exploit or make available\n    to third parties the Software under this permission. VGE may at any time revoke the\n    license granted under this Clause 2.2 and/or stop making the Source Code of the\n    Software available.\n\n2.3 Sub-License. The license provided under clause 2.1 is sub-licensable only to Your affiliates\n    and only to the extent that such affiliates are party to or may benefit from the Services\n    under a Commercial Agreement. Any such sub-license ceases if the License provided in\n    these License Terms ceases. The sub-license further ceases in case the entity is no longer\n    Your affiliate. You are fully liable for any acts or omissions by any affiliates to which you\n    provide a sub-license as if they are your own. You must inform VGE immediately upon\n    request of any sub-licenses.\n\n2.4 Modifications.\n\n    (a) You have the right to modify the Software to the extent strictly required for the\n        maintenance or the reinstatement of the agreed functionality of the Software.\n\n    (b) You may propose modifications to the Software if You believe these are\n        necessary to maintain, reinstate or improve the proper functionality of the\n        Software in conjunction with the Digital Properties (\"Modifications\") to VGE as a\n        pull request. VGE will carefully evaluate such request for modification and, in its\n        sole discretion, decide whether or not to incorporate such Modifications. If\n        Modifications are adopted, (i) You grant to VGE the unlimited, permanent,\n        royalty-free, transferable, sub-licensable, worldwide, exclusive and irrevocable\n        right for VGE to use, copy, publish, make available, sell, lease, rent, market,\n        distribute, modify and otherwise commercially exploit the Modifications in any\n        form and manner, whether now known or hereinafter devised, and (ii) the\n        License shall extend to the modified Software.\n\n2.5 Decompilation. You have the right to decompile the Software as permitted by mandatory\n    law.\n\n2.6 Backup. You may create a backup copy of the Software for security purposes, provided\n    You affix a clear copyright notice as well as these License Terms to it. Any backup copy\n    must be deleted without undue delay after termination or expiry of the Commercial\n    Agreement for whatever reason or the revocation of the license by VGE.\n\n2.7 Termination. For the avoidance of doubt, VGE may at any time terminate the licenses\n    granted to Licensee either by individual communication (text form sufficient) or by\n    providing a publicly visible notice on the repository at which the Software is made\n    available. In such a case VGE shall grant Licensee a reasonable period (regularly 3 days)\n    to remove the Software from the Digital Properties. The License also ceases in case the\n    Commercial Agreement is terminated.\n\n3. Intellectual Property Rights. VGE and/or its licensors own all rights, title and interest in\n    the Software. The Software is protected by copyright or ancillary copyright for the benefit\n    of VGE and/or its licensors. Any use of the Software other than permitted by these License\n    Terms requires prior written approval of VGE. VGE explicitly retains all other rights, in\n    particular such to trademarks, name or patents associated with VGE or the Software.\n\n4. Audit. VGE may, at its request and subject to a reasonable advance notice, verify Your\n    compliance with these License Terms. You will provide all relevant information,\n    documentation and records as may be reasonably required for VGE or any third-party\n    auditor appointed by VGE to verify Your compliance with these License Terms. VGE may\n    carry out the audit on the Your premises during Your regular business hours or have it\n    carried out by third parties bound to secrecy. VGE shall ensure that Your business\n    operations are disrupted as little as possible by its on-site activities. If the inspection\n    reveals that the Software is being used in any non-contractual manner, the costs of the\n    inspection shall be borne by the Licensee; otherwise, the costs shall be borne by VGE. All\n    other rights reserved.\n\n5. Warranty and Liability\n\nExcept as stated otherwise in the Commercial Agreement, VGE's liability and warranty in\nregard to the Software is limited or excluded as follows:\n\n5.1 Warranty. The Software is provided \"as is\" and \"as available\", without any warranties or\n    assurances of any kind, whether express, implied, or statutory, including but not limited\n    to warranties of merchantability, fitness for a particular purpose, title, non-infringement,\n    or accuracy. VGE expressly disclaims any warranties that the Software will meet the\n    Licensee's requirements, be uninterrupted, timely, secure, or error-free. VGE does not\n    guarantee any specific results from the use of the Software. The Licensee acknowledges\n    that the Software may not be suitable for their intended purposes and assumes all risks\n    associated with its use.\n\n5.2 Liability and Indemnity.\n    \n    (a) VGE is liable without limitation in cases of wilful misconduct or gross negligence,\n        in case a guarantee has been given by VGE, in cases of damage to life, body or\n        health. Unless Licensor has caused violations of key contractual obligations by\n        gross negligence or wilful misconduct, VGE’s liability is limited to the amount of\n        typical and foreseeable damages. Key contractual obligation means any\n        obligation whose fulfilment generally enables the proper execution of the\n        contract, and on the orderly discharge of which the contracting partner may\n        regularly rely. Any further liability of Licensor shall be excluded. Licensor’s\n        liability in accordance with the German Product Liability Act remains unaffected.\n\n    (b) The Parties agree that the damage regularly anticipated for an infringement of\n        key contractual obligations by VGE does not exceed EUR 10.000,00.\n\n    (c) Licensee shall indemnify and hold harmless VGE from any claims or damages\n        based on Licensee's use of the Software in violation of these License Terms.\n\n6. Final Provisions\n\n6.1 Governing Law and venue. These License Terms are governed exclusively by the laws of\n    the Federal Republic of Germany under exclusion of its conflict of law provisions and the\n    UNCISG. Place of jurisdiction for all disputes arising out of or in connection with these\n    License Terms shall be Hamburg, Germany.\n\n6.2 No side agreements. There are no verbal collateral agreements. Amendments or\n    additions to this contract must be made in writing, and this requirement cannot be\n    waived orally.\n\n6.3 Severability. If individual provisions of this contract should be or become invalid, this shall\n    not affect the validity of the remaining provisions. The invalid provision shall be replaced\n    by what the parties would have reasonably agreed in accordance with the originally\n    intended purpose from an economic point of view. The same shall apply in the event of a\n    loophole in the contract.\n\n6.4 No assignment. Claims of Licensee against VGE under these License Terms may not be\n    assigned, pledged or encumbered with the rights of a third party unless VGE expressly\n    agrees to this.\n"
  },
  "authors": {
    "Can Soykarafakili": "can.soykarafakili@pubnative.net",
    "Eros Garcia Ponte": "eros.ponte@pubnative.net",
    "Fares Benhamouda": "fares.benhamouda@pubnative.net",
    "Orkhan Alizada": "orkhan.alizada@pubnative.net",
    "Jose Contreras": "jose.contreras@verve.com",
    "Aysel Abdullayeva": "aysel.abdullayeva@verve.com"
  },
  "platforms": {
    "ios": "12.0"
  },
  "source": {
    "git": "https://github.com/pubnative/pubnative-hybid-ios-sdk.git",
    "tag": "3.7.0-beta4"
  },
  "resource_bundles": {
    "HyBidResources": "PubnativeLite/PubnativeLite/PrivacyInfo.xcprivacy"
  },
  "xcconfig": {
    "OTHER_LDFLAGS": "-framework OMSDK_Pubnativenet"
  },
  "swift_versions": "5.0",
  "pod_target_xcconfig": {
    "OTHER_SWIFT_FLAGS": "-Xcc -Wno-incomplete-umbrella"
  },
  "default_subspecs": [
    "Core",
    "Banner",
    "Native",
    "FullScreen",
    "RewardedVideo",
    "ATOM"
  ],
  "subspecs": [
    {
      "name": "Core",
      "source_files": "PubnativeLite/PubnativeLite/Core/**/*.{swift,h,m}",
      "resources": [
        "PubnativeLite/PubnativeLite/Resources/**/*",
        "PubnativeLite/PubnativeLite/OMSDK-1.5.4/*.js",
        "PubnativeLite/PubnativeLite/Core/MRAID/*.js"
      ],
      "exclude_files": "PubnativeLite/PubnativeLite/Core/Public/HyBidStatic.{swift,h,m}",
      "vendored_frameworks": [
        "PubnativeLite/PubnativeLite/OMSDK-1.5.4/*.{xcframework}"
      ],
      "pod_target_xcconfig": {
        "HEADER_SEARCH_PATHS": "$(PODS_ROOT)/HyBid/module"
      },
      "xcconfig": {
        "HEADER_SEARCH_PATHS": "$(SDKROOT)/usr/include/libxml2 $(PODS_ROOT)/HyBid/module"
      },
      "public_header_files": [
        "PubnativeLite/PubnativeLite/Core/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Viewability/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Consent/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Ad Model/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Ad Request/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Ad Cache/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Ad Presenter/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/MRAID/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Remote Config/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Auction/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Utils/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/VAST/Public/*.h",
        "PubnativeLite/PubnativeLite/Core/Analytics/Public/*.h"
      ]
    },
    {
      "name": "Banner",
      "dependencies": {
        "HyBid/Core": [

        ]
      },
      "source_files": [
        "PubnativeLite/PubnativeLite/Banner/**/*.{swift,h,m}"
      ],
      "public_header_files": [
        "PubnativeLite/PubnativeLite/Banner/**/*.h"
      ]
    },
    {
      "name": "Native",
      "dependencies": {
        "HyBid/Core": [

        ]
      },
      "source_files": [
        "PubnativeLite/PubnativeLite/Native/**/*.{swift,h,m}"
      ],
      "public_header_files": [
        "PubnativeLite/PubnativeLite/Native/**/*.h"
      ]
    },
    {
      "name": "FullScreen",
      "dependencies": {
        "HyBid/Core": [

        ]
      },
      "source_files": [
        "PubnativeLite/PubnativeLite/FullScreen/**/*.{swift,h,m}"
      ],
      "public_header_files": [
        "PubnativeLite/PubnativeLite/FullScreen/Public/*.h"
      ]
    },
    {
      "name": "RewardedVideo",
      "dependencies": {
        "HyBid/Core": [

        ]
      },
      "source_files": [
        "PubnativeLite/PubnativeLite/Rewarded/**/*.{swift,h,m}"
      ],
      "public_header_files": [
        "PubnativeLite/PubnativeLite/Rewarded/Public/*.h"
      ]
    },
    {
      "name": "ATOM",
      "dependencies": {
        "HyBid/Core": [

        ],
        "ATOM-Standalone": [

        ]
      }
    }
  ],
  "swift_version": "5.0"
}
