{
  "name": "GoConnector",
  "version": "3.3.13",
  "summary": "Provides an api for integrating with a Go device for taking card payments via Swipe, EMV dip, NFC Contactless",
  "description": "The Go Connector SDK currently supports the following payment transactions:\n*Sale* - A transaction used to authorize and capture the payment amount in at the same time. A Sale transaction is final and the amount cannot be adjusted. \n*Auth* - A transaction that can be tip-adjusted until it is finalized during a batch closeout. This is a standard model for a restaurant that adjusts the amount to include a tip after a card is charged.  \n*Void* - A transaction that cancels or fully reverses a payment transaction. \n*Refund* - A transaction that credits funds to the account holder.  \n*PreAuth* - A pre-authorization for a certain amount. \n*PreAuth Capture* - A Pre-Auth that has been finalized in order to complete a payment (i.e., a bar tab that has been closed out).   \n*Partial Auth* - A partial authorization. The payment gateway may return a partial authorization if the transaction amount exceeds the customer’s credit or debit card limit.  \n*Tip Adjust* - A transaction in which a merchant takes or edits a tip after the customer’s card has been processed (i.e., after the initial Auth transaction).",
  "homepage": "https://www.clover.com/get-paid/go",
  "license": {
    "type": "Custom",
    "file": "LICENSE"
  },
  "authors": {
    "Clover Go": "clovergodev@gmail.com"
  },
  "source": {
    "git": "https://github.com/clover/remote-pay-ios-go.git",
    "tag": "3.3.13"
  },
  "pod_target_xcconfig": {
    "SWIFT_VERSION": "5.0",
    "VALID_ARCHS": "arm64 armv7 x86_64"
  },
  "platforms": {
    "ios": "10.0"
  },
  "swift_versions": "5.0",
  "source_files": "CloverConnector/Classes/**/*.swift",
  "xcconfig": {
    "HEADER_SEARCH_PATHS": "$(PODS_ROOT)/CloverGoSDK"
  },
  "frameworks": "Foundation",
  "dependencies": {
    "ObjectMapper": [
      "3.3"
    ],
    "Starscream": [
      "3.1.0"
    ],
    "SwiftyJSON": [
      "5.0.0"
    ],
    "CloverGoSDK": [
      "3.3.30"
    ]
  },
  "swift_version": "5.0"
}
