{
  "name": "TSUIKit",
  "version": "0.1",
  "summary": "UI components for iOS.",
  "description": "\nSet of extended UI components for iOS. Includes:\n\n## TSTableView\n\n`TSTableView` is UI component for displaying multi columns tabular data with support of hierarchical rows and columns structure.\nIt provides smooth animations for item selection and dynamic content modification.\n\n* Suport muti columns data structure.\n* Support hierarchical column definition (i.e. column may have subsections).\n* Support hierarchical row definition (i.e. row may have expand subrows).\n* Optimized to display big sets of data: row and cell views are cached internally and reused during scrolling.\n* Support row and column selection.\n* Allow modification of column width by sliding column border.\n* Allow expand/collapse subrows content.\n* Support simple declarative syntax for columns and rows content definition.\n* Providing your own implementation of TSTableViewDataSource protocol will allow you fully customise structure and appearance of the table.\n* Default TSTableViewModel implements TSTableViewDataSource protocol and includes two built in styles (see screenshots).\n\n## TSTabView\n\n`TSTabView` is UI component that allows to flip left and right through pages of data. TSNavigationStripView control is used to display available pages titles/tabs and navigate between them. Custom TSNavigationStripView entity should be provided to TSTabView during initialisation. Some features are listed below:\n\n* Navigates through set of UIView or UIViewController objects.\n* Support far jumps between pages.\n* Tabs list in TSNavigationStripView support different types of layout and alignment, including: alignment to left side, alignment to right side, autofill available space, central alignment (which imitate behaviour of ViewPager component on Android).\n* Tabs list in TSNavigationStripView can be scrollable.\n* TSNavigationStripView can display additional menu items on left or right sides.\n* TSNavigationStripView provide great flexibility for appearance  customisation.\n* All view transitions are down with smooth animations.\n\n## TSNavigationStripView\n\n`TSNavigationStripView` is a navigation menu control with highly customizable design and flexible structure.\n\n* Display set of section titles (tabs).\n* Select section (tab) from list.\n* Scroll between sections (tabs).\n* Left and right navigation buttons on sides.\n* Fully customized appearance (see examples).\n* Support different types of layout and alignment: alignment to left side, alignment to right side, autofill available space, central alignment (which imitate behaviour of ViewPager component on Android).\n* Additinal not scrolled menu items can be added on left and right sides.\n\n",
  "homepage": "https://github.com/Viacheslav-Radchenko/TSUIKit",
  "screenshots": [
    "https://github.com/Viacheslav-Radchenko/TSUIKit/blob/master/Screenshots/TSNavigationStripView_Screenshot1.jpg",
    "https://github.com/Viacheslav-Radchenko/TSUIKit/blob/master/Screenshots/TSTabView_Screenshot1.jpg",
    "https://github.com/Viacheslav-Radchenko/TSUIKit/blob/master/Screenshots/TSTableView_Screenshot4.png"
  ],
  "license": {
    "type": "MIT",
    "file": "Classes/LICENSE"
  },
  "authors": {
    "Viacheslav-Radchenko": "viacheslav.radchenko@gmail.com"
  },
  "platforms": {
    "ios": "5.0"
  },
  "source": {
    "git": "https://github.com/Viacheslav-Radchenko/TSUIKit.git",
    "tag": "0.1"
  },
  "source_files": [
    "Classes",
    "Classes/**/*.{h,m}"
  ],
  "frameworks": "QuartzCore",
  "requires_arc": true
}
