{
  "name": "RFAboutView-Swift",
  "version": "1.0.6",
  "summary": "A drop-in 'about view' offering information about an app, the pods used and diagnostic debug information.",
  "description": "**RFAboutView** is an easy, drop-in solution to display copyright, support, privacy and other information while also automatically crediting the developers of third-party Cocoapods. RFAboutView uses AutoLayout and can be used both for iPhone and iPad apps.\n\nIts main features are:\n\n* Displays app name and copyright information.\n* Displays an optional link to a website, opening in Safari.\n* Displays an optional link to an Email address.\n* If the user clicks on the Email link, a `MFMailComposeViewController` opens, (optionally) pre-filled with diagnostic information useful for support: App name and version, current device, current iOS version, preferred device language.\n* Displays additional buttons with further information (for example your TOS or Privacy Policy) that you can specify.\n* Displays acknowledgements for all Cocoapods used in the project. The acknowledgements file automatically created by Cocoapods is used for this, requiring almost no work on your part. See the \"Automatic acknowledgements\" below for more information.\n* Clean and modern design with lots of customisation options.",
  "homepage": "https://github.com/fouquet/RFAboutView-Swift",
  "screenshots": [
    "https://www.fouquet.me/RFAboutView/screenshot1.png",
    "https://www.fouquet.me/RFAboutView/screenshot2.png",
    "https://www.fouquet.me/RFAboutView/screenshot3.png"
  ],
  "license": "MIT",
  "authors": {
    "René Fouquet": "mail@fouquet.me"
  },
  "source": {
    "git": "https://github.com/fouquet/RFAboutView-Swift.git",
    "tag": "1.0.6"
  },
  "social_media_url": "https://twitter.com/renefouquet",
  "platforms": {
    "ios": "8.0"
  },
  "requires_arc": true,
  "source_files": "Pod/Classes/**/*",
  "resource_bundles": {
    "RFAboutView_Swift": [
      "Pod/Assets/*.png"
    ]
  }
}
