{
  "name": "KSFramework",
  "version": "1.0",
  "summary": "An iOS framework containing helpful classes and categories.",
  "description": "An iOS framework where each component can be used without including the entire KSFramework.\n\n*KSImageAdditions*\n\nThis controller adds several useful categories to add image processing functionality to UIView, UIScrollView, and UIImage.\n\n*KSInactiveImageView*\n\nThis control acts as a UIImageView, but with the added ability to make an image appear inactive through the use of tinting, scaling, and blurring.\n\nOne potential use is locating the KSInactiveImageView in place of a view and passing in a screenshot. The screenshot can then be manipulated to make view appear inactive.\n\n*KSSlideController*\n\nThis controller allows the use of slide in view controllers on both sides of the screen. This functionality was originally seen in apps such as Facebook for presenting a menu. However, KSSlideController is not restricted to just menus. Through the use of configurable properties, a broad range of implementations can be created.\n\n*KSPullDownController*\n\nThis controller allows the use of a view controller to be pulled down do display another view controller. It can be used to create something as simple as a “pull-to-refresh” controller. However, it can also be used to present other views such as menus. Through the use of configurable properties, a broad range of implementations can be created.\n\n*KSViewShadow*\n\nThis controller adds a configurable shadow to any view that is passed to it.",
  "homepage": "https://github.com/kickstandapps/KSFramework",
  "license": "BSD",
  "authors": {
    "Kickstand Apps": "developer@kickstandapps.com"
  },
  "platforms": {
    "ios": "6.0"
  },
  "source": {
    "git": "https://github.com/kickstandapps/KSFramework.git",
    "tag": "1.0"
  },
  "requires_arc": true,
  "subspecs": [
    {
      "name": "KSImageAdditions",
      "source_files": "KSImageAdditions/*.{h,m}",
      "frameworks": [
        "Accelerate",
        "QuartzCore"
      ]
    },
    {
      "name": "KSInactiveImageView",
      "source_files": "KSInactiveImageView/*.{h,m}",
      "dependencies": {
        "KSFramework/KSImageAdditions": [

        ]
      }
    },
    {
      "name": "KSViewShadow",
      "source_files": "KSViewShadow/*.{h,m}",
      "frameworks": "QuartzCore"
    },
    {
      "name": "KSSlideController",
      "source_files": "KSSlideController/*.{h,m}",
      "dependencies": {
        "KSFramework/KSInactiveImageView": [

        ],
        "KSFramework/KSViewShadow": [

        ]
      }
    },
    {
      "name": "KSPullDownController",
      "source_files": "KSPullDownController/*.{h,m}"
    }
  ]
}
