{
  "name": "FBSDKTVOSKit",
  "version": "12.3.0",
  "summary": "Official Facebook SDK for tvOS to access Facebook Platform with features like Login and Graph API.",
  "description": "The Facebook SDK for tvOS Kit framework provides Facebook Login with a confirmation code\nto easily sign in users on Apple TV without using the remote.\nSee FBSDKCoreKit for additional functionality like Analytics and Graph API.",
  "homepage": "https://developers.facebook.com/docs/tvos",
  "license": {
    "type": "Facebook Platform License",
    "text": "    Copyright (c) Meta Platforms, Inc. and affiliates. All rights reserved.\n\n    You are hereby granted a non-exclusive, worldwide, royalty-free license to use,\n    copy, modify, and distribute this software in source code or binary form for use\n    in connection with the web services and APIs provided by Facebook.\n\n    As with any software that integrates with the Facebook platform, your use of\n    this software is subject to the Facebook Platform Policy\n    [http://developers.facebook.com/policy/]. This copyright notice shall be\n    included in all copies or substantial portions of the software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n    FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n    COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n    IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n    CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
  },
  "authors": "Facebook",
  "platforms": {
    "tvos": "10.0"
  },
  "swift_versions": "5.0",
  "source": {
    "http": "https://github.com/facebook/facebook-ios-sdk/releases/download/v12.3.0/FacebookSDK_Dynamic.xcframework.zip"
  },
  "vendored_frameworks": "XCFrameworks/FBSDKTVOSKit.xcframework",
  "dependencies": {
    "FBSDKCoreKit_Basics": [
      "12.3.0"
    ],
    "FBSDKCoreKit": [
      "12.3.0"
    ],
    "FBSDKShareKit": [
      "12.3.0"
    ],
    "FBSDKLoginKit": [
      "12.3.0"
    ]
  },
  "swift_version": "5.0"
}
