{
  "name": "ReveChatSDK",
  "version": "3.0.2.9",
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "summary": "REVE Chat has come up with live chat SDK for iOS mobile apps",
  "description": "Integrate it with your mobile app to offer live chat assistance to customers. REVE Chat SDK seamlessly integrates and enables your support team to send and receive messages in your mobile application.You can now call or video chat with your customers to provide them a better service.",
  "homepage": "https://www.revechat.com/",
  "authors": {
    "Reve Chat": "amit@revesoft.com"
  },
  "license": {
    "type": "MIT",
    "text": "This project is licensed under the MIT license.\n\nCopyright (c) 2018 Reve Chat\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE."
  },
  "platforms": {
    "ios": "10.0"
  },
  "source": {
    "http": "https://static.revechat.com/sdk/ios/ReveChatSDK_3.0.2.9.framework.zip"
  },
  "resource_bundles": {
    "ReveChatSDKResources": [
      "ReveChatSDK.framework/SDKResources.bundle/**/*"
    ]
  },
  "ios": {
    "vendored_frameworks": "ReveChatSDK.framework"
  },
  "dependencies": {
    "SocketRocket": [

    ],
    "AFNetworking": [

    ],
    "GoogleWebRTC": [

    ]
  }
}
