{
  "name": "TouchJSON",
  "version": "1.1",
  "summary": "A humane JSON Objective-C un-framework. (TouchJSON has been deprecated - see README).",
  "homepage": "https://github.com/touchcode/",
  "license": {
    "type": "Simplified BSD License",
    "text": "        This code is licensed under the 2-clause BSD license (\"Simplified BSD License\" or \"FreeBSD License\")\n        license. The license is reproduced below:\n\n        Copyright 2011 Jonathan Wight. All rights reserved.\n\n        Redistribution and use in source and binary forms, with or without modification, are\n        permitted provided that the following conditions are met:\n\n           1. Redistributions of source code must retain the above copyright notice, this list of\n              conditions and the following disclaimer.\n\n           2. Redistributions in binary form must reproduce the above copyright notice, this list\n              of conditions and the following disclaimer in the documentation and/or other materials\n              provided with the distribution.\n\n        THIS SOFTWARE IS PROVIDED BY JONATHAN WIGHT ''AS IS'' AND ANY EXPRESS OR IMPLIED\n        WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n        FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL JONATHAN WIGHT OR\n        CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n        CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n        SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\n        ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n        NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\n        ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n        The views and conclusions contained in the software and documentation are those of the\n        authors and should not be interpreted as representing official policies, either expressed\n        or implied, of Jonathan Wight.\n"
  },
  "authors": {
    "Jonathan Wight": "schwa@toxicsoftware.com"
  },
  "source": {
    "git": "https://github.com/TouchCode/TouchJSON.git",
    "tag": "1.1"
  },
  "source_files": "Source/**/*.{h,m}",
  "frameworks": "Foundation",
  "requires_arc": true
}
