{
  "name": "ClickioConsentSDKManager",
  "module_name": "ClickioConsentSDKManager",
  "version": "1.0.5-rc",
  "summary": "Native SDK for managing user consents, integrating a WebView-based consent dialog into iOS apps for streamlined privacy compliance.",
  "description": "ClickioConsentSDK is a robust privacy-focused toolkit designed to simplify GDPR, CCPA, and global compliance for iOS apps. It features a fully customizable WebView-based consent dialog that seamlessly integrates with your app's UI while dynamically adapting to regional regulations. Key capabilities include:\n\n* ATT-CMP Flow Orchestration: Optional App Tracking Transparency (ATT) pre-permission prompts with logic to conditionally display consent dialogs based on user choices.\n* Real-Time Compliance: Automatic updates for consent texts/purposes via centralized configurations without app store resubmissions.\n* Granular Control: Capture user preferences for ads, analytics, and data sharing with purpose/VendorID-level consent tracking.\n* Cross-Platform Sync: Export standardized TC/AC Strings and Google Consent Mode signals for backend/services alignment.\n* Developer-Centric: Objective-C, SwiftUI, UIKit support and extensible web-to-native communication layer.\n\nIdeal for apps requiring scalable privacy management with minimal code footprint, ensuring audit-ready compliance across jurisdictions.'",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "Clickio": "app-dev@clickio.com"
  },
  "homepage": "https://clickio.com/",
  "platforms": {
    "ios": "15.0"
  },
  "source": {
    "git": "https://github.com/ClickioTech/ClickioConsentSDK-IOS.git",
    "tag": "1.0.5-rc"
  },
  "source_files": [
    "Sources/**/*.swift"
  ],
  "frameworks": [
    "WebKit",
    "UIKit",
    "Foundation"
  ],
  "weak_frameworks": [
    "AppTrackingTransparency",
    "Combine"
  ],
  "swift_versions": "5.0",
  "pod_target_xcconfig": {
    "CODE_SIGNING_REQUIRED": "NO",
    "CODE_SIGNING_ALLOWED": "NO",
    "EXPANDED_CODE_SIGN_IDENTITY": "",
    "ENABLE_USER_SCRIPT_SANDBOXING": "NO"
  },
  "user_target_xcconfig": {
    "ENABLE_USER_SCRIPT_SANDBOXING": "NO"
  },
  "swift_version": "5.0"
}
