{
  "name": "Kingfisher",
  "version": "2.0.2",
  "summary": "A lightweight and pure Swift implemented library for downloading and cacheing image from the web.",
  "description": "Kingfisher is a lightweight and pure Swift implemented library for downloading and cacheing image from the web. It provides you a chance to use pure Swift alternation in your next app.\n\n* Everything in Kingfisher goes asynchronously, not only downloading, but also caching. That means you can never worry about blocking your UI thread.\n* Multiple-layer cache. Downloaded image will be cached in both memory and disk. So there is no need to download it again and this could boost your app dramatically.\n* Cache management. You can set the max duration or size the cache could take. And the cache will also be cleaned automatically to prevent taking too much resource.\n* Modern framework. Kingfisher uses `NSURLSession` and the latest technology of GCD, which makes it a strong and swift framework. It also provides you easy APIs to use.\n* Cancellable processing task. You can cancel the downloading or retriving image process if it is not needed anymore.\n* Independent components. You can use the downloader or caching system separately. Or even create your own cache based on Kingfisher's code.\n* Options to decompress the image in background before render it, which could improve the UI performance.\n* A category over `UIImageView` for setting image from an url directly.",
  "homepage": "https://github.com/onevcat/Kingfisher",
  "screenshots": "https://raw.githubusercontent.com/onevcat/Kingfisher/master/images/logo.png",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "onevcat": "onevcat@gmail.com"
  },
  "social_media_url": "http://twitter.com/onevcat",
  "platforms": {
    "ios": "8.0",
    "tvos": "9.0",
    "osx": "10.10",
    "watchos": "2.0"
  },
  "source": {
    "git": "https://github.com/onevcat/Kingfisher.git",
    "tag": "2.0.2"
  },
  "source_files": [
    "Sources/*.swift",
    "Sources/Kingfisher.h"
  ],
  "public_header_files": [
    "Sources/Kingfisher.h"
  ],
  "osx": {
    "exclude_files": "Sources/UIButton+Kingfisher.swift"
  },
  "watchos": {
    "exclude_files": [
      "Sources/UIButton+Kingfisher.swift",
      "Sources/ImageView+Kingfisher.swift"
    ]
  },
  "requires_arc": true,
  "frameworks": "CFNetwork"
}
