{
  "name": "Azetone",
  "version": "4.1.8",
  "summary": "Azetone UX Analytics, A/B Testing and Personalization for iOS",
  "description": "Azetone: Next generation Mobile UX Analytics, A/B Testing and Personalization\nWhat makes Azetone so unique? Because it is built from the ground-up for Mobile Apps, we chose the best architecture possible, we build on the latest mobile technologies for best performance and reliability and we tightly integrate with your key third party mobile and CRM solutions.\nThe result? A world-class Mobile UX Analytics, A/B Testing and Personalization solution that:\n- Leverages our integrated UX Analytics, delivering unique insights on how user interact with your App and pointing at where to setup your A/B tests\n- Offers marketers the easiest solution to make visual changes in your App in real time with no code tinkering and no App Store re-submission\n- Gives advanced users and developers the ability to go deep into the App and activate or deactivate code blocks or entire features of an App.\n- Delivers the best conversion improvements by leveraging existing customer segments from your CRM or Push Notification platforms\n- Provides breakthrough personalization capabilities to transform your static native code into a dynamic App that instantly adapts your entire user experience based on user context and profile.",
  "homepage": "http://www.azetone.com",
  "screenshots": [
    "https://www.azetone.com/wp-content/img/abtesting/azetone-abtesting.png",
    "https://www.azetone.com/wp-content/img/heatmaps/profile-user-mobile-heatmaps.png"
  ],
  "license": {
    "type": "Commercial",
    "text": "Azetone: Copyright 2016 Azetone. All Rights Reserved. Use of this software is subject to the terms and conditions of the Azetone Software and Services Agreement located at http://www.azetone.com/azetone-terms-of-service.html"
  },
  "authors": {
    "Azetone": "welcome@azetone.com"
  },
  "social_media_url": "https://twitter.com/azetonemobile",
  "documentation_url": "http://docs.azetone.com/index",
  "platforms": {
    "ios": "7.0"
  },
  "requires_arc": true,
  "libraries": "sqlite3",
  "source": {
    "git": "https://github.com/azetone/ios_sdk_pod.git",
    "tag": "4.1.8"
  },
  "vendored_frameworks": "Azetone/Azetone.framework"
}
