{
  "name": "TemplateEditor",
  "version": "1.1.6",
  "summary": "A TemplateEditor pod is very useful for developer that want to create app which generate templates so this can make there work hassle free.",
  "description": "TemplateEditor is a flexible and customizable iOS framework that allows developers to integrate a powerful template editor into their apps. With TemplateEditor, users can create, edit, and customize various templates by adding and adjusting images, text, and other UI elements in real-time. It supports a wide range of template styles and offers easy integration into existing projects.\n\nThe library includes features such as drag-and-drop functionality, interactive design components, and live preview, making it ideal for apps that require customizable templates such as menu creators, design tools, and other creative applications.\n\nTemplateEditor is designed to be lightweight, intuitive, and extensible, allowing for seamless integration with other libraries and providing full control over the UI components for customization. The framework comes with built-in support for handling image assets, dynamic text elements, and other components, ensuring that your app can handle complex template editing workflows with ease.\n\nKey Features:\n- Drag-and-drop interface for adding images, text, and elements.\n- Support for various template styles with customizable layouts.\n- Intuitive UI for real-time template editing.\n- Easy integration with existing projects.\n- Extensible and customizable components.\n- Built-in image handling and dynamic text support.\n\nThis pod is perfect for developers who need a template editing solution within their iOS apps, providing all the tools necessary to create a personalized and interactive design experience for their users.",
  "homepage": "https://github.com/talaakash/TemplateEditor",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "talaakash": "akasht.noble@gmail.com"
  },
  "source": {
    "git": "https://github.com/talaakash/TemplateEditor.git",
    "tag": "1.1.6"
  },
  "platforms": {
    "ios": "15.0"
  },
  "swift_versions": "5.0",
  "source_files": "Sources/**/*.{swift,xib,storyboard}",
  "resources": [
    "Sources/**/*.xcassets"
  ],
  "frameworks": "UIKit",
  "dependencies": {
    "Kingfisher": [

    ]
  },
  "resource_bundles": {
    "Views": [
      "Sources/Views/*.{swift, Xib}"
    ],
    "Resources": [
      "Sources/Resources/*.{xcassets, swift}"
    ],
    "HelperClass": [
      "Sources/HelperClass/*.swift"
    ],
    "Libraries": [
      "Sources/Libraries/**/*.{swift, xib}"
    ],
    "Xibs": [
      "Sources/Xibs/**/*.{swift, xib}"
    ],
    "CustomViews": [
      "Sources/CustomViews/*.swift"
    ],
    "Menues": [
      "Sources/Menues/**/*.{swift, xib}"
    ],
    "Models": [
      "Sources/Models/*.swift"
    ],
    "StoryBoard": [
      "Sources/StoryBoard/*.storyboard"
    ],
    "Controllers": [
      "Sources/Controllers/*.swift",
      "Sources/Controllers/**/*.swift"
    ],
    "Extensions": [
      "Sources/Extensions/*.swift"
    ],
    "TemplateEditor": [
      "Sources/*.swift"
    ]
  },
  "swift_version": "5.0"
}
