{
  "name": "Astro",
  "version": "1.0.0",
  "summary": "A RoboPod containing a small collection of utilities for project reuse",
  "homepage": "https://RobotsAndPencils.com",
  "license": {
    "type": "MIT",
    "text": "Copyright (c) 2015 Robots and Pencils, Inc. All rights reserved.\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\nNeither the name of the Robots and Pencils, Inc. nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. \nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
  },
  "authors": {
    "Chad Sykes": "Chad.Sykes@RobotsAndPencils.com",
    "Colin Gislason": "Colin.Gislason@RobotsAndPencils.com",
    "Dominic Pepin": "Dominic.Pepin@RobotsAndPencils.com",
    "Michael Beaureguard": "Michael.Beauregard@RobotsAndPencils.com"
  },
  "source": {
    "git": "https://github.com/RobotsAndPencils/Astro.git",
    "tag": "1.0.0"
  },
  "platforms": {
    "ios": "8.0"
  },
  "requires_arc": true,
  "subspecs": [
    {
      "name": "Logging",
      "source_files": "Astro/Logging/**/*.swift"
    },
    {
      "name": "Networking",
      "source_files": "Astro/Networking/**/*.swift",
      "dependencies": {
        "Astro/Logging": [

        ],
        "Alamofire": [
          "~> 3.3"
        ],
        "Freddy": [
          "~> 2.0"
        ],
        "SwiftTask": [
          "5.0"
        ]
      }
    },
    {
      "name": "Security",
      "source_files": "Astro/Security/**/*.swift",
      "dependencies": {
        "Astro/Logging": [

        ]
      }
    },
    {
      "name": "UI",
      "source_files": "Astro/UI/**/*.swift",
      "frameworks": "UIKit"
    },
    {
      "name": "Utils",
      "source_files": "Astro/Utils/**/*.swift"
    }
  ]
}
