{
  "name": "PayPalCheckout",
  "version": "0.70.0",
  "summary": "PayPal iOS Native Checkout SDK",
  "homepage": "https://github.com/paypal/paypalcheckout-ios",
  "authors": {
    "PayPal": "jonathajones@paypal.com"
  },
  "platforms": {
    "ios": "11.0"
  },
  "swift_versions": "5.0",
  "source": {
    "http": "https://github.com/paypal/paypalcheckout-ios/releases/download/0.70.0/PayPalCheckout.xcframework.zip"
  },
  "ios": {
    "vendored_frameworks": "PayPalCheckout.xcframework"
  },
  "license": {
    "type": "PAYPAL",
    "text": "      SDK LICENSE\n\n      Copyright Â© 2013 - 2017 PayPal Holdings, Inc.\n\n      NOTICE TO USER: PayPal Holdings, Inc. is providing the Software and\n      Documentation for use under the terms of this Agreement. Any use, reproduction,\n      modification or distribution of the Software or Documentation, or any\n      derivatives or portions hereof, constitutes your acceptance of this Agreement.\n\n      As used in this Agreement, \"PayPal\" means PayPal Holdings, Inc., \"Software\"\n      means the software code accompanying this agreement. \"Documentation\" means the\n      documents, specifications and all other items accompanying this Agreement other\n      than the Software.\n\n      1. LICENSE GRANT\n      Subject to the terms of this Agreement, PayPal hereby grants you a\n      non-exclusive, worldwide, royalty-free license to use, reproduce, prepare\n      derivative works from, publicly display, publicly perform, distribute and\n      sublicense the Software for any purpose, provided the copyright notice below\n      appears in a conspicuous location within the source code of the distributed\n      Software and this license is distributed in the supporting documentation of the\n      Software you distribute. Furthermore, you must comply with all third party\n      licenses in order to use the third party software contained in the Software.\n\n      Subject to the terms of this Agreement, PayPal hereby grants you a\n      non-exclusive, worldwide, royalty-free license to use, reproduce, publicly\n      display, publicly perform, distribute and sublicense the Documentation for any\n      purpose. You may not modify the Documentation.\n\n      No title to the intellectual property in the Software or Documentation is\n      transferred to you under the terms of this Agreement. You do not acquire any\n      rights to the Software or the Documentation except as expressly set forth in\n      this Agreement.\n\n      If you choose to distribute the Software in a commercial product, you do so\n      with the understanding that you agree to defend, indemnify and hold harmless\n      PayPal and its suppliers against any losses, damages and costs arising from the\n      claims, lawsuits or other legal actions arising out of such distribution. You\n      may distribute the Software in object code form under your own license,\n      provided that your license agreement:\n\n      (a) complies with the terms and conditions of this license agreement;\n\n      (b) effectively disclaims all warranties and conditions, express or implied, on\n      behalf of PayPal;\n\n      (c) effectively excludes all liability for damages on behalf of PayPal;\n\n      (d) states that any provisions that differ from this Agreement are offered by\n      you alone and not PayPal; and\n\n      (e) states that the Software is available from you or PayPal and informs\n      licensees how to obtain it in a reasonable manner on or through a medium\n      customarily used for software exchange.\n\n      1. DISCLAIMER OF WARRANTY\n      PAYPAL LICENSES THE SOFTWARE AND DOCUMENTATION TO YOU ONLY ON AN \"AS IS\" BASIS\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED,\n      INCLUDING WITHOUT LIMITATION ANY WARRANTIES OR CONDITIONS OF TITLE,\n      NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. PAYPAL\n      MAKES NO WARRANTY THAT THE SOFTWARE OR DOCUMENTATION WILL BE ERROR-FREE. Each\n      user of the Software or Documentation is solely responsible for determining the\n      appropriateness of using and distributing the Software and Documentation and\n      assumes all risks associated with its exercise of rights under this Agreement,\n      including but not limited to the risks and costs of program errors, compliance\n      with applicable laws, damage to or loss of data, programs, or equipment, and\n      unavailability or interruption of operations. Use of the Software and\n      Documentation is made with the understanding that PayPal will not provide you\n      with any technical or customer support or maintenance. Some states or\n      jurisdictions do not allow the exclusion of implied warranties or limitations\n      on how long an implied warranty may last, so the above limitations may not\n      apply to you. To the extent permissible, any implied warranties are limited to\n      ninety (90) days.\n\n      2. LIMITATION OF LIABILITY\n      PAYPAL AND ITS SUPPLIERS SHALL NOT BE LIABLE FOR LOSS OR DAMAGE ARISING OUT OF\n      THIS AGREEMENT OR FROM THE USE OF THE SOFTWARE OR DOCUMENTATION. IN NO EVENT\n      WILL PAYPAL OR ITS SUPPLIERS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY\n      DIRECT, INDIRECT, CONSEQUENTIAL, INCIDENTAL, OR SPECIAL DAMAGES INCLUDING LOST\n      PROFITS, LOST SAVINGS, COSTS, FEES, OR EXPENSES OF ANY KIND ARISING OUT OF ANY\n      PROVISION OF THIS AGREEMENT OR THE USE OR THE INABILITY TO USE THE SOFTWARE OR\n      DOCUMENTATION, HOWEVER CAUSED AND UNDER ANY THEORY OF LIABILITY, WHETHER IN\n      CONTRACT, STRICT LIABILITY OR TORT INCLUDING NEGLIGENCE OR OTHERWISE), EVEN IF\n      ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. PAYPAL'S AGGREGATE LIABILITY AND\n      THAT OF ITS SUPPLIERS UNDER OR IN CONNECTION WITH THIS AGREEMENT SHALL BE\n      LIMITED TO THE AMOUNT PAID BY YOU FOR THE SOFTWARE AND DOCUMENTATION.\n\n      3. TRADEMARK USAGE\n      PayPal is a trademark of PayPal Holdings, Inc. in the United States and other\n      countries. Such trademarks may not be used to endorse or promote any product\n      unless expressly permitted under separate agreement with PayPal.\n\n      4. TERM\n      Your rights under this Agreement shall terminate if you fail to comply with any\n      of the material terms or conditions of this Agreement and do not cure such\n      failure in a reasonable period of time after becoming aware of such\n      noncompliance. If all your rights under this Agreement terminate, you agree to\n      cease use and distribution of the Software and Documentation as soon as\n      reasonably practicable.\n\n      5. GOVERNING LAW AND JURISDICTION\n      This Agreement is governed by the statutes and laws of the State of California,\n      without regard to the conflicts of law principles thereof. If any part of this\n      Agreement is found void and unenforceable, it will not affect the validity of\n      the balance of the Agreement, which shall remain valid and enforceable\n      according to its terms. Any dispute arising out of or related to this Agreement\n      shall be brought in the courts of Santa Clara County, California, USA.\n\n      6. OPTIMAL UPDATE PRACTICES\n      PayPal strives for continuous improvement of its technology and encourages\n      Merchants to update the SDKs used in accordance with this Agreement at least\n      every six months in order to ensure an optimal experience for customers with\n      the most up-to-date feature set.\n\n"
  },
  "swift_version": "5.0"
}
