{
  "name": "!ProtoCompiler",
  "version": "3.6.1",
  "summary": "The Protobuf Compiler (protoc) generates Objective-C files from .proto files",
  "description": "This podspec only downloads protoc so that local pods generating protos can execute it as part\nof their prepare_command.\nThe generated code will have a dependency on the Protobuf Objective-C runtime of the same\nversion. The runtime can be obtained as the \"Protobuf\" pod.",
  "homepage": "https://github.com/google/protobuf",
  "license": {
    "type": "New BSD",
    "text": "      This license applies to all parts of Protocol Buffers except the following:\n\n      - Atomicops support for generic gcc, located in\n        src/google/protobuf/stubs/atomicops_internals_generic_gcc.h.\n        This file is copyrighted by Red Hat Inc.\n\n      - Atomicops support for AIX/POWER, located in\n        src/google/protobuf/stubs/atomicops_internals_power.h.\n        This file is copyrighted by Bloomberg Finance LP.\n\n      Copyright 2014, Google Inc.  All rights reserved.\n\n      Redistribution and use in source and binary forms, with or without\n      modification, are permitted provided that the following conditions are\n      met:\n\n          * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n          * Redistributions in binary form must reproduce the above\n      copyright notice, this list of conditions and the following disclaimer\n      in the documentation and/or other materials provided with the\n      distribution.\n          * Neither the name of Google Inc. nor the names of its\n      contributors may be used to endorse or promote products derived from\n      this software without specific prior written permission.\n\n      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n      \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n      LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n      A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n      OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n      SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n      LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n      DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n      THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n      (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n      OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n      Code generated by the Protocol Buffer compiler is owned by the owner\n      of the input file used when generating it.  This code is not\n      standalone and requires a support library to be linked with it.  This\n      support library is itself covered by the above license.\n"
  },
  "authors": {
    "The Protocol Buffers contributors": "protobuf@googlegroups.com"
  },
  "source": {
    "http": "https://github.com/google/protobuf/releases/download/v3.6.1/protoc-3.6.1-osx-x86_64.zip"
  },
  "preserve_paths": [
    "protoc",
    "google/**/*.proto"
  ],
  "dependencies": {
    "Protobuf": [
      "~> 3.0"
    ]
  },
  "platforms": {
    "ios": "7.0",
    "osx": "10.9",
    "tvos": "10.0"
  },
  "prepare_command": "if [ ! -f bin/protoc ]; then\n  cd ../..\n  # This will build protoc from the Protobuf submodule of gRPC, and put it in\n  # ../../bins/opt/protobuf.\n  #\n  # TODO(jcanizales): Make won't build protoc from sources if one's locally installed, which\n  # _we do not want_. Find a way for this to always build from source.\n  make grpc_objective_c_plugin\n  cd -\nelse\n  mv bin/protoc .\n  mv include/google .\nfi"
}
