{
  "name": "AccountKit",
  "version": "4.15.1",
  "summary": "AccountKit: Passwordless account creation via email or phone powered by Facebook",
  "description": "AccountKit helps you quickly sign in to apps using just your phone number or email address — no password needed. It's reliable, easy to use and gives you a choice about how you sign up for apps. It's built by Facebook but does not require a Facebook account to use.",
  "homepage": "https://developers.facebook.com/docs/accountkit/",
  "license": {
    "type": "Copyright",
    "text": "              Copyright (c) 2016-present, Facebook, Inc. All rights reserved.\n\n              You are hereby granted a non-exclusive, worldwide, royalty-free license to use,\n              copy, modify, and distribute this software in source code or binary form for use\n              in connection with the web services and APIs provided by Facebook.\n\n              As with any software that integrates with the Facebook platform, your use of\n              this software is subject to the Facebook Developer Principles and Policies\n              [http://developers.facebook.com/policy/]. This copyright notice shall be\n              included in all copies or substantial portions of the software.\n\n              THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n              IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\n              FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\n              COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\n              IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\n              CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
  },
  "authors": "Facebook",
  "platforms": {
    "ios": "7.0"
  },
  "source": {
    "http": "https://github.com/facebook/facebook-ios-sdk/releases/download/sdk-version-4.15.1/AccountKit-4.15.1.zip",
    "sha1": "d57ecae1311a1a353a857f6cb5f24ff33faaf79e"
  },
  "source_files": "AccountKit.framework/**/*.h",
  "resources": [
    "AccountKitAdditionalStrings.bundle",
    "AccountKitStrings.bundle"
  ],
  "public_header_files": "AccountKit.framework/**/*.h",
  "weak_frameworks": [
    "Accounts",
    "CoreLocation",
    "Social",
    "Security",
    "QuartzCore",
    "CoreGraphics",
    "UIKit",
    "Foundation",
    "AudioToolbox"
  ],
  "vendored_frameworks": "AccountKit.framework",
  "preserve_paths": "AccountKit.framework",
  "requires_arc": true
}
