{
  "name": "MeridianSDK",
  "version": "5.1.0",
  "summary": "Indoor Location and Wayfinding",
  "homepage": "https://meridianapps.com",
  "license": {
    "type": "Commercial",
    "text": "      Meridian SDK Terms and Conditions\n\n      These Meridian SDK Terms and Conditions (“Terms”) are made available by Aruba Networks, Inc. (“Aruba”). By downloading or using the Meridian SDK (as defined below), you and any company, entity, or organization on behalf of which you are accepting these Terms hereby agree to be bound by these Terms. If you do not agree to these Terms, do not download or use the Meridian SDK.\n\n      If you are downloading, accessing. or using the Meridian SDK on behalf of a company, entity, or organization, then you represent and warrant that you are an authorized representative of such company, entity, or organization with the authority to bind such company, entity, or organization to these Terms; and agree to be bound by these Terms on behalf of such company, entity, or organization. You and, if applicable, such company, entity, or organization are referred to herein as the “Customer.”\n\n      These Terms are subject to and incorporated by reference into the terms and conditions of the agreement between Customer and Aruba pursuant to which Customer agrees to pay the applicable fee for access and use of the Meridian SDK (the “Meridian End User License and Services Agreement”). To the extent there is an express conflict between these Terms and the Meridian End User License and Services Agreement, the Meridian End User License and Services Agreement will govern.\n\n\n      1. Definitions\n\n      1.1. “Authorized Purpose” means the scope of Customer’s permitted use of the Meridian SDK, which is solely for purposes of developing and distributing a Customer App pursuant to the Meridian End User License and Services Agreement.\n\n      1.2. “Customer” has the meaning set forth in the preamble.\n\n      1.3. “Customer App” means a software application developed or distributed by or on behalf of Customer that utilizes the Meridian SDK.\n\n      1.4 “Meridian End User License and Services Agreement” has the meaning set forth in the preamble.\n\n      1.5. “Meridian Technology” means all technology, including all software, systems and specifications of Aruba, as well as all intellectual property and other proprietary rights therein. For the avoidance of doubt, “Meridian Technology” includes the Meridian SDK.\n\n      1.6. “Meridian SDK” means the software development kit and any other documentation and software that may be provided by Aruba to Customer with the software development kit (including any updates to the foregoing).\n\n\n      2. Meridian SDK License\n\n      During the term of these Terms, and subject to the terms of the Meridian End User License and Services Agreement (including payment of applicable fees), Aruba hereby grants Customer a worldwide, non-transferable (except for a permitted assignment of these Terms), non-exclusive license to (a) use the Meridian SDK internally for the sole purpose integrating the Meridian SDK with the Customer App , (b) use certain portions of the Meridian SDK solely as required for Customer’s creation of the Customer App, in the manner enabled by Aruba and in accordance with any applicable documentation provided by Aruba; and (c) operate and distribute the Customer App as integrated with the Meridian SDK solely for the Authorized Purpose, in the manner enabled by Aruba and in accordance with any applicable documentation provided by Aruba.\n\n\n      3. License Restrictions\n\n      Customer has no rights or licenses with respect to the Meridian SDK except as expressly provided under these Terms. Without limiting the generality of the foregoing, except as expressly provided in these Terms, Customer may not (a) copy, distribute, rent, lease, lend, sublicense, transfer or make the Meridian SDK available to any third party or use the Meridian SDK on a service bureau basis, (b) decompile, reverse engineer, or disassemble the Meridian SDK, (c) create derivative works based on the Meridian SDK; (d) modify, remove, or obscure any copyright, trademark, patent or other notices or legends that appear on the Meridian SDK or during the use and operation thereof, or (e) use the Meridian SDK in any manner other than for the Authorized Purpose.\n\n\n      4. Ownership\n\n      4.1. Aruba Rights. As between Aruba and Customer, Aruba retains all right, title and interest in and to the Meridian Technology, the Meridian SDK and any materials created, developed or provided by Aruba in connection with these Terms, including all intellectual property rights related to each of the foregoing. All rights not expressly granted by Aruba to Customer herein are hereby reserved by Aruba.\n\n      4.2. Customer Rights. Subject to Section 4.1, as between Customer and Aruba, Customer retains all right, title and interest in and to the Customer App, including all intellectual property rights related to the Customer App. All rights in the Customer App not expressly granted by Customer to Aruba herein are hereby reserved by Customer.\n\n\n      5. Support\n\n      Aruba shall have no obligation under these Terms to provide any upgrades, patches, enhancements, fixes or any other support for the Meridian Technology or Meridian SDK. Aruba may make maintenance and support services available under a separate agreement (including under the Meridian End User License and Services Agreement).\n\n\n      6. Term and Termination\n\n      6.1. Term. These Terms are effective until terminated.\n\n      6.2. Termination by Aruba. Subject to any the terms and conditions of any Meridian End User License and Services Agreement, Aruba may terminate these Terms at any time by providing thirty (30) days notice to Customer. Additionally, Aruba may terminate these Terms and the licenses granted herein immediately if Customer breaches any of these Terms.\n\n      6.3. Termination by Customer. Subject to any the terms and conditions of any Meridian End User License and Services Agreement, Customer may terminate these Terms and the licenses granted herein at any time by ceasing all use of the Meridian Technology and Meridian SDK and destroying or removing from all hard drives, networks, and other storage media all copies of the Meridian SDK.\n\n      6.4. Effect of Termination. Sections 3, 4, 6.4, and 7 through 9 shall survive any expiration or termination of these Terms. Termination of these Terms does not terminate the Meridian End User License and Services Agreement.\n\n\n      7. Indemnity\n\n      Customer agrees to defend, indemnify and hold harmless Aruba and its officers, directors, employees, consultants, affiliates, subsidiaries and agents (collectively, the \"Aruba Entities\") from and against any and all claims, liabilities, damages, losses and expenses, including reasonable attorneys' and accounting fees and costs, arising out of or in any way connected with (i) Customer’s access to, use of or alleged use of the Meridian SDK or other Meridian Technology; (ii) Customer’s violation of any applicable law or regulation (including any privacy or consumer protection law or regulation); (iii) Customer’s violation of any third party right, including without limitation any intellectual property, confidentiality, or property right or right of privacy or publicity; or (iv) any disputes or issues between Customer and any third party (including any end user). Aruba reserves the right, at Aruba’s own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by Customer, and in such case, Customer agrees to cooperate with Aruba’s defense of such claim.\n\n\n      8. Disclaimer of Certain Damages\n\n      IN NO EVENT WILL THE ARUBA ENTITIES BE LIABLE TO CUSTOMER FOR ANY LOSS OF PROFITS, LOSS OF BUSINESS OR GOODWILL, LOSS OF USE OR DATA, INTERRUPTION OF BUSINESS, OR FOR INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY KIND ARISING OUT OF THESE TERMS, HOWEVER CAUSED, WHETHER FOR BREACH OF WARRANTY, BREACH OR REPUDIATION OF CONTRACT, TORT, NEGLIGENCE, OR OTHERWISE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES IN SOME CIRCUMSTANCES. ACCORDINGLY, SOME OF THE ABOVE LIMITATIONS MAY NOT APPLY.\n\n\n      9. Limitation of Liability\n\n      TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE ARUBA ENTITIES AGGREGATE LIABILITY UNDER THESE TERMS WILL NOT EXCEED ONE HUNDRED DOLLARS ($100).\n"
  },
  "authors": {
    "Meridian Apps": "developers@meridianapps.com"
  },
  "platforms": {
    "ios": "10.0"
  },
  "source": {
    "http": "https://files.meridianapps.com/meridian-ios-sdk/meridian-ios-sdk-only-5.1.0.zip"
  },
  "frameworks": [
    "Foundation",
    "CoreLocation",
    "CoreMotion",
    "SystemConfiguration",
    "CoreBluetooth",
    "UIKit",
    "MobileCoreServices"
  ],
  "libraries": [
    "c++.1",
    "xml2.2"
  ],
  "vendored_frameworks": "Meridian.framework",
  "requires_arc": true
}
