{
  "name": "MoveViewUpForKeyboardKit",
  "version": "2.0.0",
  "summary": "MVUFKKit provides a view that will automatically move itself up for the keyboard.",
  "description": "The eternal battle between iOS developers and the keyboard rages on, and the\nkeyboard seems poised for victory.\n\nJust Google 'iOS move view for keyboard' and gaze upon the desolation. The\ntop answers don't call `convertRect`, and the keyboard easily destroys them\nall unless their view's bottom happens to be directly at the bottom of the\nscreen. Apple's documentation doesn't even mention 'convertRect', and so it\ntoo is overrun by the dread keyboard. Many solutions fail miserably under\nAutoLayout, and are thusly rendered useless.\n\nBut hark! A bright light appears suddenly upon the horizon, and\nMoveViewUpForKeyboardKit rides fiercely upon a white stallion to join the fray!\n\nMoveViewUpForKeyboardKit brutally provides a view that will automatically position\nitself at the bottom of its superview or the top of the keyboard, whichever is higher.\nWith this ultimate weapon against it, the keyboard knows it cannot prevail. In\ndesperation, the keyboard animates itself with undocumented animation curves, but\nMoveViewUpForKeyboardKit parrys by matching them perfectly! The keybaord is off balance,\nand MoveViewUpForKeyboardKit prepares it's coup de grâce. MoveViewUpForKeyboardKit\nmercilessly handles the case where the keyboard is _already visible_, and keys fly\neverywhere as the dread keyboard explodes in a ball of furious hellfire.",
  "homepage": "https://github.com/GriffinSchneider/MoveViewUpForKeyboardKit",
  "license": {
    "type": "MIT",
    "file": "LICENSE.txt"
  },
  "authors": {
    "Griffin Schneider": "griffinschneider@gmail.com"
  },
  "source": {
    "git": "https://github.com/GriffinSchneider/MoveViewUpForKeyboardKit.git",
    "tag": "2.0.0"
  },
  "ios": {
    "frameworks": [
      "Foundation",
      "UIKit"
    ]
  },
  "requires_arc": true,
  "platforms": {
    "ios": "7.0"
  },
  "source_files": "MoveViewUpForKeyboardKit/*.{h,m}"
}
