{
  "name": "com.aurvan.ATKit.iOS",
  "version": "1.0",
  "summary": "ATKit is an Apple Swift framework that makes the iOS app development easier.",
  "description": "- Extensions: ATKit provides various extensions those will reduce the lines of code you need to write to implement given feature.\n- ATHttpConnectionManager: ATKit provides ATHttpConnectionManager that will allow you to send HTTP GET, POST etc. requests with ease. You can also upload files easily.\n- ATCheckbox: The ATCheckbox creates a check-box control.\n- ATProgressOverlay: The ATProgressOverlay creates an overlay that can be used to indicate any application activity and to disable user interaction with the application for some time.\n- ATTextView: The ATTextView adds various functionalities to UITextView, e.g. placeholder.\n- ATToast: The ATToast creates a self dismissing pop-up that can be used to display message to the user.\n- ATWindow: The ATWindow adds various functionalities to UIWindow, e.g. dismiss keyboard on tap on screen, adjust text-field frame as per keyboard visibility.",
  "homepage": "https://github.com/aurvan/atkit-ios-release",
  "documentation_url": "https://aurvan.github.io/atkit-ios-release/index.html",
  "screenshots": [
    "https://github.com/aurvan/atkit-ios-release/raw/master/docs/screenshots/checkbox.gif",
    "https://github.com/aurvan/atkit-ios-release/raw/master/docs/screenshots/progress-overlay.gif",
    "https://github.com/aurvan/atkit-ios-release/raw/master/docs/screenshots/textview-placeholder.gif",
    "https://github.com/aurvan/atkit-ios-release/raw/master/docs/screenshots/toast.gif"
  ],
  "authors": "Aurvan.com",
  "license": {
    "type": "Apache License, Version 2.0",
    "text": "\t\t\tCopyright 2018 Aurvan.com\n\t\t\t\n\t\t\tLicensed under the Apache License, Version 2.0 (the \"License\");\n\t\t\tyou may not use this file except in compliance with the License.\n\t\t\tYou may obtain a copy of the License at\n\t\t\t\n\t\t\thttp://www.apache.org/licenses/LICENSE-2.0\n\t\t\t\n\t\t\tUnless required by applicable law or agreed to in writing, software\n\t\t\tdistributed under the License is distributed on an \"AS IS\" BASIS,\n\t\t\tWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n\t\t\tSee the License for the specific language governing permissions and\n\t\t\tlimitations under the License.\n"
  },
  "platforms": {
    "ios": "8.0"
  },
  "swift_version": "3.2",
  "static_framework": true,
  "source": {
    "http": "https://github.com/aurvan/atkit-ios-release/raw/1.0.0.0/framework/atkit-framework-v1.0-swift3.2.zip"
  },
  "ios": {
    "vendored_frameworks": "ATKit.framework"
  }
}
