{
  "name": "PodRTC",
  "version": "61.4.0.0",
  "summary": "WebRTC for iOS",
  "description": "PodRTC is an unofficial build of WebRTC for IOS platform bundled in this Cocoapod.\nWebRTC is a free, open project that provides browsers and mobile applications with\nReal-Time Communications.",
  "homepage": "https://github.com/zevarito/PodRTC",
  "license": {
    "type": "https://webrtc.org/license/",
    "text": "FILENAME: LICENSE\n\nCopyright (c) 2011, The WebRTC project authors. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n* Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in\nthe documentation and/or other materials provided with the\ndistribution.\n\n* Neither the name of Google nor the names of its contributors may\nbe used to endorse or promote products derived from this software\nwithout specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nHOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n======================================================================\n\nFILENAME: PATENTS\n\nAdditional IP Rights Grant (Patents)\n\n\"This implementation\" means the copyrightable works distributed by\nGoogle as part of the WebRTC code package.\n\nGoogle hereby grants to you a perpetual, worldwide, non-exclusive,\nno-charge, irrevocable (except as stated in this section) patent\nlicense to make, have made, use, offer to sell, sell, import,\ntransfer, and otherwise run, modify and propagate the contents of this\nimplementation of the WebRTC code package, where such license applies\nonly to those patent claims, both currently owned by Google and\nacquired in the future, licensable by Google that are necessarily\ninfringed by this implementation of the WebRTC code package. This\ngrant does not include claims that would be infringed only as a\nconsequence of further modification of this implementation. If you or\nyour agent or exclusive licensee institute or order or agree to the\ninstitution of patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that this\nimplementation of the WebRTC code package or any code incorporated\nwithin this implementation of the WebRTC code package constitutes\ndirect or contributory patent infringement, or inducement of patent\ninfringement, then any patent rights granted to you under this License\nfor this implementation of the WebRTC code package shall terminate as\nof the date such litigation is filed.\n\n=======================================================================\n\nSee complete information about license, patents, codecs etc. visiting:\n\n"
  },
  "authors": "Library: Google Inc., Build/Pod: @zevarito",
  "social_media_url": "http://twitter.com/zevarito",
  "source": {
    "git": "https://github.com/zevarito/PodRTC.git",
    "tag": "61.4.0.0"
  },
  "platforms": {
    "ios": "8.0"
  },
  "vendored_frameworks": "WebRTC.framework"
}
