{
  "name": "CloselyLocationSDK",
  "version": "1.0.0",
  "summary": "Closely enables you to easily build powerful location and context aware Apps for iOS and Android.",
  "description": "Introduction\nClosely is the most solid foundation for your high quality location-based App. It provides an advanced geofencing technology, real-time location tracking, spatio-temporal prediction and other features that help you build the best location- and context-aware mobile Apps. All technologies are available as SDKs for iOS and Android. The SDK is lightweight and easy to integrate. Closely’s algorithms have been optimized over 4 years to operate with lowest power consumption (1%).\n\nGeofencing Technology\nClosely provides the most accurate and energy-saving Geofencing technology for iOS and Android. It uses predictive analysis to forecast the user’s location and dynamically adjusts location tracking to optimize accuracy and battery drain at the same time. The efficiency of this award winning technology is already proven by millions of happy app users. Besides a much better accuracy than the native geofencing on iOS and Android, you will get the following additional benefits: Unlimited amount of geofences per device, time-based geofences, real-time syncing of geofences via API, webhooks and more.\n\nSDKs for iOS and Android\nSDKs for both Android and iOS are provided to easily integrate the Closely Location Technology into you App. Please see the documentation for the specific platform to get an impression what the SDKs can do for you.\n\nBackend API\nWe're providing a backend API for simple configuration or your project, creating new geofences programmatically and fetching events triggered by your users. Have a look at the Backend API documentation to see what's possible.",
  "homepage": "https://github.com/familonet/closely-location-sdk-ios",
  "license": {
    "type": "None",
    "file": "LICENSE"
  },
  "authors": {
    "Closely": "hello@closely.io"
  },
  "source": {
    "git": "https://github.com/familonet/closely-location-sdk-ios.git",
    "tag": "1.0.0"
  },
  "platforms": {
    "ios": "8.0"
  },
  "ios": {
    "vendored_frameworks": "CloselyLocationSDK.framework"
  },
  "dependencies": {
    "BNRCoreDataStack": [

    ],
    "SwiftyJSON": [

    ]
  },
  "pushed_with_swift_version": "3.0"
}
