{
  "name": "KVPasscode",
  "version": "0.0.1",
  "license": {
    "type": "MIT Example",
    "text": "      Copyright 2011 Koolistov. All rights reserved.\n\n      Redistribution and use in source and binary forms, with or without modification, are \n      permitted provided that the following conditions are met:\n\n      * Redistributions of source code must retain the above copyright notice, this list of \n        conditions and the following disclaimer.\n      * Redistributions in binary form must reproduce the above copyright notice, this list \n        of conditions and the following disclaimer in the documentation and/or other materials \n        provided with the distribution.\n      * Neither the name of KOOLISTOV nor the names of its contributors may be used to \n        endorse or promote products derived from this software without specific prior written \n        permission.\n\n      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY \n      EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF \n      MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL \n      THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, \n      SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT \n      OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) \n      HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, \n      OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS \n      SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
  },
  "summary": "A view controller that lets you enter 4 digit pass codes. It supports animations for invalid entries and to confirm entries.",
  "homepage": "http://github.com/Koolistov/Passcode",
  "authors": {
    "Johan Kool": "johan@koolistov"
  },
  "source": {
    "git": "https://github.com/Koolistov/Passcode.git",
    "tag": "0.0.1"
  },
  "platforms": {
    "ios": null
  },
  "source_files": "KVPasscodeViewController.{h,m}",
  "resources": "KVPasscodeViewController.xib",
  "frameworks": [
    "AudioToolbox",
    "QuartzCore"
  ],
  "requires_arc": false
}
