{
  "name": "HRSAdvancedTableViews",
  "version": "0.2.5",
  "summary": "HRSAdvancedTableViews is a collection of useful table view additions, split into several subspecs.",
  "description": "                       The Advanced Table Views library is a set of modules that make handling table views more convenient. The different modules are split into cocoapods subspecs so that you can only include the modules you are interested in. Some of the modules (like `HRSIndexPathMapping`) have advantages that might also be useful for other tasks than just table views, however they are mainly designed for the work with table views.\n\n\n                       # HRSSectionController\n\n                       The section controller module deals with the problem of overloaded table view controllers. It separates the data model of a table view by its sections. Each section has its own controller that is responsible for providing the table view with the information it needs by implementing the necessary methods from `UITableViewDelegate` and `UITableViewDataSource`.\n\n\n                       # HRSIndexPathMapping\n\n                       The index path mapping module is used for mapping index paths of every kind through a visibility / active state. This is mostly used to map index paths in the `UITableView` or `UICollectionView` context but can be used by every other logic that deals with index paths and needs to map between two sets of index paths based on various conditions.\n\n                       In practice, this is used to collapse or hide a couple of rows or sections inside a table view based on your current model data.\n",
  "homepage": "https://github.com/Hotel-Reservation-Service/HRSAdvancedTableViews",
  "license": "Apache License, Version 2.0",
  "authors": {
    "HRS Hotel Reservation Service, Michael Ochs": "michael.ochs@hrs.com"
  },
  "source": {
    "git": "https://github.com/Hotel-Reservation-Service/HRSAdvancedTableViews.git",
    "tag": "0.2.5"
  },
  "platforms": {
    "ios": "7.0"
  },
  "requires_arc": true,
  "frameworks": "UIKit",
  "subspecs": [
    {
      "name": "HRSSectionController",
      "source_files": "Pod/Classes/HRSSectionController/**/*.{h,m}",
      "public_header_files": "Pod/Classes/HRSSectionController/*.h"
    },
    {
      "name": "HRSIndexPathMapping",
      "source_files": "Pod/Classes/HRSIndexPathMapping/**/*.{h,m}",
      "public_header_files": "Pod/Classes/HRSIndexPathMapping/*.h"
    }
  ]
}
