{
  "name": "MySocialApp",
  "version": "1.0.6",
  "summary": "Official Swift client to interact with MySocialApp API - Create your own social network app https://mysocialapp.io",
  "description": "Official Swift client to interact with apps made with MySocialApp (turnkey iOS and Android social network app builder - SaaS).\n\nNote: This lib was made in Swift and can be used inside any Swift 3 and above apps.\n\nWhy using it?\nMySocialApp is a very innovative way to have a turnkey native social network app for iOS and Android. Our API are open and ready to use for all your need inside one of our generated app or any thirds app.\n\nWhat can you do?\nAdd social features to your existing app, automate actions, scrape contents, analyze the users content, add bot to your app, almost anything that a modern social network can bring.. There is no limit! Any suggestion to add here? Do a PR.",
  "homepage": "https://mysocialapp.io",
  "license": {
    "type": "BSD",
    "text": "Copyright (c) 2018, MySocialApp \nAll rights reserved. \n\nRedistribution and use in source and binary forms, with or without \nmodification, are permitted provided that the following conditions are met: \n\n * Redistributions of source code must retain the above copyright notice, \n   this list of conditions and the following disclaimer. \n * Redistributions in binary form must reproduce the above copyright \n   notice, this list of conditions and the following disclaimer in the \n   documentation and/or other materials provided with the distribution. \n * Neither the name of MySocialApp nor the names of its contributors may be \n   used to endorse or promote products derived from this software without \n   specific prior written permission. \n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" \nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE \nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE \nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE \nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR \nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF \nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS \nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN \nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) \nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE \nPOSSIBILITY OF SUCH DAMAGE.\n"
  },
  "authors": {
    "MySocialApp": "contact@mysocialapp.io"
  },
  "platforms": {
    "ios": "9.0"
  },
  "source": {
    "git": "https://github.com/MySocialApp/mysocialapp-swift-client.git",
    "tag": "1.0.6"
  },
  "source_files": [
    "MySocialApp",
    "MySocialApp/**/*.{h,swift}"
  ],
  "dependencies": {
    "RxSwift": [
      "~> 3.0.1"
    ],
    "RxCocoa": [
      "~> 3.0.1"
    ],
    "RxBlocking": [
      "~> 3.0.1"
    ],
    "Alamofire": [
      "~> 4.0.1"
    ]
  }
}
