{
  "name": "CAT-Audio-Box",
  "version": "1.0",
  "summary": "Multi 'slot' audio recorder / player with Core Audio Effects. Built on top of 'The Amazing Audio Engine' by Michael Tyson.",
  "description": "               \n               <h1>CAT-Audio-Box</h1>\n\n      Multi 'slot' audio recorder / player built on top of 'The Amazing Audio Engine' by Michael Tyson.\n\n      Created to replace the multiple AVAudioRecorders I had in one of my apps. CAT-Audio-Box records or plays one track at a time in the same style as a traditional tape recorder, but benefits from the additional features / expandability of CoreAudio. \n\n<h2>Features:</h2>\n<ul>\n<li>User specified number of recording 'slots'</li>\n<li>Temp recording to documents folder with finished set of audio files presented as NSDict of NSData</li>\n<li>Auto recording stop and volume fade out</li>\n<li>Compression / limiting / high pass filtering of audio via configurable Audio Units</li>\n<li>Wav / Aiff / M4a / MP3 (OS X) formats</li>\n</ul>\n\n",
  "license": {
    "type": "MIT",
    "text": "\nCopyright (C) 2013-2014 Carl Taylor\n\nTAAE Copyright (C) 2012-2014 A Tasty Pixel\n\nThis software is provided as-is, without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\nThe origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\nAltered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\nThis notice may not be removed or altered from any source distribution.\n\n"
  },
  "homepage": "https://github.com/carltaylor43/CAT-Audio-Box",
  "authors": {
    "Carl Taylor": "carltaylor43uk@gmail.com"
  },
  "social_media_url": "https://twitter.com/carltaylordev",
  "source": {
    "git": "https://github.com/carltaylor43/CAT-Audio-Box.git",
    "tag": "1.0"
  },
  "source_files": "*.{h,m}",
  "exclude_files": "AudioBoxDemo",
  "platforms": {
    "ios": "5.1"
  },
  "requires_arc": true,
  "dependencies": {
    "TheAmazingAudioEngine": [
      "~> 1.3"
    ]
  }
}
