{
  "name": "libffi-apple",
  "version": "3.4.4",
  "summary": "A portable foreign-function interface library.",
  "description": "Compilers for high level languages generate code that follow certain conventions. These conventions are necessary, in part, for separate compilation to work. One such convention is the \"calling convention\". The \"calling convention\" is essentially a set of assumptions made by the compiler about where function arguments will be found on entry to a function. A \"calling convention\" also specifies where the return value for a function is found.\n\nSome programs may not know at the time of compilation what arguments are to be passed to a function. For instance, an interpreter may be told at run-time about the number and types of arguments used to call a given function. Libffi can be used in such programs to provide a bridge from the interpreter program to compiled code.\n\nThe libffi library provides a portable, high level programming interface to various calling conventions. This allows a programmer to call any function specified by a call interface description at run time.\n\nFFI stands for Foreign Function Interface. A foreign function interface is the popular name for the interface that allows code written in one language to call code written in another language. The libffi library really only provides the lowest, machine dependent layer of a fully featured foreign function interface. A layer must exist above libffi that handles type conversions for values passed between the two languages.",
  "homepage": "https://github.com/623637646/libffi",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "Yanni Wang 王氩": "wy19900729@gmail.com"
  },
  "platforms": {
    "ios": "12.0",
    "osx": "10.13"
  },
  "source": {
    "git": "https://github.com/623637646/libffi.git",
    "tag": "3.4.4"
  },
  "source_files": "Sources/libffi/**/*.{h,c,S}",
  "public_header_files": "Sources/libffi/include/**/*.{h}",
  "pod_target_xcconfig": {
    "GCC_PREPROCESSOR_DEFINITIONS": "$(inherited) USE_DL_PREFIX=1",
    "DEFINES_MODULE": "YES"
  }
}
