{
  "name": "Auryc",
  "version": "1.1.5",
  "summary": "Auryc SDK for iOS applications",
  "homepage": "http://www.auryc.com",
  "license": {
    "type": "Commercial",
    "text": "Copyright (c) 2017, The Auryc SDK is a copyrighted work belonging to Auryc.\n\nWe or Our suppliersexclusively own the information and content made available on or through the Site (other than information or content You provide) and the information and content in any communications Auryc sends You (collectively, “SDK”). You may use the SDK only in accordance with this Agreement. Subject to the terms and conditions of this Agreement (including Your compliance with this Agreement), Auryc grants You a limited, non-exclusive, non-transferable, non-sublicensable, revocable license to view and use the Auryc SDK (other than Software (defined in Section 4 of our Terms of Service) which is licensed only under the terms of Section 4 of our Terms of Service) for Your personal or internal business purposes. You may not use the Auryc SDK except as expressly authorized under this Agreement. You agree that any copy of the Auryc SDK that You make shall retain all copyright and other proprietary notices in the same form and manner as on the original. Except as expressly authorized under this Agreement or to the extent otherwise permitted under applicable law, You may not use, download, upload, print, display, perform, reproduce, publish, license, post, transmit, modify, create derivative works of, reverse engineer, disassemble, decompile, adapt, distribute, transfer, or exploit any Auryc SDK in whole or in part without Our prior written authorization."
  },
  "authors": {
    "Auryc": "contactus@auryc.com"
  },
  "source": {
    "http": "https://s3.amazonaws.com/auryc.sdk.framework/Auryc.framework_xcode9.1_1_1_5.zip"
  },
  "vendored_frameworks": "Auryc.framework",
  "exclude_files": "Auryc/Exclude",
  "platforms": {
    "ios": "9.0"
  },
  "dependencies": {
    "Alamofire": [

    ],
    "SwiftProtobuf": [
      "~> 0.9.903"
    ],
    "JSONWebToken": [

    ],
    "ProtocolBuffers-Swift": [

    ]
  },
  "pod_target_xcconfig": {
    "SWIFT_VERSION": "3.2"
  },
  "compiler_flags": "-swift-version 3.2"
}
