{
  "name": "MYUtilities",
  "version": "0.0.1",
  "license": {
    "type": "BSD",
    "text": " Copyright (c) 2008, Jens Alfke <jens@mooseyard.com>. All rights reserved.\n\n Redistribution and use in source and binary forms, with or without modification, are permitted\n provided that the following conditions are met:\n\n * Redistributions of source code must retain the above copyright notice, this list of conditions\n and the following disclaimer.\n * Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n and the following disclaimer in the documentation and/or other materials provided with the\n distribution.\n\n THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR\n IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRI-\n BUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n  PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\n THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
  },
  "summary": "Objective-C utility code for Cocoa programming on Mac OS X.",
  "homepage": "https://github.com/snej/MYUtilities",
  "authors": {
    "Jens Alfke": "jens@mooseyard.com"
  },
  "source": {
    "git": "https://github.com/snej/MYUtilities.git",
    "commit": "0cc46aaf394dfe451d83d0ae3954643662210767"
  },
  "platforms": {
    "ios": null
  },
  "source_files": [
    "{Logging,Test,ExceptionUtils,Target,CollectionUtils,ConcurrentOperation,MYURLUtils,MYBlockUtils,MYStreamUtils,MYRegexUtils}.{h,m}",
    "vendor/google-toolbox-for-mac/*.{h,m}"
  ],
  "libraries": "z",
  "requires_arc": false
}
