{
  "name": "MonarchRouter",
  "version": "1.1.2",
  "summary": "A lightweight yet powerful state-based router written in Swift.",
  "description": "A lightweight yet powerful functional state-based router written in Swift.\n\nCommon URL conventions are used for routing. It's designed for you to feel at home if you ever developed a server-side app routing.\n\nMonarch Router is a declarative routing handler that decouples ViewControllers from each other via Coordinator and Presenters. It fits right in with Redux style state flow and reactive frameworks.\n\nThe Coordinator is constructed by declaring a route hierarchy mapped with a URL structure. Presenters abstract UI creation and modification.\n\nMonarch butterflies weight less than 1 gram but cover thousands of miles during their migration. It's considered an iconic pollinator and one of the most beautiful butterfly species.\n\nFeatures:\n\n- [x] Navigating complex ViewControlles hierarchy and unwinding on path change.\n- [x] Parsing and passing route parameters to endpoints, following URL conventions.\n- [x] Deeplinking to handle Push Notifications, Shortcuts and Universal Links.\n- [x] Navigating forks (tabbar-like presenters).\n- [x] Navigating stacks (i.e. navigation controller).\n- [x] Opening and dismissing modals, with their own hierarchy.\n- [x] Switching top-level app sections via changing the window's rootViewController.\n- [x] Scenes handling.\n- [ ] Handling navigation in universal apps. *(PRs welcome!)*\n- [ ] Properly abstracting Router layer to handle navigation in macOS apps.",
  "homepage": "https://github.com/nikans/MonarchRouter",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "nikans": "eliah@nikans.com"
  },
  "source": {
    "git": "https://github.com/nikans/MonarchRouter.git",
    "tag": "1.1.2"
  },
  "platforms": {
    "ios": "8.0"
  },
  "source_files": "Sources/MonarchRouter/**/*.swift",
  "frameworks": "UIKit",
  "requires_arc": true,
  "swift_versions": "5.0",
  "screenshots": [
    "https://raw.githubusercontent.com/nikans/MonarchRouter/master/Media/logo%402x.png"
  ],
  "swift_version": "5.0"
}
