{
  "name": "RYGestureRecognizer",
  "version": "0.1.0",
  "summary": "A gesture class to replace the system gesture.",
  "description": "This is a class to recognize gestures, which can recognize gestures like tap, swipe, pan, pinch, rotation, long press. You can use the class to replace the iOS sdk.\n* 1. One gesture cycle begins with a touch in the screen and ends with all touches leave the screen. In one gesture recognize cycle, if there is a finger leaves the screen, but there are still fingers touches, and then another new touch occure, this gesture cycle will be considered a invaild gesture.\n* 2. In action method, if you want to get the recognizer state(UIGestureRecognizerState), you should use the property of \"recognizerState\" rather than \"state\". The property of \"state\" in long press gesture action once is changed not ended. On other gestures the \"state\" is the same as \"recognizerState\".\n* 3. In long press gesture, the action will called right after the long press gesture recognized once by default. and before all fingers leave the screen, the new gesture cycle will not begin. the recognizeState is UIGestureRecognizerStateEnded. If you want to still recognize the move action after the long press gesture, you should set the longPressActionOnce to NO. So the move action will still be recogized and action method will be called, but the recognizerState is changed. Also, the action method will be called at all finger leave the screen with the recognizeState to be ended.\n* 4. In rotation and pan gesture, the action method will call when the touches move. the recognizeState is UIGestureRecognizerStateChanged.\n* 5. The aciton method will not call at the begin of touch, if you wish, set the shouldDoActionAtTouchBegin with true.",
  "homepage": "https://github.com/Ekulelu/RYGestureRecognizer",
  "license": {
    "type": "Apache-2.0",
    "file": "LICENSE"
  },
  "authors": {
    "Ekulelu": "709314090@qq.com"
  },
  "source": {
    "git": "https://github.com/Ekulelu/RYGestureRecognizer.git",
    "tag": "0.1.0"
  },
  "platforms": {
    "ios": "8.0"
  },
  "source_files": "*.{h,m}"
}
