{
  "name": "testPhotoTool",
  "version": "0.0.2",
  "summary": "Im testing the pod to later add to my projects",
  "swift_versions": "5.0",
  "description": "testPhotoTool\n\nUnleash the power of testPhotoTool – the ultimate tool for seamless photo capture and server integration in your Swift projects. Empower your applications with advanced camera functionality and streamline the process of capturing and sharing photos with the world.\n\nKey Features:\n\nEffortless Photo Capture: testPhotoTool provides a user-friendly interface for capturing high-quality photos directly from your iOS application. With just a few lines of code, you can integrate a fully functional camera into your app, allowing users to snap pictures effortlessly.\n\nCustomizable User Experience: Tailor the camera interface to match your app's unique branding and style. Customize buttons, layouts, and visual elements to create a seamless user experience that resonates with your audience.\n\nSeamless Server Integration: Say goodbye to complex networking code. testPhotoTool simplifies the process of sending photos and associated data to your server. With built-in HTTP request functionality, you can effortlessly transmit photos and metadata, allowing your app to interact with your backend with ease.\n\nSwiftUI Compatibility: Designed with SwiftUI in mind, testPhotoTool seamlessly integrates into your SwiftUI-based projects. Create stunning, modern interfaces that leverage the full potential of Swift's powerful features.\n\nRobust Documentation: Access comprehensive documentation and code examples that guide you through every aspect of integrating testPhotoTool into your application. Whether you're a seasoned developer or new to iOS development, you'll find the resources you need to get up and running quickly.\n\nCommunity and Support: Join a thriving community of developers who are using testPhotoTool to enhance their apps. Benefit from ongoing support, updates, and a network of fellow developers who can help you succeed.\n\nGetting Started:\n\nInstallation: Add testPhotoTool to your project as a Swift Package or CocoaPods dependency.\n\nConfiguration: Customize the camera interface, define your server endpoints, and tailor the user experience to match your app's unique style.\n\nCapture and Transmit: Implement photo capture and data transmission using the intuitive API provided by testPhotoTool.\n\nEnhance Your App: Leverage the power of testPhotoTool to take your iOS app to the next level. Deliver a seamless and feature-rich experience to your users.",
  "homepage": "https://github.com/ShpendAppbites/testPhotoTool",
  "license": {
    "type": "MIT",
    "file": "LICENSE"
  },
  "authors": {
    "58985607": "shpend.tahiri15@gmail.com"
  },
  "source": {
    "git": "https://github.com/ShpendAppbites/testPhotoTool.git",
    "tag": "0.0.2"
  },
  "platforms": {
    "ios": "14.0"
  },
  "source_files": "Classes/**/*.{swift}",
  "swift_version": "5.0"
}
