{
  "name": "NObreathSDK",
  "version": "1.0.0",
  "summary": "Supporting Library for the NObreath V2 device.",
  "description": "Supporting Library for the NObreath V2 device, which utilises the BlueJay framework.",
  "source": {
    "http": "https://s3.eu-west-1.amazonaws.com/development.bedfont.com/NObreathV2/SDK/iOS/versions/1.0.0/NObreathSDK.xcframework.zip"
  },
  "homepage": "https://s3-eu-west-1.amazonaws.com/development.bedfont.com/NObreathV2/SDK/iOS/versions/1.0.0/docs/index.html",
  "license": {
    "type": "Custom",
    "text": "    Copyright (c) 2023 Bedfont Scientific Ltd.\n\n    All information contained herein is, and remains the property of\n    Bedfont Scientific Ltd. The intellectual and technical concepts\n    contained herein are proprietary to Bedfont Scientific Ltd and may be\n    covered by U.K. and Foreign Patents, patents in process, and are\n    protected by trade secret or copyright law. Dissemination of this\n    information or reproduction of this material is strictly forbidden\n    unless prior written permission is obtained from Bedfont Scientific\n    Ltd.\n    MIT License\n\n    Copyright (c) 2023 Steamclock Software\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE.\n\n"
  },
  "authors": {
    "Bedfont Scientific Ltd.": "developer@bedfont.com"
  },
  "platforms": {
    "ios": "13"
  },
  "ios": {
    "vendored_frameworks": "NObreathSDK.xcframework"
  },
  "exclude_files": "Classes/Exclude",
  "user_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  },
  "pod_target_xcconfig": {
    "EXCLUDED_ARCHS[sdk=iphonesimulator*]": "arm64"
  }
}
