{
  "name": "iosvoipsdk",
  "version": "1.0.9",
  "summary": "siprtc dot io. VOIP SDK for the iOS iPhone.",
  "description": "SIPRTC.io iOS SDK for iPhone and iOS is a software development kit (SDK) designed to facilitate the integration of SIP (Session Initiation Protocol) communication capabilities into iOS applications. SIPRTC.io provides tools and resources for developers to implement real-time voice and video communication features using SIP technology on iOS devices.\n\nKey features of the SIPRTC.io iOS SDK may include:\n\n1. **SIP Protocol Support:** The SDK likely includes support for the SIP protocol, which is widely used for initiating, maintaining, and terminating communication sessions over IP networks.\n\n2. **Voice and Video Communication:** Developers can leverage the SDK to enable voice and video calling functionalities within their iOS applications. This could include features such as one-to-one or group calls, audio/video conferencing, and more.\n\n3. **Codec Support:** The SDK may support various audio and video codecs to ensure compatibility and optimize the quality of voice and video streams transmitted during communication sessions.\n\n4. **User Interface Components:** SIPRTC.io may offer pre-built user interface components or customizable UI elements that developers can integrate into their iOS apps to provide a seamless calling experience for users.\n\n5. **Network Handling:** The SDK likely includes functionalities for handling network connectivity, such as managing Wi-Fi and cellular connections, handling network disruptions, and optimizing bandwidth usage for voice and video streams.\n\n6. **Security Features:** Security is paramount in communication applications. The SDK may provide encryption capabilities to secure voice and video data transmission, as well as authentication mechanisms to ensure the identity of users participating in communication sessions.\n\n7. **Documentation and Support:** SIPRTC.io likely provides comprehensive documentation, tutorials, and sample code to assist developers in integrating the SDK into their iOS applications. Additionally, developer support channels such as forums, email support, or dedicated technical assistance may be available.\n\nOverall, the SIPRTC.io iOS SDK empowers developers to add robust SIP-based communication functionalities to their iPhone and iPad applications, enabling users to engage in voice and video calls directly within the app environment.",
  "homepage": "https://siprtc.io",
  "license": {
    "type": "Apache License, Version 2.0",
    "text": "    Licensed under the Apache License, Version 2.0 (the \"License\");\n    you may not use this file except in compliance with the License.\n    You may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\n    Unless required by applicable law or agreed to in writing, software\n    distributed under the License is distributed on an \"AS IS\" BASIS,\n    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n    See the License for the specific language governing permissions and\n    limitations under the License.\n"
  },
  "authors": {
    "SP": "shailesh@siprtc.io"
  },
  "platforms": {
    "ios": "17.2"
  },
  "source": {
    "git": "https://github.com/siprtcio/iosvoipsdk.git",
    "tag": "1.0.9"
  },
  "source_files": "iosvoipsdk/**/*.{h,m,hpp,cpp,mm}",
  "exclude_files": "iosvoipsdk/**/*.{cpp,mm,m}",
  "public_header_files": "iosvoipsdk/**/*.h",
  "vendored_frameworks": "Frameworks/libPJSIP.xcframework",
  "frameworks": [
    "UIKit",
    "AudioToolbox",
    "AVFoundation",
    "CoreMedia",
    "Foundation",
    "VideoToolbox"
  ],
  "xcconfig": {
    "GCC_PREPROCESSOR_DEFINITIONS": "PJ_AUTOCONF=1"
  }
}
